{"meta":{"title":"天边的博客","subtitle":null,"description":"坚持把简单的事情做好就是不简单，坚持把平凡的事情做好就是不平凡。所谓成功，就是在平凡中做出不平凡的坚持。","author":"天边","url":"https://blog.ccsyue.com"},"pages":[{"title":"关于","date":"2022-02-09T11:36:14.714Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"about/index.html","permalink":"https://blog.ccsyue.com/about/index.html","excerpt":"","text":"关于博客世上大概有两种人，“一种人毕生致力于拥有，另一种人毕生致力于有所作为。”一心渴望拥有，一旦没有达到目的，就会失落、痛苦和绝望。心无旁鹜，专心于事业的追求，就会忘掉许多烦恼，找到许多努力过程中的快乐。默默耕耘的人其实是最智慧的人。 关于作者 坚持把简单的事情做好就是不简单，坚持把平凡的事情做好就是不平凡。所谓成功，就是在平凡中做出不平凡的坚持。"},{"title":"目录结构","date":"2022-02-09T11:36:14.714Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"categories/index.html","permalink":"https://blog.ccsyue.com/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2022-02-09T11:36:14.766Z","updated":"2022-02-09T11:36:14.766Z","comments":true,"path":"tags/index.html","permalink":"https://blog.ccsyue.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"一年级语文下册(2016版)部编版教材目录(人民教育出版社)","slug":"2019-02-27-一年级语文下册(2016版)部编版教材目录(人民教育出版社)","date":"2019-02-27T15:54:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-02-27-一年级语文下册(2016版)部编版教材目录(人民教育出版社).html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-02-27-一年级语文下册(2016版)部编版教材目录(人民教育出版社).html","excerpt":"","text":"春夏秋冬春风 夏雨 秋霜 冬雪春风吹 夏雨落 秋霜降 冬雪飘青草 红花 游鱼 飞鸟池草青 山花红 鱼出水 鸟入林 姓氏歌你姓什么？我姓李。什么李？木子李。他姓什么？他姓张。什么张？弓长张。古月胡，口天吴，双人徐，言午许。中国姓氏有很多，赵、钱、孙、李，周，吴、郑、王，诸葛、东方，上官、欧阳…… 小青蛙河水清清天气晴，小小青蛙大眼睛。保护禾苗吃害虫，做了不少好事情。请你爱护小青蛙，好让禾苗不生病。 猜字谜（一）左边绿，右边红，左右相遇起凉风。绿的喜欢及时雨，红的最怕水来攻。（二）“言”来互相尊重，“心”至令人感动，“日”出万里无云，“水”到纯净透明。 祖国多么广大海南岛上，鲜花已经盛开，大兴安岭，雪花还在飘洒。当帕米尔高原，还挂着满天星斗，乌苏里江畔，已披上五彩朝霞。长江黄河挽起高山大海，我们的祖国多么广大。 日积月累春回大地 万物复苏柳绿花红 莺歌燕舞冰雪融化 泉水丁冬百花齐放 百鸟争鸣 吃水不忘挖井人瑞金城外有个村子叫沙洲坝，毛主席在江西领导革命的时候，在那儿住过。村子里没有水井，乡亲们吃水要到很远的地方去挑。毛主席就带领战士和乡亲们挖了一口井。解放以后，乡亲们在井旁边立了一块石碑，上面刻着：“吃水不忘挖井人，时刻想念毛主席。” 我多想去看看妈妈告诉我，沿着弯弯的小路，就会走出天山。遥远的北京城，有一座雄伟的天安门，广场上的升旗仪式非常壮观。我对妈妈说，我多想去看看，我多想去看看！爸爸告诉我，沿着宽宽的公路，就会走出北京。遥远的新疆，有美丽的天山，雪山上盛开着洁白的雪莲。我对爸爸说，我多想去看看，我多想去看看！ 一个接一个月夜，正玩着踩影子，就听大人叫着：“快回家睡觉！”唉，我好想再多玩一会儿啊。不过，回家睡着了，倒可以做各种各样的梦呢！正做着好梦，又听见大人在叫：“该起床上学啦！”唉，要是不上学就好了。不过，去了学校，就能见到小伙伴，多么开心哪！正和小伙伴们玩着跳房子，操场上却响起了上课铃声。唉，要是没有上课铃就好了。不过，听老师讲故事，也是很快乐很有趣的呀！别的孩子也是这样吗？也像我一样，这么想吗？ 四个太阳我画了个绿绿的太阳，挂在夏天的天空。高山、田野、街道、校园，到处一片清凉。我画了个金黄的太阳，送给秋天。果园里，果子熟了。金黄的落叶忙着邀请小伙伴，请他们尝尝水果的香甜。我画了个红红的太阳，送给冬天。阳光温暖着小朋友冻僵的手和脸。春天，春天的太阳该画什么颜色呢？哦，画个彩色的。因为春天是个多彩的季节。 春晓唐 孟浩然春眠不觉晓，处处闻啼鸟。夜来风雨声，花落知多少。 阳光阳光像金子，洒遍田野、高山和小河。田里的禾苗，因为有了阳光，更绿了。山上的小树，因为有了阳光，更高了。河面闪着阳光，小河就像长长的锦缎了。早晨，我拉开窗帘，阳光就跳进了我的家。谁也捉不住阳光，阳光是大家的。阳光像金子，阳光比金子更宝贵。 小公鸡和小鸭子小公鸡和小鸭子一块儿出去玩。他们走进草地里。小公鸡找到了许多虫子，吃得很欢。小鸭子捉不到虫子，急得直哭。小公鸡看见了，捉到虫子就给小鸭子吃。他们走到小河边。小鸭子说：“公鸡弟弟，我到河里捉鱼给你吃。”小公鸡说：“我也去。”小鸭子说：“不行，不行，你不会游泳，会淹死的！”小公鸡不信，偷偷地跟在小鸭子后面，也下了水。小鸭子正在水里捉鱼，忽然，听见小公鸡喊救命。他飞快地游到小公鸡身边，让小公鸡坐在自己的背(bei4)上。小公鸡上了岸，笑着对小鸭子说：“鸭子哥哥，谢谢你。”","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"一年级语文上册(2016版)部编版教材目录(人民教育出版社)","slug":"2019-02-09-一年级语文上册(2016版)部编版教材目录(人民教育出版社)","date":"2019-02-09T14:31:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-02-09-一年级语文上册(2016版)部编版教材目录(人民教育出版社).html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-02-09-一年级语文上册(2016版)部编版教材目录(人民教育出版社).html","excerpt":"","text":"春节童谣小孩小孩你别馋，过了腊八就是年。腊八粥，喝几天，哩哩啦啦二十三。二十三，糖瓜粘。二十四，扫房子。二十五，磨豆腐。二十六，去买肉。二十七，宰公鸡。二十八，把面发。二十九，蒸馒头。三十晚上熬一宿，初一初二满街走。 风唐代：李峤解落三秋叶，能开二月花。过江千尺浪，入竹万竿斜。 小蜗牛蜗牛一家住在小树林的旁边。春天来了，蜗牛妈妈对小蜗牛说：“孩子，到小树林里去玩吧，小树发芽了。”小蜗牛爬呀，爬呀，好久才爬回来。它说：“妈妈，小树长满了叶子，碧绿碧绿的，地上还长着许多草莓呢。”蜗牛妈妈说：“哦，已经是夏天了！快去摘几颗草莓回来。”小蜗牛爬呀，爬呀，好久才爬回来。它说：“妈妈，草莓没有了，地上长着蘑菇，树叶全变黄了。”蜗牛妈妈说：“哦，已经是秋天了！快去采几个蘑菇回来。”小蜗牛爬呀，爬呀，好久才爬回来。它说：“妈妈，蘑菇没有了，地上盖着雪，树叶全掉了。”蜗牛妈妈说：“哦，已经是冬天了！你就待在家里过冬吧。” 乌鸦喝水一只乌鸦口渴了，到处找水喝。乌鸦看见一个瓶子，瓶子里有水。但是，瓶子里水不多，瓶口又小，乌鸦喝不着水。怎么办呢？乌鸦看见旁边有许多小石子，想出办法来了。乌鸦把小石子一颗一颗地放进瓶子里，瓶子里的水渐渐升高，乌鸦就喝着水了。 雪地里的小画家下雪啦，下雪啦！雪地里来了一群小画家。小鸡画竹叶，小狗画梅花，小鸭画枫叶，小马画月牙。不用颜料不用笔，几步就成一幅画。青蛙为什么没参加？ 猴子捞月亮有只小猴子在井边玩。他往井里一看，里面有个月亮。小猴子叫起来：“糟啦，糟啦！月亮掉在井里啦！”大猴子听见了，跑过来一看，跟着叫起来：“糟啦，糟啦！月亮掉在井里啦！”老猴子听见了，跑过来一看，也跟着叫起来：“糟啦，糟啦！月亮掉在井里啦！”附近的猴子听见了，都跑过来看。大家跟着叫起来：“糟啦，糟啦！月亮掉在井里啦！咱们快把它捞上来！”猴子们爬上了井旁边的大树。老猴子倒挂在树上，拉住大猴子的脚。大猴子也倒挂着，拉住另一只猴子的脚。猴子们就这样一只接一只，一直挂到井里头，小猴子挂在最下边。小猴子伸手去捞月亮。手刚碰到水，月亮就不见了。老猴子一抬头，看见月亮还在天上，他喘着气，说：“不用捞了，不用捞了，月亮好好地挂在天上呢！” 日积月累：种瓜得瓜种瓜得瓜，种豆得豆。前人栽树，后人乘凉。千里之行，始于足下。百尺竿头，更进一步。 项链大海，蓝蓝的，又宽又远。沙滩，黄黄的，又长又软。雪白雪白的浪花，哗哗笑着，涌向沙滩，悄悄撒下小小的海螺和贝壳。小娃娃嘻嘻地笑着，迎上去，捡起小小的海螺和贝壳，穿成彩色的项链，挂在胸前。快活的脚印落在沙滩上，穿成金色的项链，挂在大海胸前。 大还是小有时候，我觉得自己很大。我自己穿衣服的时候，我自己系鞋带的时候，我觉得自己很大。有时候，我觉得自己很小。我够不到按钮的时候，我听到雷声喊妈妈的时候，我觉得自己很小。有时候，我希望自己不要长大。更多的时候，我盼着自己快点儿长大。 明天要远足翻过来……唉！睡不着。那地方的海，真的像老师说的那么多种颜色吗？翻过去……唉！睡不着。那地方的云，真的像同学说的那么洁白柔软吗？翻过来……翻过去……唉！到底什么时候才天亮呢？ 谁会飞谁会飞？鸟会飞。鸟儿怎样飞？扇扇翅膀去又回。谁会跑？马会跑。马儿怎样跑？四脚腾空仰天叫。谁会游？鱼会游。鱼儿怎样游？摇摇尾巴摆摆头。 古朗月行（节选）唐代：李白小时不识月，呼作白玉盘。又疑瑶台镜，飞在青云端。 背一背：前后左右前后左右，东西南北。早晨起来，面向太阳。前面是东，后面是西。左面是北，右面是南。 雨点儿数不清的雨点儿，从云彩里飘落下来。半空中，大雨点儿问小雨点儿：“你要到哪里去？”小雨点儿回答：“我要去有花有草的地方。你呢？”大雨点儿说：“我要去没有花没有草的地方。”不久，有花有草的地方，花更红了，草更绿了。没有花没有草的地方，开出了红的花，长出了绿的草。 青蛙写诗下雨了，雨点儿淅沥沥，沙啦啦。青蛙说：“我要写诗啦”！小蝌蚪又过来说：“我要给你当个小逗号。”池塘里的水泡泡说：“我能当个小句号。”荷叶上的一串水珠说：“我们可以当省略号。”青蛙的诗写成了：“呱呱，呱呱，呱呱呱(gua1)。呱呱，呱呱，呱呱呱(gua1)……” 比尾巴谁的尾巴长？谁的尾巴短？谁的尾巴好像一把伞？猴子的尾巴长。兔子的尾巴短。松鼠的尾巴好像一把伞。谁的尾巴弯？谁的尾巴扁？谁的尾巴最好看？公鸡的尾巴弯。鸭子的尾巴扁。孔雀的尾巴最好看。 影子影子在前，影子在后，影子常常跟着我，就像一条小黑狗。影子在左，影子在右，影子常常陪着我，它是我的好朋友。 拔萝卜老公公(gong5)种了一个萝卜。萝卜长大了，老公公(gong5)去地里拔萝卜。老公公(gong5)拉着萝卜叶子，嗨(hai1)哟(yo1)！嗨(hai1)哟(yo1)！”拔呀拔，拔不动。老公公(gong5)喊老婆婆(po5)来帮忙。老婆婆(po5)拉着老公公(gong5)，老公公(gong5)拉着萝卜叶子，“嗨(hai1)哟(yo1)！嗨(hai1)哟(yo1)”拔呀拔，拔不动。老婆婆(po5)喊小姑娘来帮忙。小姑娘拉着老婆婆(po5)，老婆婆(po5)拉着老公公(gong5)，老公公(gong5)拉着萝卜叶子，“嗨(hai1)哟(yo1)！嗨(hai1)哟(yo1)！”拔呀拔，拔不动。小姑娘喊小狗来帮忙。小狗拉着小姑娘，小姑娘拉着老婆婆(po5)，老婆婆(po5)拉着老公公(gong5)，老公公(gong5)拉着萝卜叶子吗，“嗨(hai1)哟(yo1)！嗨(hai1)哟(yo1)！”拔呀拔，拔不动。 悯农（其二）悯农唐代：李绅春种一粒粟，秋收万颗子。四海无闲田，农夫犹饿死。 升国旗中国，国旗，五星红旗五星红旗，我们的国旗。国歌声中，徐徐升起。迎风飘扬，多么美丽。向着国旗，我们立正。望着国旗，我们敬礼。 日月明日月明，田力男。小大尖，小土尘。二人从，三人众。双木林，三木森。一人不成众，独木不成林。众人一条心，黄土变成金。 小书包橡皮，尺子，作业本笔袋，铅笔，转笔刀我的小书包，宝贝真不少。课本作业本，铅笔转笔刀。上课静悄悄，下课不乱跑。天天起得早，陪我去学校。 大小多少一个大，一个小，一头黄牛一只猫。一边多，一边少，一群鸭子一只鸟。一个大，一个小，一个苹果一颗枣。一边多，一边烧，一堆杏子一个桃。 画远看山有色，近听水无声，春去花还在，人来鸟不惊。 小松鼠找花生大树旁边的地里种了许多花生。花生已经开花了，一朵朵金黄色的小花，在阳光下格外鲜艳。小松鼠问鼹鼠：“这是什么花呀？”鼹鼠说：“这是花生的花。到了秋天，会结花生，花生可好吃啦！”小松鼠很高兴，他想：等花结了果，我就把花生摘下来，留着冬天吃。小松鼠每天都到地里去，看看结花生了没有。他等啊，等啊，等到花都落光了，也没看见一个花生。小松鼠感到很奇怪，自言自语地说：“是谁把花生摘走了呢？” 日积月累：一日之计在于晨一日之计在于晨，一年之计在于春。一寸光阴一寸金，寸金难买寸光阴。 四季草芽尖尖，他对小鸟说：“我是春天。”荷叶圆圆，他对青蛙说：“我是夏天。”谷穗弯弯，他鞠着躬说：“我是秋天。”雪人大肚子一挺，他顽皮地说：“我就是冬天。” 江南汉乐府江南可采莲，莲叶何田田。鱼戏莲叶间。鱼戏莲叶东,鱼戏莲叶西，鱼戏莲叶南，鱼戏莲叶北。 小小的船作者：叶圣陶弯弯的月儿小小的船。小小的船儿两头尖。我在小小的船里坐，只看见闪闪的星星蓝蓝的天。 秋天天气凉了，树叶黄了，一片片叶子从树上落下来。一群大雁往南飞，一会儿排成个“人”字，一会儿排成个“一”字。啊！秋天来了！ 小鸟念书老师教大家读书，老师念一句，我们跟着念一句。窗外的风吹着，“稀稀沙沙”；窗外的鸟叫着，“叽叽喳喳”。老师说：风也在教小鸟念书吗？我们仔细地听，窗外的风念着：“稀稀沙沙。”窗外的鸟叫着：“叽叽喳喳。”每一个人都笑了，哈哈！小鸟都念错啦！ 过马路红灯停、绿灯行，交通路牌要看清。过街要走人行道，交通规则须记牢。 家蓝天是白云的家。树林是小鸟的家。小河是鱼儿的家。泥土是种子的家。我们是祖国的花朵，祖国就是我们的家。 月儿弯弯我的家在月亮湾，月亮湾是个美丽的村子。村子的前面有一条月牙一样的小河，河上有一座石桥。河水绕着村子缓缓地流着，一群群鱼儿在河里游来游去。清清的河水倒映着小桥、绿树和青山。河岸上长着许多桃树。春天，树上开满了桃花，远远望去，像一片灿烂的朝霞。过了桥，是一片绿油油的农田。村子的后面是山。山坡上有一片茶树。茶园里不时飘来采茶姑娘欢快的笑声。 欢迎台湾小朋友一只船，扬白帆，飘呀飘到台湾。接来台湾小朋友，到我学校玩一玩。伸出双手紧紧握，热情的话儿说不完。 小白兔小白兔，穿皮袄，耳朵长，尾巴小，三瓣嘴，胡子翘，一动一动总在笑。 剪窗花小剪刀，手中拿，我学奶奶剪窗花。剪梅花，剪雪花，剪对喜鹊叫喳喳。剪只鸡，剪只鸭，剪条鲤鱼摇尾巴。大红鲤鱼谁来抱？哦！再剪一个胖娃娃。 绕口令：四是四四是四，十是十。十四是十四，四十是四十。四十不是十四，十四不是四十。 过桥计算题，三四道，一排等号像小桥。算对了，走过桥，做错了，过不了。想一想，算一算，快快乐乐过了桥。 在一起小黄鸡，小黑鸡，欢欢喜喜在一起。刨刨土，捉捉虫，青草地上做游戏。 说话小溪流说话，哗哗，哗哗。小雨点说话，沙沙，沙沙。小鸽子说话，咕咕，咕咕。小鸭子说话，嘎嘎，嘎嘎。小花猫说话，喵喵，喵喵。小青蛙说话，呱呱，呱呱。 轻轻跳小兔小兔轻轻跳，小狗小狗慢慢跑，要是踩疼了小草，我就不跟你们好。 小兔子乖乖小兔子乖乖，把门儿开开快点儿开开，我要进来。不开不开，我不开，妈妈没回来，谁来也不开。小兔子乖乖，把门儿开开，快点儿开开，我要进来。就开就开，我就开，妈妈回来了，这就把门开。 咏鹅唐代：骆宾王鹅鹅鹅，曲项向天歌。白毛浮绿水，红掌拨清波。 识字加油站：一片两片三四片一片两片三四片，五六七八九十片；千片万片无数片，飞入梅花总不见。 对韵歌云对雨，雪对风。花对鸟，鱼对虫。山清对水秀，柳绿对桃红。 站如松站如松，坐如松。行如风，卧如弓。 金木水火土一二三四五，金木水火土。天地分上下，日月照今古。 天地人你我他 上学歌太阳当空照，花儿对我笑。小鸟说：“早早早，你为什么背上小书包？”我去上学校，天天不迟到。爱学习，爱劳动。长大要为人民立功劳。","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"使用excel生成图片扫描件","slug":"2019-02-09-使用excel生成图片扫描件","date":"2019-02-08T22:25:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-02-09-使用excel生成图片扫描件.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-02-09-使用excel生成图片扫描件.html","excerpt":"","text":"资源excel文档1yuwen_s1yuwen_x1shuxue_s1shuxue_x 文件目录结构 imgs audio styles book.json excel目录结构 A B C D E 目录级别 标题 页码 md目录 cmd生成md F G cmd生成README.md(cmd中文:chcp 65001) cmd生成SUMMARY.md(cmd中文:chcp 65001) H I 实体书页码 markdown图片链接 SUMMARY项1=IF(A2=1,&quot;* &quot;,IF(A2=2,&quot; * &quot;,&quot; * &quot;))&amp;IF(AND(C3=C2,A3&lt;&gt;A2),B2,&quot;[&quot;&amp;B2&amp;&quot;](&quot;&amp;C2&amp;&quot;.md)&quot;) 图片链接列1^![](imgs/1.jpg) 文档生成列123456789101112#cmd生成md=IF(C3=C2,&quot;&quot;,&quot;echo &quot;&amp;PHONETIC(OFFSET(I$2,C2-1,0,IF(C3=&quot;&quot;,1,C3-C2)))&amp;&quot;&gt;&quot;&amp;C2&amp;&quot;.md&quot;)#cmd生成md(带视频）=IF(C3=C2,&quot;&quot;,IF(COUNTIF(OFFSET(A$2,MATCH(&quot;朗读标记&quot;,A:A,1),0,MATCH(&quot;朗读标记&quot;,A:A,1)*2,1),C2)=0,&quot;echo.&gt;&quot;&amp;C2&amp;&quot;.md&quot;&amp;CHAR(10),&quot;echo &#123;% raw %&#125;&quot;&amp;&quot;&gt;&quot;&amp;C2&amp;&quot;.md&quot;&amp;CHAR(10)&amp;&quot;echo ^&lt;video src=&apos;audio/&quot;&amp;C2&amp;&quot;.mp3&apos; ontrols=&apos;controls&apos;^&gt;^&lt;/video^&gt;&quot;&amp;&quot;&gt;&gt;&quot;&amp;C2&amp;&quot;.md&quot;&amp;CHAR(10)&amp;&quot;echo &#123;% endraw %&#125;&quot;&amp;&quot;&gt;&gt;&quot;&amp;C2&amp;&quot;.md&quot;&amp;CHAR(10))&amp;&quot;echo &quot;&amp;PHONETIC(OFFSET(E$2,C2-1,0,IF(C3=&quot;&quot;,1,C3-C2)))&amp;&quot;&gt;&gt;&quot;&amp;C2&amp;&quot;.md&quot;)#cmd生成README.md(cmd中文:chcp 65001)echo # 一年级数学下册(2016版)部编版教材目录(人民教育出版社)&gt;README.md=&quot;echo &quot;&amp;D2&amp;&quot;:&quot;&amp;IF(OR(C3=C2,C3=&quot;&quot;),INDIRECT(&quot;r&quot;&amp;(1+C2)&amp;&quot;c8&quot;,FALSE),PHONETIC(OFFSET(H$2,C2-1,0,IF(C3=&quot;&quot;,1,C3-C2))))&amp;&quot;&gt;&gt;README.md&quot;#cmd生成SUMMARY.md(cmd中文:chcp 65001)echo # 一年级数学下册(2016版)部编版教材目录(人民教育出版社)&gt;SUMMARY.md=&quot;echo &quot;&amp;D2&amp;&quot;&gt;&gt;SUMMARY.md&quot; 操作步骤 采集图片资源到imgs文件剑侠，mp3或视频到audio下，clone一份styles文件夹、book.json 修改bool.json里的title信息 将目录输入到excel文件中的A、B、C三列 修改F、G第二行的title信息 修改H列实体书页码，注意扫描页与其对应关系 打开windows CMD命令行，输入:chcp 65001，以防md文件出现乱码 CMD命令行下：复制粘贴excel中的公式生成md文章列表、README.md、SUMMARY.md","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"gitbook","slug":"gitbook","permalink":"https://blog.ccsyue.com/tags/gitbook/"}]},{"title":"书写带拼音博客","slug":"2019-02-07-书写带拼音博客","date":"2019-02-07T04:37:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-02-07-书写带拼音博客.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-02-07-书写带拼音博客.html","excerpt":"","text":"notpad++用正则替换12([\\u4e00-\\u9fa5])&#123;% ruby \\1 %&#125;","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[]},{"title":"钟表和时间单位","slug":"2019-02-07-钟表和时间单位","date":"2019-02-06T17:34:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-02-07-钟表和时间单位.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-02-07-钟表和时间单位.html","excerpt":"","text":"引子今天随便问了孩子一个数学题：小朋友排一排共13人，小明从从一端数排第6个，从另一端数排第几个？孩子：画图，回答第7个。我：帮助她数了一遍，是第8个，并补充了问题——需要列算式（两个算式）孩子：想了想，不会我：先算从另一端数共有几个孩子——也就是从另一端看最靠近小明的小朋友是第几个，13-6=7；在算从另一端数小明是第几个，7+1=8。 扩展我：小明生日是2012年8月6日，今天是2019年2月7日，小明虚岁、周岁分别是多少？孩子：不会我：你知道什么是周岁和虚岁吗？孩子：不知道 时间单位我：那你懂时间单位吗？世纪、年、月、天（日）、小时（时）、分钟（份）、秒？孩子：不懂我：那你现在看得懂钟表吗？时针、分针、秒针是什么关系吗？孩子：能知道几点，不知道关系我：好，那么我们得从时分秒等单位是什么说起来。你看得懂钟表上的刻度吗？孩子：不太懂 长度单位我：那我们先讲刻度。数轴：0-1-2-3-4-5-6-7-8-9-10-11-12一共有13个点（数），一共有多少间隔呢？13-1=12个间隔。表盘：将这条线的0和12这两个点叠在一起，形成一个钟表的盘面，一共有13-1=12个点（数），间隔没有变化还是12个。表盘刻度：现在我们把每个大点（数字）之间的间隔叫做大间隔，每个大间隔分成5个小间隔，那么我们规定表盘上的三个长度单位：圈、大间隔、小间隔。1圈=12大间隔，1大间隔=5小间隔，那么数一下：一圈=60小间隔就如阿拉伯数字表示个、十、百、千、万的十进制数一样，有进位加法和退位减法。1个百=10个十，1个十=10个1。其实说到时间单位，也一样。1世纪=100年，1年=12月，1月=30天（平均），1天=24小时，1小时=60分钟，1分钟=60秒表盘刻度我们定义了圈、大间隔、小间隔是长度单位，和体重单位一样。 用运动定义时间单位天时分秒接下来我们用时针、分针、秒针的运动定义时分秒：1小时=时针走1个大间隔=时针走5个小间隔1分钟=分针走1个小间隔1秒钟=秒针走1个小间隔还有时分秒之间的进退位，钟表只能表示一天内的时间，没办法记录世纪、年、月、日。年月日我们看公历，世纪我们可以用年份来算。秒针走1圈=秒针走12大间隔=秒针走60小间隔后，就会产生进位加法，分针会走1小间隔，也叫1分钟分针走1圈=分针走12大间隔=分针走60小间隔后，又会产生进位加法，时针会走1大间隔（5小间隔），也叫1小时时针走1圈=时针走12大间隔=时针走60小间隔后，不会向天进位。因为只过了12个小时，24个小时才会产生进位，只是钟表不体现天。怎样才会是一天呢？时针走2圈=时针走24大间隔=时针走120小间隔后，才是24小时，咱们才说过了一天。 年月日（天）翻开安卓日历，年的缩小日历。1年12个月，每个月的天数有些不同，但是平均按30天走。也会产生进位加法和退位减法。 世纪公元2019年是20+1=21世纪，公元330年是3+1=4世纪。公元3年是0+1=1世纪。 虚岁、周岁今年是2019年，就是从公元1年（公元元年）数到现在一共是2019年；出生年份是2012年，从公元1年数排第2012，那么从2019开始数，2012是第几个就是多少虚岁。出生的那一年到新年虽然不满1年也算成1年。我们套用一下，上面小明的公式。从2019年数，2013年排第几个：2019-2012=7；2012年排7+1=8。那么就是8虚岁。周岁呢？不仅要考虑出生年份，月份和日期也得考虑，2012年8月6日到2013年1月1日不算1年，到2013年8月6日才算小明1岁了，那么2018年8月6日，小明满几周岁了？一样的，2018-2013=5，5+1=6，是6周岁。2019年8月6日小明是7周岁，那么小明现在是6周岁。","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"共产党宣言","slug":"2019-01-19-共产党宣言","date":"2019-01-19T15:16:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-01-19-共产党宣言.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-01-19-共产党宣言.html","excerpt":"","text":"序言1872年德文版序言共产主义者同盟这个在当时条件下自然只能是秘密团体的国际工人组织，1847年11月在伦敦举行的代表大会上委托我们两人起草一个准备公布的详细的理论和实践的党纲。结果就产生了这个《宣言》，《宣言》原稿在二月革命前几星期送到伦敦付印。《宣言》最初用德文出版，它用这种文字在德国、英国和美国至少印过十二种不同的版本。第一个英译本是由海伦·麦克法林女士翻译的，于1850年在伦敦《红色共和党人》杂志上发表，1871年至少又有三种不同的英译本在美国出版。法译本于1848年六月起义前不久第一次在巴黎印行，最近又有法译本在纽约《社会主义者报》上发表；现在有人在准备新译本。波兰文译本在德文本初版问世后不久就在伦敦出现。俄译本是60年代在日内瓦出版的。丹麦文译本也是在原书问世后不久就出版了。不管最近25年来的情况发生了多大的变化，这个《宣言》中所阐述的一般原理整个说来直到现在还是完全正确的。某些地方本来可以作一些修改。这些原理的实际运用，正如《宣言》中所说的，随时随地都要以当时的历史条件为转移，所以第二章末尾提出的那些革命措施根本没有特别的意义。如果是在今天，这一段在许多方面都会有不同的写法了。由于最近25年来大工业有了巨大发展而工人阶级的政党组织也跟着发展起来，由于首先有了二月革命的实际经验而后来尤其是有了无产阶级第一次掌握政权达两月之久的巴黎公社的实际经验，所以这个纲领现在有些地方已经过时了。特别是公社已经证明：“工人阶级不能简单地掌握现成的国家机器，并运用它来达到自己的目的。”（见《法兰西内战。国际工人协会总委员会宣言》德文版第19页，那里把这个思想发挥得更加完备。）其次，很明显，对于社会主义文献所作的批判在今天看来是不完全的，因为这一批判只包括到1847年为止；同样也很明显，关于共产党人对待各种反对党派的态度的论述（第四章）虽然在原则上今天还是正确的，但是就其实际运用来说今天毕竟已经过时，因为政治形势已经完全改变，当时所列举的那些党派大部分已被历史的发展彻底扫除了。但是《宣言》是一个历史文件，我们已没有权利来加以修改。下次再版时也许能加上一篇论述1847年到现在这段时期的导言。这次再版太仓促了，我们来不及做这件工作。卡尔·马克思 费里德里希·恩格斯1872年6月24日于伦敦 1882年俄文版序言巴枯宁翻译的《共产党宣言》俄文第一版，60年代初由《钟声》印刷所出版。当时西方只能认为这件事（《宣言》译成俄文出版）是著作界的一件奇闻。这种看法今天是不可能有了。当时（1847年12月），卷入无产阶级运动的地区是多么狭小，这从《宣言》最后一章《共产党人对各国各种反对党派的态度》中可以看得很清楚。在这一章里，正好没有说到俄国和美国。那时，俄国是欧洲全部反动势力的最后一支庞大后备军；美国正通过移民吸收欧洲无产阶级的过剩力量。这两个国家，都向欧洲提供原料，同时又都是欧洲工业品的销售市场。所以，这两个国家不管怎样当时都是欧洲现存秩序的支柱。今天，情况完全不同了！正是欧洲移民，使北美能够进行大规模的农业生产，这种农业生产的竞争震撼着欧洲大小土地所有制的根基。此外，这种移民还使美国能够以巨大的力量和规模开发其丰富的工业资源，以至于很快就会摧毁西欧特别是英国迄今为止的工业垄断地位。这两种情况反过来对美国本身也起着革命作用。作为整个政治制度基础的农场主的中小土地所有制，正逐渐被大农场的竞争所征服；同时，在各工业区，人数众多的无产阶级和神话般的资本积聚第一次发展起来了。现在来看看俄国吧！在1848-1849年革命期间，不仅欧洲的君主，而且连欧洲的资产者，都把俄国的干涉看作是帮助他们对付刚刚开始觉醒的无产阶级的唯一救星。沙皇被宣布为欧洲反动势力的首领。现在，沙皇在加特契纳成了革命的俘虏，而俄国已是欧洲革命运动的先进部队了。《共产党宣言》的任务，是宣告现代资产阶级所有制必然灭亡。但是在俄国，我们看见，除了迅速盛行起来的资本主义狂热和刚开始发展的资产阶级土地所有制外，大半土地仍归农民公共占有。那么试问：俄国公社，这一固然已经大遭破坏的原始土地公共占有形式，是能够直接过渡到高级的共产主义的公共占有形式呢？或者相反，它还必须先经历西方的历史发展所经历的那个瓦解过程呢？对于这个问题，目前唯一可能的答复是：假如俄国革命将成为西方无产阶级革命的信号而双方互相补充的话，那么现今的俄国土地公有制便能成为共产主义发展的起点。卡尔·马克思 费里德里希·恩格斯1882年1月21日于伦敦 1883年德文版序言本版序言不幸只能由我一个人署名了。马克思这位比其他任何人都更应受到欧美整个工人阶级感谢的人物，已经长眠于海格特公墓，他的墓上已经初次长出了青草。在他逝世以后，就更谈不上对《宣言》作什么修改或补充了。因此，我认为更有必要在这里再一次明确地申述下面这一点。贯穿《宣言》的基本思想：每一历史时代的经济生产以及必然由此产生的社会结构，是该时代政治的和精神的历史的基础；因此（从原始土地公有制解体以来）全部历史都是阶级斗争的历史，即社会发展各个阶段上被剥削阶级和剥削阶级之间、被统治阶级和统治阶级之间斗争的历史；而这个斗争现在已经达到这样一个阶段，即被剥削被压迫的阶级（无产阶级），如果不同时使整个社会永远摆脱剥削、压迫和阶级斗争，就不再能使自己从剥削它压迫它的那个阶级（资产阶级）下解放出来，——这个基本思想完全是属于马克思一个人的。这一点我已经屡次说过，但正是现在必须在《宣言》本身的前面也写明这一点。费·恩格斯1883年6月28日于伦敦 1888年英文版序言《宣言》是作为共产主义者同盟的纲领发表的，这个同盟起初纯粹是德国工人团体，后来成为国际工人团体，而在1848年以前欧洲大陆的政治条件下必然是一个秘密的团体。1847年11月在伦敦举行的同盟代表大会，委托马克思和恩格斯起草一个准备公布的完备的理论和实践的党纲。手稿于1848年1月用德文写成，并在2月24日的法国革命前几星期送到伦敦付印。法译本于1848年六月起义前不久在巴黎出版。第一个英译本是由海伦·麦克法林女士翻译的，于1850年刊载在乔治·朱利安·哈尼的伦敦《红色共和党人》杂志上。还出版了丹麦文译本和波兰文译本。1848年巴黎六月起义这一无产阶级和资产阶级间的第一次大搏斗的失败，又把欧洲工人阶级的社会的和政治的要求暂时推到后面去了。从那时起，争夺统治权的斗争，又像二月革命以前那样只是在有产阶级的各个集团之间进行了；工人阶级被迫局限于争取一些政治上的活动自由，并采取中等阶级激进派极左翼的立场。凡是继续显露出生机的独立的无产阶级运动，都遭到无情的镇压。例如，普鲁士警察发觉了当时设在科隆的共产主义者同盟中央委员会。一些成员被逮捕，并且在经过18个月监禁之后于1852年10月被交付法庭审判。这次有名的“科隆共产党人案件”从10月4日一直继续到11月12日；被捕者中有7人被判处3-6年的要塞监禁。宣判之后，同盟即由剩下的成员正式解散。至于《宣言》，似乎注定从此要被人遗忘了。当欧洲工人阶级重新聚集了足以对统治阶级发动另一次进攻的力量的时候，产生了国际工人协会。但是这个协会成立的明确目的是要把欧美正在进行战斗的整个无产阶级团结为一个整体，因此，它不能立刻宣布《宣言》中所提出的那些原则。国际必须有一个充分广泛的纲领，使英国工联，法国、比利时、意大利和西班牙的蒲鲁东派以及德国的拉萨尔派都能接受。马克思起草了这个能使一切党派都满意的纲领，他对共同行动和共同讨论必然会产生的工人阶级的精神发展充满信心。反资本斗争中的种种事件和变迁——失败更甚于胜利——不能不使人们认识到他们的各种心爱的万应灵丹都不灵，并为他们更透彻地了解工人阶级解放的真正的条件开辟道路。马克思是正确的。当1874年国际解散时，工人已经全然不是1864年国际成立时的那个样子了。法国的蒲鲁东主义和德国的拉萨尔主义已经奄奄一息，甚至那些很久以前大多数已同国际决裂的保守的英国工联也渐有进步，以致去年在斯旺西，工联的主席能够用工联的名义声明说：“大陆社会主义对我们来说再不可怕了。”的确，《宣言》的原则在世界各国工人中间都已传播得很广了。这样，《宣言》本身又重新走上了前台。从1850年起，德文本在瑞士、英国和美国重版过数次。1872年，有人在纽约把它译成英文，并在那里的《伍德赫尔和克拉夫林周刊》上发表。接着又有人根据这个英文本把它译成法文，刊载在纽约的《社会主义者报》上。以后在美国又至少出现过两种多少有些损害原意的英文译本，其中一种还在英国重版过。由巴枯宁翻译的第一个俄文本约于1863年在日内瓦由赫乐岑办的《钟声》印刷所出版；由英勇无畏的维拉·查苏利奇翻译的第二个俄文本，于1882年也在日内瓦出版。新的丹麦文译本于1885年在哥本哈根作为《社会民主主义丛书》的一种出版，新的法文译本于1886年刊载在巴黎的《社会主义者》报上。有人根据这个译本译成西班牙文，并于1886年在马德里发表。至于德文的翻印版本，则为数极多， 总共至少有12个。亚美尼亚文译本原应于几个月前在君士坦丁堡印出，但是没有问世，有人告诉我，这是因为出版人害怕在书上标明马克思的姓名，而译者又拒绝把《宣言》当作自己的作品。关于用其他文字出版的其他译本，我虽然听说过，但是没有亲眼看到。因此《宣言》的历史在很大程度上反映着现代工人阶级运动的历史；现在，它无疑是全部社会主义文献中传播最广和最具有国际性的著作，是从西伯利亚到加利福尼亚的千百万工人公认的共同纲领。可是，当我们写这个《宣言》时，我们不能把它叫作社会主义宣言。在1847年，所谓社会主义者，一方面是指各种空想主义体系的信徒，即英国的欧文派和法国的傅立叶派，这两个流派都已经降到纯粹宗派的地位，并在逐渐走向灭亡；另一方面是指形形色色的社会庸医，他们凭着各种各样的补缀办法，自称要消除一切社会弊病而毫不危及资本和利润。这两种人都是站在工人阶级运动以外，宁愿向“有教养的”阶级寻求支持。只有工人阶级中确信单纯政治变革还不够而公开表明必须根本改造全部社会的那一部分人，只有他们当时把自己叫作共产主义者。这是一种粗糙的、尚欠修琢的、纯粹出于本能的共产主义；但它却接触到了最主要之点，并且在工人阶级当中已经强大到足以形成空想共产主义，在法国有卡贝的共产主义，在德国有魏特林的共产主义。可见，在1847年，社会主义是中等阶级的运动，而共产主义则是工人阶级的运动。当时，社会主义，至少在大陆上，是“上流社会的”，而共产主义却恰恰相反。既然我们自始就认定“工人阶级的解放应当是工人阶级自己的事情”，那么，在这两个名称中间我们应当选择哪一个，就是毫无疑义的了。而且后来我们也从没有想到要把这个名称抛弃。虽然《宣言》是我们两人共同的作品，但我认为自己有责任指出，构成《宣言》核心的基本思想是属于马克思的。这个思想就是：每一历史时代主要的经济生产方式和交换方式以及必然由此产生的社会结构，是该时代政治的和精神的历史所赖以确立的基础，并且只有从这一基础出发，这一历史才能得到说明；因此人类的全部历史（从土地公有的原始氏族社会解体以来）都是阶级斗争的历史，即剥削阶级和被剥削阶级之间、统治阶级和被压迫阶级之间斗争的历史；这个阶级斗争的历史包括有一系列发展阶段，现在已经达到这样一个阶段，即被剥削被压迫的阶级（无产阶级），如果不同时使整个社会一劳永逸地摆脱一切剥削、压迫以及阶级差别和阶级斗争，就不能使自己从进行剥削和统治的那个阶级（资产阶级）的奴役下解放出来。在我看来这一思想对历史学必定会起到像达尔文学说对生物学所起的那样的作用，我们两人早在1845年前的几年中就已经逐渐接近了这个思想。当时我个人独自在这方面达到什么程度，我的《英国工人阶级状况》一书就是最好的说明。但是到1845年春我在布鲁塞尔再次见到马克思时，他已经把这个思想考虑成熟，并且用几乎像我在上面所用的那样明晰的语句向我说明了。现在我从我们共同为1872年德文版写的序言中引录如下一段话：“不管最近25年来的情况发生了多大的变化，这个《宣言》中所阐述的一般原理整个说来直到现在还是完全正确的。某些地方本来可以作一些修改。这些原理的实际运用，正如《宣言》中所说的，随时随地都要以当时的历史条件为转移，所以第二章末尾提出的那些革命措施根本没有特别的意义。如果是在今天，这一段在许多方面都会有不同的写法了。由于1848年以来大工业已有了巨大发展而工人阶级的组织也跟着有了改进和增长，由于首先有了二月革命的实际经验而后来尤其是有了无产阶级第一次掌握政权达两月之久的巴黎公社的实际经验，所以这个纲领现在有些地方已经过时了。特别是公社已经证明：‘工人阶级不能简单地掌握现成的国家机器，并运用它来达到自己的目的。’（见《法兰西内战。国际工人协会总委员会宣言》伦敦1871年特鲁洛夫版第15页，那里把这个思想发挥得更加完备。）其次，很明显，对于社会主义文献所作的批判在今天看来是不完全的，因为这一批判只包括到1847年为止；同样也很明显，关于共产党人对待各种反对党派的态度的论述（第四章）虽然在原则上今天还是正确的，但是就其实际运用来说今天毕竟已经过时，因为政治形势已经完全改变，当时列举的那些党派大部分已被历史的发展彻底扫除了。但是《宣言》是一个历史文件，我们已没有权利来加以修改。”本版译文是由译过马克思《资本论》一书大部分的赛米尔·穆尔先生翻译的。我们共同把译文校阅过一遍，并且我还加了一些有关历史情况的注释。费里德里希·恩格斯1888年1月30日于伦敦 1890年德文版序言自从我写了上面那篇序言以来，又需要刊印《宣言》的新的德文版本了，同时《宣言》本身也有种种遭遇，应该在这里提一提。1882年在日内瓦出版了由维拉·查苏利奇翻译的第二个俄文本，马克思和我曾为这个译本写过一篇序言。可惜我把这篇序言的德文原稿遗失了，所以现在我只好再从俄文译过来，这样做当然不会使原稿增色。下面就是这篇序言：“巴枯宁翻译的《共产党宣言》俄文第一版，60年代初由《钟声》印刷所出版。当时西方认为《宣言》译成俄文出版最多只是著作界的一件奇闻。这种看法今天是不可能有了。在《宣言》最初发表时期（1848年1月）卷入无产阶级运动的地区是多么狭小，这从《宣言》最后一章《共产党人对各种反对党派的态度》中可以看得很清楚。在这一章里，首先没有说到俄国和美国。那时，俄国是欧洲反动势力的最后一支庞大后备军，向美国境内移民吸收着欧洲无产阶级的过剩力量。这两个国家，都向欧洲提供原料，同时又都是欧洲工业品的销售市场。所以，这两个国家不管怎样当时都是欧洲社会秩序的支柱。今天，情况完全不同了！正是欧洲移民，使北美的农业生产能够大大发展，这种发展通过竞争震撼着欧洲大小土地所有制的根基。此外，这种移民还使美国能够以巨大的力量和规模开发其丰富的工业资源，以至于很快就会摧毁西欧的工业垄断地位。这两种情况反过来对美国本身也起着革命作用。作为美国整个政治制度基础的自耕农场主的中小土地所有制，正逐渐被大农场的竞争所征服；同时，在各工业区，人数众多的无产阶级和神话般的资本积聚第一次发展起来了。现在来看看俄国吧！在1848—1849年革命期间，不仅欧洲的君主，而且连欧洲的资产者，都把俄国的干涉看作是帮助他们对付当时刚刚开始意识到自己力量的无产阶级的唯一救星。他们把沙皇宣布为欧洲反动势力的首领。现在，沙皇在加特契纳已成了革命的俘虏，而俄国已是欧洲革命运动的先进部队了。《共产党宣言》的任务，是宣告现代资产阶级所有制必然灭亡。但是在俄国，我们看见，除了狂热发展的资本主义制度和刚开始形成的资产阶级土地所有制外，大半土地仍归农民公共占有。那么试问：俄国农民公社，这一固然已经大遭破坏的原始土地公有制形式，是能直接过渡到高级的共产主义的土地所有制形式呢？或者，它还必须先经历西方的历史发展所经历的那个瓦解过程呢？对于这个问题，目前唯一可能的答复是：假如俄国革命将成为西方工人革命的信号而双方互相补充的话，那么现今的俄国公有制便能成为共产主义发展的起点。卡·马克思 费·恩格斯1882年1月21日于伦敦大约在同一时候，在日内瓦出版了新的波兰文译本：《共产党宣言》。随后又于1885年在哥本哈根作为《社会民主主义丛书》的一种出版了新的丹麦文译本。可惜这一译本不够完备；有几个重要的地方大概是因为译者感到难译而被删掉了，并且有些地方可以看到草率从事的痕迹，尤其令人遗憾的是，从译文中可以看出，要是译者细心一点，他是能够译得很好的。1886年在巴黎《社会主义者报》上刊载了新的法译文；这是到目前为止最好的译文。同年又有人根据这个法文本译成西班牙文，起初刊登在马德里的《社会主义者报》上，接着又印成单行本：《共产党宣言》，卡·马克思和费·恩格斯著，马德里，社会主义者报社，埃尔南·科尔特斯街8号。这里我还要提到一件奇怪的事。1887年，君士坦丁堡的一位出版商收到了亚美尼亚文的《宣言》译稿；但是这位好心人却没有勇气把这本署有马克思的名字的作品刊印出来，竟认为最好是由译者本人冒充作者，可是译者拒绝这样做。在英国多次刊印过好几种美国译本，但都不大确切。到1888年终于出版了一种可靠的译本。这个译本是由我的友人赛米尔·穆尔翻译的，并且在付印以前还由我们两人一起重新校阅过一遍。标题是：《共产党宣言》，卡尔·马克思和费里德里希·恩格斯著。经作者认可的英译本，由费里德里希·恩格斯校订并加注，1888年伦敦，威廉·里夫斯，东中央区弗利特街185号。这个版本中的某些注释，我已收入本版。《宣言》有它本身的经历。它出现的时候曾受到当时人数尚少的科学社会主义先锋队的热烈欢迎（第一篇序言里提到的那些译本便可以证明这一点），但是不久它就被那随着1848年6月巴黎工人失败而抬起头来的反动势力排挤到后台去了，最后，由于1852年11月科隆共产党人被判刑，它被“依法”宣布为非法。随着由二月革命开始的工人运动退出公开舞台，《宣言》也退到后台去了。当欧洲工人阶级又强大到足以对统治阶级政权发动另一次进攻的时候，产生了国际工人协会。它的目的是要把欧美整个战斗的工人阶级联合成一支大军。因此，它不能从《宣言》中提出的那些原则出发。它必须有一个不致把英国工联，法国、比利时、意大利和西班牙的蒲鲁东派以及德国的拉萨尔派拒之于门外的纲领。这样一个纲领即国际章程绪论部分，是马克思起草的，其行文之巧妙连巴枯宁和无政府主义者也不能不承认。至于说到《宣言》中所提出的那些原则的最终胜利，马克思把希望完全寄托于共同行动和共同讨论必然会产生的工人阶级的精神的发展。反资本斗争中的种种事件和变迁——失败更甚于胜利——不能不使进行斗争的人们明白自己一向所崇奉的那些万应灵丹都不灵，并使他们的头脑更容易透彻地了解工人解放的真正的条件。马克思是正确的。1874年，当国际解散的时候，工人阶级已经全然不是1864年国际成立时的那个样子了。罗曼语族各国的蒲鲁东主义和德国特有的拉萨尔主义已经奄奄一息，甚至当时极端保守的英国工联也渐有进步，以致1887年在斯旺西，工联的代表大会主席能够用工联的名义声明说：“大陆社会主义对我们来说再不可怕了。”而在1887年，大陆社会主义已经差不多完全是《宣言》中所宣布的那个理论了。因此，《宣言》的历史在某种程度上反映着1848年以来现代工人运动的历史。现在，它无疑是全部社会主义文献中传播最广和最具有国际性的著作，是从西伯利亚到加利福尼亚的所有国家的千百万工人共同的纲领。可是，当《宣言》出版的时候，我们不能把它叫作社会主义宣言。在1847年，所谓社会主义者是指两种人。一方面是指各种空想主义体系的信徒，特别是英国的欧文派和法国的傅立叶派，这两个流派当时都已经缩小成逐渐走向灭亡的纯粹的宗派。另一方面是指形形色色的社会庸医，他们想用各种万应灵丹和各种补缀办法来消除社会弊病而毫不伤及资本和利润。这两种人都是站在工人运动以外，宁愿向“有教养的”阶级寻求支持。至于当时确信单纯政治变革还不够而要求根本改造社会的那一部分工人，则把自己叫作共产主义者。这是一种还没有很好加工的、只是出于本能的、往往有些粗糙的共产主义；但它已经强大到足以形成两种空想的共产主义体系：在法国有卡贝的“伊加利亚”共产主义，在德国有魏特林的共产主义。在1847年，社会主义意味着资产阶级的运动，共产主义则意味着工人的运动。当时，社会主义，至少在大陆上，是上流社会的，而共产主义却恰恰相反。既然我们当时已经十分坚决认定“工人阶级的解放应当是工人阶级自己的事情”，所以我们一刻也不怀疑究竟应该在这两个名称中间选定哪一个名称。而且后来我们也根本没有想到要把这个名称抛弃。“全世界无产者，联合起来！”当42年前我们在巴黎革命即无产阶级带着自己的要求参加的第一次革命的前夜向世界上发出这个号召时，响应者还是寥寥无几。可是，1864年9月28日，大多数西欧国家中的无产者已经联合成为流芳百世的国际工人协会了。固然，国际本身只存在了9年，但它所创立的全世界无产者永久的联合依然存在，并且比任何时候更加强固，而今天这个日子就是最好的证明。因为今天我写这个序言的时候，欧美无产阶级正在检阅自己第一次动员起来的战斗力量，他们动员起来，组成一支大军，在一个旗帜下，为了一个最近的目的，即早已由国际1866年日内瓦代表大会宣布、后来又由1889年巴黎工人代表大会再度宣布的在法律上确立八小时正常工作日。今天的情景定会使全世界的资本家和地主看到：全世界的无产者现在真正联合起来了。如果马克思今天还能同我站在一起亲眼看见这种情景，那该多好呵！费·恩格斯1890年5月1日于伦敦 1892年波兰文版序言从目前已有必要出版《共产党宣言》波兰文新版本这一事实，可以引起许多联想。首先值得注意的是，近来《宣言》在某种程度上已经成为测量欧洲大陆大工业发展的一种尺度。某一国家的大工业越发展，该国工人想要弄清他们作为工人阶级在有产阶级面前所处地位的愿望也就越强烈，工人中间的社会主义运动也就越扩大，对《宣言》的需求也就越增长。这样，根据《宣言》用某国文字发行的份数，不仅可以相当准确地判断该国工人运动状况，而且可以相当准确地判断该国大工业发展的程度。因此，《宣言》波兰文新版本，标志着波兰工业的重大发展。而且从10年前上一版问世以来确实已有这种发展，这是丝毫不容置疑的。俄罗斯的波兰，会议桌上的波兰，已成为俄罗斯帝国的巨大的工业区。俄国大工业分散于各处，一部分在芬兰湾沿岸，一部分在中央区（莫斯科和弗拉基米尔），一部分在黑海和亚速海沿岸，还有一些分散在其他地方；波兰工业则集中于一个比较狭小的地区，这种集中所产生的益处和害处，它都感受到了。这种益处是竞争对手俄国工厂主所承认的，他们虽然拚命想把波兰人变成俄罗斯人，同时却要求实行对付波兰的保护关税。至于这种害处，即对波兰工厂主和俄国政府的害处，则表现为社会主义思想在波兰工人中间迅速传播和对《宣言》的需求日益增长。但是，波兰工业的迅速发展（它已经超过了俄国工业），又是波兰人民拥有强大生命力的新的证明，是波兰人民即将达到民族复兴的新的保证。而一个独立强盛的波兰的复兴是一件不仅关系到波兰人而且关系到我们大家的事情。欧洲各民族的真诚的国际合作，只有当每个民族在自已家里完全自主的时候才能实现。1848年革命在无产阶级的旗帜下使无产阶级战士归根到底只做了资产阶级的工作，这次革命也通过自己的遗嘱执行人路易·波拿巴和俾斯麦实现了意大利、德国和匈牙利的独立。至于波兰，虽然它从1792年以来对革命所作的贡献比这三个国家所作的全部贡献还要大，可是它于1863年在十倍于自己的俄国优势下失败的时候，却被抛弃不管了。波兰贵族既没有能够保持住波兰独立，也没有能够重新争得波兰独立；在资产阶级看来，波兰独立在今天至少是一件无关痛痒的事情。然而这种独立却是实现欧洲各民族和谐的合作所必需的。这种独立只有年轻的波兰无产阶级才能争得，而且在波兰无产阶级手里会很好地保持住。因为欧洲所有其余各国工人都像波兰工人本身一样需要波兰的独立。费·恩格斯1892年2月10日于伦敦 1893年意大利文版序言致意大利读者《共产党宣言》的发表，可以说正好碰上1848年3月18日这个日子，碰上米兰和柏林发生革命，这是两个民族的武装起义，其中一个处于欧洲大陆中心，另一个处于地中海各国中心；这两个民族在此以前都由于分裂和内部纷争而被削弱并因而遭到外族的统治。意大利受奥皇支配，而德国则受到俄国沙皇那种虽然不那么直接、但是同样可以感觉得到的压迫。1848年3月18日的结果使意大利和德国免除了这种耻辱；如果说，这两个伟大民族在1848-1871年期间得到复兴并以这种或那种形式重新获得独立，那么，这是因为，正如马克思所说，那些镇压1848年革命的人违反自己的意志充当了这次革命的遗嘱执行人。这次革命到处都是由工人阶级干的；构筑街垒和流血牺牲的都是工人阶级。只有巴黎工人在推翻政府的同时也抱有推翻资产阶级统治的明确意图。但是，虽然他们已经认识到他们这个阶级和资产阶级之间存在着不可避免的对抗，然而无论法国经济的进展或法国工人群众的精神的发展，都还没有达到可能实现社会改造的程度。因此，革命的果实最终必然被资本家阶级拿去。在其他国家，在意大利、德国、奥地利，工人从一开始就只限于帮助资产阶级取得政权。但是在任何国家，资产阶级的统治离开民族独立都是不行的。因此，1848年革命必然给那些直到那时还没有统一和独立的民族——意大利、德国、匈牙利——带来统一和独立。现在轮到波兰了。由此可见，1848年革命虽然不是社会主义革命，但它毕竟为社会主义革命扫清了道路，为这个革命准备了基础。最近45年以来，资产阶级制度由于在各国引起了大工业的飞速发展，到处造成了人数众多的、紧密团结的、强大的无产阶级；这样它就产生了——正如《宣言》所说——它自身的掘墓人。不恢复每个民族的独立和统一，那就既不可能有无产阶级的国际联合，也不可能有各民族为达到共同目的而必须实行和睦的与自觉的合作。试想想看，在1848年以前的政治条件下，哪能有意大利工人、匈牙利工人、德意志工人、波兰工人、俄罗斯工人的共同国际行动！可见，1848年的战斗并不是白白进行的。从这次革命时期起直到今日的这45年，也不是白白过去的。这次革命时期的果实已开始成熟，而我的唯一愿望是这个意大利文译本的出版能成为良好的预兆，成为意大利无产阶级胜利的预兆，如同《宣言》原文的出版成了国际革命的预兆一样。《宣言》十分公正地评价了资本主义在先前所起过的革命作用。意大利曾经是第一个资本主义民族。封建的中世纪的终结和现代资本主义纪元的开端，是以一位大人物为标志的。这位人物就是意大利人但丁，他是中世纪的最后一位诗人，同时又是新时代的最初一位诗人。现在也如1300年那样，新的历史纪元正在到来。意大利是否会给我们一个新的但丁来宣告这个无产阶级新纪元的诞生呢？弗·恩格斯1893年2月1日于伦敦 共产党宣言一个幽灵，共产主义的幽灵，在欧洲游荡。为了对这个幽灵进行神圣的围剿，旧欧洲的一切势力，教皇和沙皇、梅特涅和基佐、法国的激进派和德国的警察，都联合起来了。有哪一个反对党不被它的当政的敌人骂为共产党呢？又有哪一个反对党不拿共产主义这个罪名去回敬更进步的反对党人和自己的反动敌人呢？从这一事实中可以得出两个结论：共产主义已经被欧洲的一切势力公认为一种势力；现在是共产党人向全世界公开说明自己的观点、自己的目的、自己的意图并且拿党自己的宣言来反驳关于共产主义幽灵的神话的时候了。为了这个目的，各国共产党人集会于伦敦，拟定了如下的宣言，用英文、法文、德文、意大利文、弗拉芒文和丹麦文公布于世。 一、资产者和无产者至今一切社会的历史都是阶级斗争的历史。自由民和奴隶、贵族和平民、领主和农奴、行会师傅和帮工，一句话，压迫者和被压迫者，始终处于相互对立的地位，进行不断的、有时隐蔽有时公开的斗争，而每一次斗争的结局都是整个社会受到革命改造或者斗争的各阶级同归于尽。在过去的各个历史时代，我们几乎到处都可以看到社会完全划分为各个不同的等级，看到社会地位分成多种多样的层次。在古罗马，有贵族、骑士、平民、奴隶，在中世纪，有封建主、臣仆、行会师傅、帮工、农奴，而且几乎在每一个阶级内部又有一些特殊的阶层。从封建社会的灭亡中产生出来的现代资产阶级社会并没有消灭阶级对立。它只是用新的阶级、新的压迫条件、新的斗争形式代替了旧的。但是，我们的时代，资产阶级时代，却有一个特点：它使阶级对立简单化了。整个社会日益分裂为两大敌对的阵营，分裂为两大相互直接对立的阶级：资产阶级和无产阶级。从中世纪的农奴中产生了初期城市的城关市民；从这个市民等级中发展出最初的资产阶级分子。美洲的发现、绕过非洲的航行，给新兴的资产阶级开辟了新天地。东印度和中国的市场、美洲的殖民化、对殖民地的贸易、交换手段和一般商品的增加，使商业、航海业和工业空前高涨，因而使正在崩溃的封建社会内部的革命因素迅速发展。以前那种封建的或行会的工业经营方式已经不能满足随着新市场的出现而增加的需求了。工场手工业代替了这种经营方式。行会师傅被工业的中间等级排挤掉了；各种行业组织之间的分工随着各个作坊内部的分工的出现而消失了。但是，市场总是在扩大，需求总是在增加。甚至工场手工业也不再能满足需要了。于是，蒸汽和机器引起了工业生产的革命。现代大工业代替了工场手工业；工业中的百万富翁，一支一支产业大军的首领，现代资产者，代替了工业的中间等级。大工业建立了由美洲的发现所准备好的世界市场。世界市场使商业、航海业和陆路交通得到了巨大的发展。这种发展又反过来促进了工业的扩展。同时，随着工业、商业、航海业和铁路的扩展，资产阶级也在同一程度上得到发展，增加自己的资本，把中世纪遗留下来的一切阶级排挤到后面去。由此可见，现代资产阶级本身是一个长期发展过程的产物，是生产方式和交换方式的一系列变革的产物。资产阶级的这种发展的每一个阶段，都伴随着相应的政治上的进展。它在封建主统治下是被压迫的等级，在公社里是武装的和自治的团体，在一些地方组成独立的城市共和国，在另一些地方组成君主国中的纳税的第三等级；后来，在工场手工业时期，它是等级君主国或专制君主国中同贵族抗衡的势力，而且是大君主国的主要基础；最后，从大工业和世界市场建立的时候起，它在现代的代议制国家里夺得了独占的政治统治。现代的国家政权不过是管理整个资产阶级的共同事务的委员会罢了。资产阶级在历史上曾经起过非常革命的作用。资产阶级在它已经取得了统治的地方把一切封建的、宗法的和田园般的关系都破坏了。它无情地斩断了把人们束缚于天然尊长的形形色色的封建羁绊，它使人和人之间除了赤裸裸的利害关系，除了冷酷无情的“现金交易”，就再也没有任何别的联系了。它把宗教虔诚、骑士热忱、小市民伤感这些情感的神圣发作，淹没在利己主义打算的冰水之中。它把人的尊严变成了交换价值，用一种没有良心的贸易自由代替了无数特许的和自力挣得的自由。总而言之，它用公开的、无耻的、直接的、露骨的剥削代替了由宗教幻想和政治幻想掩盖着的剥削。资产阶级抹去了一切向来受人尊崇和令人敬畏的职业的神圣光环。它把医生、律师、教士、诗人和学者变成了它出钱招雇的雇佣劳动者。资产阶级撕下了罩在家庭关系上的温情脉脉的面纱，把这种关系变成了纯粹的金钱关系。资产阶级揭示了，在中世纪深受反动派称许的那种人力的野蛮使用，是以极端怠惰作为相应补充的。它第一个证明了，人的活动能够取得什么样的成就。它创造了完全不同于埃及金字塔、罗马水道和哥特式教堂的奇迹；它完成了完全不同于民族大迁徙和十字军征讨的远征。资产阶级除非对生产工具，从而对生产关系，从而对全部社会关系不断地进行革命，否则就不能生存下去。反之，原封不动地保持旧的生产方式，却是过去的一切工业阶级生存的首要条件。生产的不断变革，一切社会状况不停的动荡，永远的不安定和变动，这就是资产阶级时代不同于过去一切时代的地方。一切固定的僵化的关系以及与之相适应的素被尊崇的观念和见解都被消除了，一切新形成的关系等不到固定下来就陈旧了。一切等级的和固定的东西都烟消云散了，一切神圣的东西都被亵渎了。人们终于不得不用冷静的眼光来看他们的生活地位、他们的相互关系。不断扩大产品销路的需要，驱使资产阶级奔走于全球各地。它必须到处落户，到处开发，到处建立联系。资产阶级，由于开拓了世界市场，使一切国家的生产和消费都成为世界性的了。使反动派大为惋惜的是，资产阶级挖掉了工业脚下的民族基础。古老的民族工业被消灭了，并且每天都还在被消灭。它们被新的工业排挤掉了，新的工业的建立已经成为一切文明民族的生命攸关的问题；这些工业所加工的，已经不是本地的原料，而是来自极其遥远的地区的原料；它们的产品不仅供本国消费，而且同时供世界各地消费。旧的、靠本国产品来满足的需要，被新的、要靠极其遥远的国家和地带的产品来满足的需要所代替了。过去那种地方的和民族的自给自足和闭关自守状态，被各民族的各方面的互相往来和各方面的互相依赖所代替了。物质的生产是如此，精神的生产也是如此。各民族的精神产品成了公共的财产。民族的片面性和局限性日益成为不可能，于是由许多种民族的和地方的文学形成了一种世界的文学。资产阶级，由于一切生产工具的迅速改进，由于交通的极其便利，把一切民族甚至最野蛮的民族都卷到文明中来了。它的商品的低廉价格，是它用来摧毁一切万里长城、征服野蛮人最顽强的仇外心理的重炮。它迫使一切民族——如果它们不想灭亡的话——采用资产阶级的生产方式；它迫使它们在自己那里推行所谓的文明，即变成资产者。一句话，它按照自己的面貌为自己创造出一个世界。资产阶级使农村屈服于城市的统治。它创立了巨大的城市，使城市人口比农村人口大大增加起来，因而使很大一部分居民脱离了农村生活的愚昧状态。正像它使农村从属于城市一样，它使未开化和半开化的国家从属于文明的国家，使农民的民族从属于资产阶级的民族，使东方从属于西方。资产阶级日甚一日地消灭生产资料、财产和人口的分散状态。它使人口密集起来，使生产资料集中起来，使财产聚集在少数人的手里。由此必然产生的结果就是政治的集中。各自独立的、几乎只有同盟关系的、各有不同利益、不同法律、不同政府、不同关税的各个地区，现在已经结合为一个拥有统一的政府、统一的法律、统一的民族阶级利益和统一的关税的统一的民族。资产阶级在它的不到一百年的阶级统治中所创造的生产力，比过去一切世代创造的全部生产力还要多，还要大。自然力的征服，机器的采用，化学在工业和农业中的应用，轮船的行驶，铁路的通行，电报的使用，整个整个大陆的开垦，河川的通航，仿佛用法术从地下呼唤出来的大量人口，——过去哪一个世纪料想到在社会劳动里蕴藏有这样的生产力呢？由此可见，资产阶级赖以形成的生产资料和交换手段，是在封建社会里造成的。在这些生产资料和交换手段发展的一定阶段上，封建社会的生产和交换在其中进行的关系，封建的农业和工场手工业组织，一句话，封建的所有制关系，就不再适应已经发展的生产力了。这种关系已经在阻碍生产而不是促进生产了。它变成了束缚生产的桎梏。它必须被炸毁，它已经被炸毁了。起而代之的是自由竞争以及与自由竞争相适应的社会制度和政治制度、资产阶级的经济统治和政治统治。现在，我们眼前又进行着类似的运动。资产阶级的生产关系和交换关系，资产阶级的所有制关系，这个曾经仿佛用法术创造了如此庞大的生产资料和交换手段的现代资产阶级社会，现在像一个魔法师一样不能再支配自己用法术呼唤出来的魔鬼了。几十年来的工业和商业的历史，只不过是现代生产力反抗现代生产关系、反抗作为资产阶级及其统治的存在条件的所有制关系的历史。只要指出在周期性的重复中越来越危及整个资产阶级社会生存的商业危机就够了。在商业危机期间，总是不仅有很大一部分制成的产品被毁灭掉，而且有很大一部分已经造成的生产力被毁灭掉。在危机期间，发生一种在过去一切时代看来都好像是荒唐现象的社会瘟疫，即生产过剩的瘟疫。社会突然发现自己回到了一时的野蛮状态；仿佛是一次饥荒、一场普遍的毁灭性战争，使社会失去了全部生活资料；仿佛是工业和商业全被毁灭了，——这是什么缘故呢？因为社会上文明过度，生活资料太多，工业和商业太发达。社会所拥有的生产力已经不能再促进资产阶级文明和资产阶级所有制关系的发展；相反，生产力已经强大到这种关系所不能适应的地步，它已经受到这种关系的阻碍；而它一着手克服这种障碍，就使整个资产阶级社会陷入混乱，就使资产阶级所有制的存在受到威胁。资产阶级的关系已经太狭窄了，再容纳不了它本身所造成的财富了。——资产阶级用什么办法来克服这种危机呢？一方面不得不消灭大量生产力，另一方面夺取新的市场，更加彻底地利用旧的市场。这究竟是怎样的一种办法呢？这不过是资产阶级准备更全面更猛烈的危机的办法，不过是使防止危机的手段越来越少的办法。资产阶级用来推翻封建制度的武器，现在却对准资产阶级自己了。但是，资产阶级不仅锻造了置自身于死地的武器；它还产生了将要运用这种武器的人——现代的工人，即无产者。随着资产阶级即资本的发展，无产阶级即现代工人阶级也在同一程度上得到发展；现代的工人只有当他们找到工作的时候才能生存，而且只有当他们的劳动增殖资本的时候才能找到工作。这些不得不把自己零星出卖的工人，像其他任何货物一样，也是一种商品，所以他们同样地受到竞争的一切变化、市场的一切波动的影响。由于推广机器和分工，无产者的劳动已经失去了任何独立的性质，因而对工人也失去了任何吸引力。工人变成了机器的单纯的附属品，要求他做的只是极其简单、极其单调和极容易学会的操作。因此，花在工人身上的费用，几乎只限于维持工人生活和延续工人后代所必需的生活资料。但是，商品的价格，从而劳动的价格，是同它的生产费用相等的。因此，劳动越使人感到厌恶，工资也就越少。不仅如此，机器越推广，分工越细致，劳动量出就越增加，这或者是由于工作时间的延长，或者是由于在一定时间内所要求的劳动的增加，机器运转的加速，等等。现代工业已经把家长式的师傅的小作坊变成了工业资本家的大工厂。挤在工厂里的工人群众就像士兵一样被组织起来。他们是产业军的普通士兵，受着各级军士和军官的层层监视。他们不仅仅是资产阶级的、资产阶级国家的奴隶，他们每日每时都受机器、受监工、首先是受各个经营工厂的资产者本人的奴役。这种专制制度越是公开地把营利宣布为自己的最终目的，它就越是可鄙、可恨和可恶。手的操作所要求的技巧和气力越少，换句话说，现代工业越发达，男工也就越受到女工和童工的排挤。对工人阶级来说，性别和年龄的差别再没有什么社会意义了。他们都只是劳动工具，不过因为年龄和性别的不同而需要不同的费用罢了。当厂主对工人的剥削告一段落，工人领到了用现钱支付的工资的时候，马上就有资产阶级中的另一部分人——房东、小店主、当铺老板等等向他们扑来。以前的中间等级的下层，即小工业家、小商人和小食利者，手工业者和农民——所有这些阶级都降落到无产阶级的队伍里来了，有的是因为他们的小资本不足以经营大工业，经不起较大的资本家的竞争；有的是因为他们的手艺已经被新的生产方法弄得不值钱了。无产阶级就是这样从居民的所有阶级中得到补充的。无产阶级经历了各个不同的发展阶段。它反对资产阶级的斗争是和它的存在同时开始的。最初是单个的工人，然后是某一工厂的工人，然后是某一地方的某一劳动部门的工人，同直接剥削他们的单个资产者作斗争。他们不仅仅攻击资产阶级的生产关系，而且攻击生产工具本身；他们毁坏那些来竞争的外国商品，捣毁机器，烧毁工厂，力图恢复已经失去的中世纪工人的地位。在这个阶段上，工人是分散在全国各地并为竞争所分裂的群众。工人的大规模集结，还不是他们自己联合的结果，而是资产阶级联合的结果，当时资产阶级为了达到自己的政治目的必须而且暂时还能够把整个无产阶级发动起来。因此，在这个阶段上，无产者不是同自己的敌人作斗争，而是同自己的敌人的敌人作斗争，即同专制君主制的残余、地主、非工业资产者和小资产者作斗争。因此，整个历史运动都集中在资产阶级手里；在这种条件下取得的每一个胜利都是资产阶级的胜利。但是，随着工业的发展，无产阶级不仅人数增加了，而且它结合成更大的集体，它的力量日益增长，它越来越感觉到自己的力量。机器使劳动的差别越来越小，使工资几乎到处都降到同样低的水平，因而无产阶级内部的利益、生活状况也越来越趋于一致。资产者彼此间日益加剧的竞争以及由此引起的商业危机，使工人的工资越来越不稳定；机器的日益迅速的和继续不断的改良，使工人的整个生活地位越来越没有保障；单个工人和单个资产者之间的冲突越来越具有两个阶级的冲突的性质。工人开始成立反对资产者的同盟；他们联合起来保卫自己的工资。他们甚至建立了经常性的团体，以便为可能发生的反抗准备食品。有些地方，斗争爆发为起义。工人有时也得到胜利，但这种胜利只是暂时的。他们斗争的真正成果并不是直接取得的成功，而是工人的越来越扩大的联合。这种联合由于大工业所造成的日益发达的交通工具而得到发展，这种交通工具把各地的工人彼此联系起来。只要有了这种联系，就能把许多性质相同的地方性的斗争汇合成全国性的斗争，汇合成阶级斗争。而一切阶级斗争都是政治斗争。中世纪的市民靠乡间小道需要几百年才能达到的联合，现代的无产者利用铁路只要几年就可以达到了。无产者组织成为阶级，从而组织成为政党这件事，不断地由于工人的自相竞争而受到破坏。但是，这种组织总是重新产生，并且一次比一次更强大，更坚固，更有力。它利用资产阶级内部的分裂，迫使他们用法律形式承认工人的个别利益。英国的十小时工作日法案就是一个例子。旧社会内部的所有冲突在许多方面都促进了无产阶级的发展。资产阶级处于不断的斗争中：最初反对贵族；后来反对同工业进步有利害冲突的那部分资产阶级；经常反对一切外国的资产阶级。在这一切斗争中，资产阶级都不得不向无产阶级呼吁，要求无产阶级援助，这样就把无产阶级卷进了政治运动。于是，资产阶级自己就把自己的教育因素即反对自身的武器给予了无产阶级。其次，我们已经看到，工业的进步把统治阶级的整批成员抛到无产阶级队伍里去，或者至少也使他们的生活条件受到威胁。他们也给无产阶级带来了大量的教育因素。最后，在阶级斗争接近决战的时期，统治阶级内部的、整个旧社会内部的瓦解过程，就达到非常强烈、非常尖锐的程度，甚至使得统治阶级中的一小部分人脱离统治阶级而归附于革命的阶级，即掌握着未来的阶级。所以，正像过去贵族中有一部分人转到资产阶级方面一样，现在资产阶级中也有一部分人，特别是已经提高到从理论上认识整个历史运动这一水平的一部分资产阶级思想家，转到无产阶级方面来了。在当前同资产阶级对立的一切阶级中，只有无产阶级是真正革命的阶级。其余的阶级都随着大工业的发展而日趋没落和灭亡，无产阶级却是大工业本身的产物。中间等级，即小工业家、小商人、手工业者、农民，他们同资产阶级作斗争，都是为了维护他们这种中间等级的生存，以免于灭亡。所以，他们不是革命的，而是保守的。不仅如此，他们甚至是反动的，因为他们力图使历史的车轮倒转。如果说他们是革命的，那是鉴于他们行将转入无产阶级的队伍，这样，他们就不是维护他们目前的利益，而是维护他们将来的利益，他们就离开自己原来的立场，而站到无产阶级的立场上来。流氓无产阶级是旧社会最下层中消极的腐化的部分，他们在一些地方也被无产阶级革命卷到运动里来，但是，由于他们的整个生活状况，他们更甘心于被人收买，去干反动的勾当。在无产阶级的生活条件中，旧社会的生活条件已经被消灭了。无产者是没有财产的；他们和妻子儿女的关系同资产阶级的家庭关系再没有任何共同之处了；现代的工业劳动，现代的资本压迫，无论在英国或法国，无论在美国或德国，都有是一样的，都使无产者失去了任何民族性。法律、道德、宗教在他们看来全都是资产阶级偏见，隐藏在这些偏见后面的全都是资产阶级利益。过去一切阶级在争得统治之后，总是使整个社会服从于它们发财致富的条件，企图以此来巩固它们已获得的生活地位。无产者只有废除自己的现存的占有方式，从而废除全部现存的占有方式，才能取得社会生产力。无产者没有什么自己的东西必须加以保护，他们必须摧毁至今保护和保障私有财产的一切。过去的一切运动都是少数人的或者为少数人谋利益的运动。无产阶级的运动是绝大多数人的、为绝大多数人谋利益的独立的运动。无产阶级，现今社会的最下层，如果不炸毁构成官方社会的整个上层，就不能抬起头来，挺起胸来。如果不就内容而就形式来说，无产阶级反对资产阶级的斗争首先是一国范围内的斗争。每一个国家的无产阶级当然首先应该打倒本国的资产阶级。在叙述无产阶级发展的最一般的阶段的时候，我们循序探讨了现存社会内部或多或少隐蔽着的国内战争，直到这个战争爆发为公开的革命，无产阶级用暴力推翻资产阶级而建立自己的统治。我们已经看到，至今的一切社会都是建立在压迫阶级和被压迫阶级的对立之上的。但是，为了有可能压迫一个阶级，就必须保证这个阶级至少有能够勉强维持它的奴隶般的生存的条件。农奴曾经在农奴制度下挣扎到公社成员的地位，小资产者曾经在封建专制制度的束缚下挣扎到资产者的地位。现代的工人却相反，他们并不是随着工业的进步而上升，而是越来越降到本阶级的生存条件以下。工人变成赤贫者，贫困比人口和财富增长得还要快。由此可以明显地看出，资产阶级再不能做社会的统治阶级了，再不能把自己阶级的生存条件当作支配一切的规律强加于社会了。资产阶级不能统治下去了，因为它甚至不能保证自己的奴隶维持奴隶的生活，因为它不得不让自己的奴隶落到不能养活它反而要它来养活的地步。社会再不能在它统治下生存下去了，就是说，它的生存不再同社会相容了。资产阶级生存和统治的根本条件，是财富在私人手里的积累，是资本的形成和增殖；资本的条件是雇佣劳动。雇佣劳动完全是建立在工人的自相竞争之上的。资产阶级无意中造成而又无力抵抗的工业进步，使工人通过结社而达到的革命联合代替了他们由于竞争而造成的分散状态。于是，随着大工业的发展，资产阶级赖以生产和占有产品的基础本身也就从它的脚下被挖掉了。它首先生产的是它自身的掘墓人。资产阶级的灭亡和无产阶级的胜利是同样不可避免的。 二、无产者和共产党人共产党人同全体无产者的关系是怎样的呢？共产党人不是同其他工人政党相对立的特殊政党。他们没有任何同整个无产阶级的利益不同的利益。他们不提出任何特殊的原则，用以塑造无产阶级的运动。共产党人同其他无产阶级政党不同的地方只是：一方面，在无产者不同的民族的斗争中，共产党人强调和坚持整个无产阶级共同的不分民族的利益；另一方面，在无产阶级和资产阶级的斗争所经历的各个发展阶段上，共产党人始终代表整个运动的利益。因此，在实践方面，共产党人是各国工人政党中最坚决的、始终起推动作用的部分；在理论方面，他们胜过其余无产阶级群众的地方在于他们了解无产阶级运动的条件、进程和一般结果。共产党人的最近目的是和其他一切无产阶级政党的最近目的一样的：使无产阶级形成为阶级，推翻资产阶级的统治，由无产阶级夺取政权。共产党人的理论原理，决不是以这个或那个世界改革家所发明或发现的思想、原则为根据的。这些原理不过是现存的阶级斗争、我们眼前的历史运动的真实关系的一般表述。废除先前存在的所有制关系，并不是共产主义所独具的特征。一切所有制关系都经历了经常的历史更替、经常的历史变更。例如，法国革命废除了封建的所有制，代之以资产阶级的所有制。共产主义的特征并不是要废除一般的所有制，而是要废除资产阶级的所有制。但是，现代的资产阶级私有制是建立在阶级对立上面、建立在一些人对另一些人的剥削上面的产品生产和占有的最后而又完备的表现。从这个意义上说，共产党人可以把自己的理论概括为一句话：消灭私有制。有人责备我们共产党人，说我们消灭个人挣得的、自己劳动得来的财产，要消灭构成个人的一切自由、活动和独立的基础的财产。好一个劳动得来的、自己挣得的、自己赚来的财产！你们说的是资产阶级财产出现以前的那种小资产阶级、小农的财产吗？那种财产用不着我们去消灭，工业的发展已经把它消灭了，而且每天都在消灭它。或者，你们说的是现代的资产阶级的私有财产吧？但是，难道雇佣劳动，无产者的劳动，会给无产者创造出财产来吗？没有的事。这种劳动所创造的资本，即剥削雇佣劳动的财产，只有在不断产生出新的雇佣劳动来重新加以剥削的条件下才能增殖的财产。现今的这种财产是在资本和雇佣劳动的对立中运动的。让我们来看看这种对立的两个方面吧。做一个资本家，这就是说，他在生产中不仅占有一种纯粹个人的地位，而且占有一种社会地位。资本是集体的产物，它只有通过社会许多成员的共同活动，而且归根到底只有通过社会全体成员的共同活动，才能运动起来。因此，资本不是一种个人力量，而是一种社会力量。因此，把资本变为公共的、属于社会全体成员的财产，这并不是把个人财产变为社会财产。这里所改变的只是财产的社会性质。它将失掉它的阶级性质。现在，我们来看看雇佣劳动。雇佣劳动的平均价格是最低限度的工资，即工人为维持其工人的生活所必需的生活资料的数额。因此，雇佣工人靠自己的劳动所占有的东西，只够勉强维持他的生命的再生产。我们决不打算消灭这种供直接生命再生产用的劳动产品的个人占有，这种占有并不会留下任何剩余的东西使人们有可能支配别人的劳动。我们要消灭的只是这种占有的可怜的性质，在这种占有下，工人仅仅为增殖资本而活着，只有在统治阶级的利益需要他活着的时候才能活着。在资产阶级社会里，活的劳动只是增殖已经积累起来的劳动的一种手段。在共产主义社会里，已经积累起来的劳动只是扩大、丰富和提高工人的生活的一种手段。因此，在资产阶级社会里是过去支配现在，在共产主义社会里是现在支配过去。在资产阶级社会里，资本具有独立性和个性，而活动着的个人却没有独立性和个性。而资产阶级却把消灭这种关系说成是消灭个性和自由！说对了。的确，正是要消灭资产者的个性、独立性和自由。在现今的资产阶级生产关系的范围内，所谓自由就是自由贸易，自由买卖。但是，买卖一消失，自由买卖也就会消失。关于自由买卖的言论，也像我们的资产阶级的其他一切关于自由的大话一样，仅仅对于不自由的买卖来说，对于中世纪被奴役的市民来说，才是有意义的，而对于共产主义要消灭买卖、消灭资产阶级生产关系和资产阶级本身这一点来说，却是毫无意义的。我们要消灭私有制，你们就惊慌起来。但是，在你们的现存社会里，私有财产对十分之九的成员来说已经被消灭了；这种私有制之所以存在，正是因为私有财产对十分之九的成员来说已经不存在。可见，你们责备我们，是说我们要消灭那种以社会上的绝大多数人没有财产为必要条件的所有制。总而言之，你们责备我们，是说我们要消灭你们的那种所有制。的确，我们是要这样做的。从劳动不再能变为资本、货币、地租，一句话，不再能变为可以垄断的社会力量的时候起，就是说，从个人财产不再能变为资产阶级财产的时候起，你们说，个性被消灭了。由此可见，你们是承认，你们所理解的个性，不外是资产者、资产阶级私有者。这样的个性确实应当被消灭。共产主义并不剥夺任何人占有社会产品的权力，它只剥夺利用这种占有去奴役他人劳动的权力。有人反驳说，私有制一消灭，一切活动就会停止，懒惰之风就会兴起。这样说来，资产阶级社会早就应该因懒惰而灭亡了，因为在这个社会里劳者不获，获者不劳。所有这些顾虑，都可以归结为这样一个同义反复：一旦没有资本，也就不再有雇佣劳动了。所有这些对共产主义的物质产品的占有方式和生产方式的责备，也被扩及到精神产品的占有和生产方面。正如阶级的所有制的终止在资产者看来是生产本身的终止一样，阶级的教育的终止在他们看来就等于一切教育的终止。资产者唯恐失去的那种教育，绝大多数人来说是把人训练成机器。但是，你们既然用你们资产阶级关于自由、教育、法等等的观念来衡量废除资产阶级所有制的主张，那就请你们不要同我们争论了。你们的观念本身是资产阶级的生产关系和所有制关系的产物，正像你们的法不过是被奉为法律的你们这个阶级的意志一样，而这种意志的内容是由你们这个阶级的物质生活条件决定的。你们的利己观念使你们把自己的生产关系和所有制关系从历史的、在生产过程中是暂时的关系变成永恒的自然规律和理性规律，这种利己观念是你们和一切灭亡了的统治阶级所共有的。谈到古代所有制的时候你们所能理解的，谈到封建所有制的时候你们所能理解的，一谈到资产阶级所有制你们就再也不能理解了。消灭家庭！连极端的激进派也对共产党人的这种可耻的意图表示愤慨。现代的、资产阶级的家庭是建立在什么基础上的呢？是建立在资本上面，建立在私人发财上面的。这种家庭只是在资产阶级那里才以充分发展的形式存在着，而无产者的被迫独居和公开的卖淫则是它的补充。资产者的家庭自然会随着它的这种补充的消失而消失，两者都要随着资本的消失而消失。你们是责备我们要消灭父母对子女的剥削吗？我们承认这种罪状。但是，你们说，我们用社会教育代替家庭教育，就是要消灭人们最亲密的关系。而你们的教育不也是由社会决定的吗？不也是由你们进行教育时所处的那种社会关系决定的吗？不也是由社会通过学校等等进行的直接的或间接的干涉决定的吗？共产党人并没有发明社会对教育的作用；他们仅仅是要改变这种作用的性质，要使教育摆脱统治阶级的影响。无产者的一切家庭联系越是由于大工业的发展而被破坏，他们的子女越是由于这种发展而被变成单纯的商品和劳动工具，资产阶级关于家庭和教育、关于父母和子女的亲密关系的空话就越是令人作呕。但是，你们共产党人是要实行公妻制的啊，——整个资产阶级异口同声地向我们这样叫喊。资产者是把自己的妻子看作单纯的生产工具的。他们听说生产工具将要公共使用，自然就不能不想到妇女也会遭到同样的命运。他们想也没有想到，问题正在于使妇女不再处于单纯生产工具的地位。其实，我们的资产者装得道貌岸然，对所谓的共产党人的正式公妻制表示惊讶，那是再可笑不过了。公妻制无需共产党人来实行，它差不多是一向就有的。我们的资产者不以他们的无产者的妻子和女儿受他们支配为满足，正式的卖淫更不必说了，他们还以互相诱奸妻子为最大的享乐。资产阶级的婚姻实际上是公妻制。人们至多只能责备共产党人，说他们想用正式的、公开的公妻制来代替伪善地掩蔽着的公妻制。其实，不言而喻，随着现在的生产关系的消灭，从这种关系中产生的公妻制，即正式的和非正式的卖淫，也就消失了。有人还责备共产党人，说他们要取消祖国，取消民族。工人没有祖国。决不能剥夺他们所没有的东西。因为无产阶级首先必须取得政治统治，上升为民族的阶级，把自身组织成为民族，所以它本身还是民族的，虽然完全不是资产阶级所理解的那种意思。随着资产阶级的发展，随着贸易自由的实现和世界市场的建立，随着工业生产以及与之相适应的生活条件的趋于一致，各国人民之间的民族分隔和对立日益消失。无产阶级的统治将使它们更快地消失。联合的行动，至少是各文明国家的联合的行动，是无产阶级获得解放的首要条件之一。人对人的剥削一消灭，民族对民族的剥削就会随之消灭。民族内部的阶级对立一消失，民族之间的敌对关系就会随之消失。从宗教的、哲学的和一切意识形态的观点对共产主义提出的种种责难，都不值得详细讨论了。人们的观念、观点和概念，一句话，人们的意识，随着人们的生活条件、人们的社会关系、人们的社会存在的改变而改变，这难道需要经过深思才能了解吗？思想的历史除了证明精神生产随着物质生产的改造而改造，还证明了什么呢？任何一个时代的统治思想始终都不过是统治阶级的思想。当人们谈到使整个社会革命化的思想时，他们只是表明了一个事实：在旧社会内部已经形成了新社会的因素，旧思想的瓦解是同旧生活条件的瓦解步调一致的。当古代世界走向灭亡的时候，古代的各种宗教就被基督教战胜了。当基督教思想在18世纪被启蒙思想击败的时候，封建社会正在同当时革命的资产阶级进行殊死的斗争。信仰自由和宗教自由的思想，不过表明竞争在信仰领域里占统治地位罢了。“但是”，有人会说，“宗教的、道德的、哲学的、政治的、法的观念等等在历史发展的进程中固然是不断改变的，而宗教、道德、哲学、政治和法在这种变化中却始终保存着。此外，还存在着一切社会状态所共有的永恒真理，如自由、正义等等。但是共产主义要废除永恒真理，它要废除宗教、道德，而不是加以革新，所以共产主义是同至今的全部历史发展相矛盾的。”这种责难归结为什么呢？至今的一切社会的历史都是在阶级对立中运动的，而这种对立在不同的时代具有不同的形式。但是，不管阶级对立具有什么样的形式，社会上一部分人对另一部分人的剥削却是过去各个世纪所共有的事实。因此，毫不奇怪，各个世纪的社会意识，尽管形形色色、千差万别，总是在某些共同的形式中运动的，这些形式，这些意识形式，只有当阶级对立完全消失的时候才会完全消失。共产主义革命就是同传统的所有制关系实行最彻底的决裂；毫不奇怪，它在自己的发展进程中要同传统的观念实行最彻底的决裂。不过，我们还是把资产阶级对共产主义的种种责难撇开吧。前面我们已经看到，工人革命的第一步就是使无产阶级上升为统治阶级，争得民主。无产阶级将利用自己的政治统治，一步一步地夺取资产阶级的全部资本，把一切生产工具集中在国家即组织成为统治阶级的无产阶级手里，并且尽可能快地增加生产力的总量。要做到这一点，当然首先必须对所有权和资产阶级生产关系实行强制性的干涉，也就是采取这样一些措施，这些措施在经济上似乎是不够充分的和没有力量的，但是在运动进程中它们会越出本身，而且作为变革全部生产方式的手段是必不可少的。这些措施在不同的国家里当然会是不同的。但是，最先进的国家几乎都可以采取下面的措施：1、剥夺地产，把地租用于国家支出。2、征收高额累进税。3、废除继承权。4、没收一切流亡分子和叛乱分子的财产。5、通过拥有国家资本和独享垄断权的国家银行，把信贷集中在国家手里。6、把全部运输业集中在国家的手里。7、按照总的计划增加国家工厂和生产工具，开垦荒地和改良土壤。8、实行普遍劳动义务制，成立产业军，特别是在农业方面。9、把农业和工业结合起来，促使城乡对立逐步消灭。10、对所有儿童实行公共的和免费的教育。取消现在这种形式的儿童的工厂劳动。把教育同物质生产结合起来，等等。当阶级差别在发展进程中已经消失而全部生产集中在联合起来的个人的手里的时候，公共权力就失去政治性质。原来意义上的政治权力，是一个阶级用以压迫另一个阶级的有组织的暴力。如果说无产阶级在反对资产阶级的斗争中一定要联合为阶级，如果说它通过革命使自己成为统治阶级，并以统治阶级的资格用暴力消灭旧的生产关系，那么它在消灭这种生产关系的同时，也就消灭了阶级对立的存在条件，消灭阶级本身的存在条件，从而消灭了它自己这个阶级的统治。代替那存在着阶级和阶级对立的资产阶级旧社会的，将是这样一个联合体，在那里，每个人的自由发展是一切人的自由发展的条件。 三、社会主义的和共产主义的文献1．反动的社会主义（甲）封建的社会主义法国和英国的贵族，按照他们的历史地位所负的使命，就是写一些抨击现代资产阶级社会的作品。在法国的1830年七月革命和英国的改革运动中，他们再一次被可恨的暴发户打败了。从此就再谈不上严重的政治斗争了。他们还能进行的只是文字斗争。但是，即使在文字方面也不可能重弹复辟时期的老调了。为了激起同情，贵族们不得不装模作样，似乎他们已经不关心自身的利益，只是为了被剥削的工人阶级的利益才去写对资产阶级的控诉书。他们用来泄愤的手段是：唱唱诅咒他们的新统治者的歌，并向他叽叽咕咕地说一些或多或少凶险的预言。这样就产生了封建的社会主义，半是挽歌，半是谤文，半是过去的回音，半是未来的恫吓；它有时也能用辛辣、俏皮而尖刻的评论剌中资产阶级的心，但是它由于完全不能理解现代历史的进程而总是令人感到可笑。为了拉拢人民，贵族们把无产阶级的乞食袋当作旗帜来挥舞。但是，每当人民跟着他们走的时候，都发现他们的臀部带有旧的封建纹章，于是就哈哈大笑，一哄而散。一部分法国正统派和“青年英国”，都演过这出戏。封建主说，他们的剥削方式和资产阶级的剥削不同，那他们只是忘记了，他们是在完全不同的、目前已经过时的情况和条件下进行剥削的。他们说，在他们的统治下并没有出现过现代的无产阶级，那他们只是忘记了，现代的资产阶级正是他们的社会制度的必然产物。不过，他们毫不掩饰自己的批评的反动性质，他们控告资产阶级的主要罪状正是在于：在资产阶级的统治下有一个将把整个旧社会制度炸毁的阶级发展起来。他们责备资产阶级，与其说是因为它产生了无产阶级，不如说是因为它产生了革命的无产阶级。因此，在政治实践中，他们参与对工人阶级采取的一切暴力措施，在日常生活中，他们违背自己的那一套冠冕堂皇的言词，屈尊拾取金苹果，不顾信义、仁爱和名誉去做羊毛、甜菜和烧洒的买卖。正如僧侣总是同封建主携手同行一样，僧侣的社会主义也总是同封建的社会主义携手同行的。要给基督教禁欲主义涂上一层社会主义的色彩，是再容易不过了。基督教不是也激烈反对私有财产，反对婚姻，反对国家吗？它不是提倡用行善和求乞、独身和禁欲、修道和礼拜来代替这一切吗？基督教的社会主义，只不过是僧侣用来使贵族的怨愤神圣的圣水罢了。（乙）小资产阶级的社会主义封建贵族并不是被资产阶级所推翻的、其生活条件在现代资产阶级社会里日益恶化和消失的唯一阶级。中世纪的城关市民和小农等级是现代资产阶级的前身。在工商业不很发达的国家里，这个阶级还在新兴的资产阶级身旁勉强生存着。在现代文明已经发展的国家里，形成了一个新的小资产阶级，它摇摆于无产阶级和资产阶级之间，并且作为资产阶级社会的补充部分不断地重新组成。但是，这一阶级的成员经常被竞争抛到无产阶级队伍里去，而且，随着大工业的发展，他们甚至觉察到，他们很快就会完全失去他们作为现代社会中一个独立部分的地位，在商业、工业和农业中很快就会被监工和雇员所代替。在农民阶级远远超过人口半数的国家，例如在法国，那些站在无产阶级方面反对资产阶级的著作家，自然是用小资产阶级和小农的尺度去批判资产阶级制度的，是从小资产阶级的立场出发替工人说话的。这样就形成了小资产阶级的社会主义。西斯蒙第不仅对法国而且对英国来说都是这类著作家的首领。这种社会主义非常透彻地分析了现代生产关系中的矛盾。它揭穿了经济学家的虚伪的粉饰。它确凿地证明了机器和分工的破坏作用、资本和地产的积聚、生产过剩、危机、小资产者和小农的必然没落、无产阶级的贫困、生产的无政府状态、财富分配的极不平均、各民族之间的毁灭性的工业战争，以及旧风尚、旧家庭关系和旧民族性的解体。但是，这种社会主义按其实际内容来说，或者是企图恢复旧的生产资料和交换手段，从而恢复旧的所有制关系和旧的社会，或者是企图重新把现代的生产资料和交换手段硬塞到已被它们突破而且必然被突破的旧的所有制关系的框子里去。它在这两种场合都是反动的，同时又是空想的。工业中的行会制度，农业中的宗法经济，——这就是它的结论。这一思潮在它以后的发展中变成了一种怯懦的悲叹。（丙）德国的或“真正的”社会主义法国的社会主义和共产主义的文献是在居于统治地位的资产阶级的压迫下产生的，并且是同这种统治作斗争的文字表现，这种文献被搬到德国的时候，那里的资产阶级才刚刚开始进行反对封建专制制度的斗争。德国的哲学家、半哲学家和美文学家，贪婪地抓住了这种文献，不过他们忘记了：在这种著作从法国搬到德国的时候，法国的生活条件却没有同时搬过去。在德国的条件下，法国的文献完全失去了直接实践的意义，而只具有纯粹文献的形式。它必然表现为关于真正的社会、关于实现人的本质的无谓思辨。这样，第一次法国革命的要求，在18世纪的德国哲学家看来，不过是一般“实践理性”的要求，而革命的法国资产阶级的意志的表现，在他们心目中就是纯粹的意志、本来的意志、真正人的意志的规律。德国著作家的唯一工作，就是把新的法国的思想同他们的旧的哲学信仰调和起来，或者毋宁说，就是从他们的哲学观点出发去掌握法国的思想。这种掌握，就像掌握外国语一样，是通过翻译的。大家知道，僧侣们曾经在古代异教经典的手抄本上面写上荒诞的天主教圣徒传。德国著作家对世俗的法国文献采取相反的作法。他们在法国的原著下面写上自己的哲学胡说。例如，他们在法国人对货币关系的批判下面写上“人的本质的外化”，在法国人对资产阶级国家的批判下面写上所谓“抽象普遍物的统治的扬弃”，等等。这种在法国人的论述下面塞进自己哲学词句的做法，他们称之为“行动的哲学”、”真正的社会主义”、“德国的社会主义科学”、“社会主义的哲学论证”，等等。法国的社会主义和共产主义的文献就这样被完全阉割了。既然这种文献在德国人手里已不再表现一个阶级反对另一个阶级的斗争，于是德国人就认为：他们克服了“法国人的片面性”，他们不代表真实的要求，而代表真理的要求，不代表无产者的利益，而代表人的本质的利益，即一般人的利益，这种人不属于任何阶级，根本不存在于现实界，而只存在于云雾弥漫的哲学幻想的太空。这种曾经郑重其事地看待自己那一套拙劣的小学生作业并且大言不惭地加以吹嘘的德国社会主义，现在渐渐失去了它的自炫博学的天真。德国的特别是普鲁士的资产阶级反对封建主和专制王朝的斗争，一句话，自由主义运动，越来越严重了。于是，“真正的”社会主义就得到了一个好机会，把社会主义的要求同政治运动对立起来，用诅咒异端邪说的传统办法诅咒自由主义，诅咒代议制国家，诅咒资产阶级的竞争、资产阶级的新闻出版自由、资产阶级的法、资产阶级的自由和平等，并且向人民群众大肆宣扬，说什么在这个资产阶级运动中，人民群众非但一无所得，反而会失去一切。德国的社会主义恰好忘记了，法国的批判（德国的社会主义是这种批判的可怜的回声）是以现代的资产阶级社会以及相应的物质生活条件和相当的政治制度为前提的，而这一切前提当时在德国正是尚待争取的。这种社会主义成了德意志各邦专制政府及其随从——僧侣、教员、容克和官僚求之不得的、吓唬来势汹汹的资产阶级的稻草人。这种社会主义是这些政府用来镇压德国工人起义的毒辣的皮鞭和枪弹的甜蜜的补充。既然“真正的”社会主义就这样成了这些政府对付德国资产阶级的武器，那么它也就直接代表了一种反动的利益，即德国小市民的利益。在德国，16世纪遗留下来的、从那时起经常以不同形式重新出现的小资产阶级，是现存制度的真实的社会基础。保存这个小资产阶级，就是保存德国的现存制度。这个阶级胆战心惊地从资产阶级的工业统治和政治统治那里等候着无可幸免的灭亡，这一方面是由于资本的积聚，另一方面是由于革命无产阶级的兴起。在它看来，“真正的”社会主义能起一箭双雕的作用。“真正的”社会主义像瘟疫一样流行起来了。德国的社会主义者给自己的那几条干瘪的“永恒真理”披上一件用思辨的蛛丝织成的、绣满华丽辞藻的花朵和浸透甜情蜜意的甘露的外衣，这件光彩夺目的外衣只是使他们的货物在这些顾客中间增加销路罢了。同时，德国的社会主义也越来越认识到自己的使命就是充当这种小市民的夸夸其谈的代言人。它宣布德意志民族是模范的民族，德国小市民是模范的人。它给这些小市民的每一种丑行都加上奥秘的、高尚的、社会主义的意义，使之变成完全相反的东西。它发展到最后，就直接反对共产主义的“野蛮破坏的”倾向，并且宣布自己是不偏不倚地超乎任何阶级斗争之上的。现今在德国流行的一切所谓社会主义和共产主义的著作，除了极少数的例外，都属于这一类卑鄙龌龊的、令人委靡的文献。 2．保守的或资产阶级的社会主义资产阶级中的一部分人想要消除社会的弊病，以便保障资产阶级社会的生存。这一部分人包括：经济学家、博爱主义者、人道主义者、劳动阶级状况改善派、慈善事业组织者、动物保护协会会员、戒酒协会发起人以及形形色色的小改良家。这种资产阶级的社会主义甚至被制成一些完整的体系。我们可以举蒲鲁东的《贫困的哲学》作为例子。社会主义的资产者愿意要现代社会的生存条件，但是不要由这些条件必然产生的斗争和危险。他们愿意要现存的社会，但是不要那些使这个社会革命化和瓦解的因素。他们愿意要资产阶级，但是不要无产阶级。在资产阶级看来，它所统治的世界自然是最美好的世界。资产阶级的社会主义把这种安慰人心的观念制成半套或整套的体系。它要求无产阶级实现它的体系，走进新的耶路撒冷，其实它不过是要求无产阶级停留在现今的社会里，但是要抛弃他们关于这个社会的可恶的观念。这种社会主义的另一种不够系统、但是比较实际的形式，力图使工人阶级厌弃一切革命运动，硬说能给工人阶级带来好处的并不是这样或那样的政治改革，而仅仅是物质生活条件即经济关系的改变。但是，这种社会主义所理解的物质生活条件的改变，绝对不是只有通过革命的途径才能实现的资产阶级生产关系的废除，而是一些在这种生产关系的基础上实行的行政上的改良，因而丝毫不会改变资本和雇佣劳动的关系，至多只能减少资产阶级的统治费用和简化它的财政管理。资产阶级的社会主义只有在它变成纯粹的演说辞令的时候，才获得自己的适当的表现。自由贸易！为了工人阶级的利益；保护关税！为了工人阶级的利益；单身牢房！为了工人阶级的利益。——这才是资产阶级的社会主义唯一认真说出的最后的话。资产阶级的社会主义就是这样一个论断：资产者之为资产者，是为了工人阶级的利益。 3．批判的空想的社会主义和共产主义在这里，我们不谈在现代一切大革命中表达过无产阶级要求的文献（巴贝夫等人的著作）。无产阶级在普遍激动的时代、在推翻封建社会的时期直接实现自己阶级利益的最初尝试，都不可避免地遭到了失败，这是由于当时无产阶级本身还不够发展，由于无产阶级解放的物质条件还没具备，这些条件只是资产阶级时代的产物。随着这些早期的无产阶级运动而出现的革命文献，就其内容来说必然是反动的。这种文献倡导普遍的禁欲主义和粗陋的平均主义。本来意义的社会主义和共产主义的体系，圣西门、傅立叶、欧文等人的体系，是在无产阶级和资产阶级之间的斗争还不发展的最初时期出现的。关于这个时期，我们在前面已经叙述过了（见《资产阶级和无产阶级》）。诚然，这些体系的发明家看到了阶级的对立，以及占统治地位的社会本身中的瓦解因素的作用。但是，他们看不到无产阶级方面的任何历史主动性，看不到它所特有的任何政治运动。由于阶级对立的发展是同工业的发展步调一致的，所以这些发明家也不可能看到无产阶级解放的物质条件，于是他们就去探求某种社会科学、社会规律，以便创造这些条件。社会的活动要由他们个人的发明活动来代替，解放的历史条件要由幻想的条件来代替，无产阶级的逐步组织成为阶级要由一种特意设计出来的社会组织来代替。在他们看来，今后的世界历史不过是宣传和实施他们的社会计划。诚然，他们也意识到，他们的计划主要是代表工人阶级这一受苦最深的阶级的利益。在他们心目中，无产阶级只是一个受苦最深的阶级。但是，由于阶级斗争不发展，由于他们本身的生活状况，他们就以为自己是高高超乎这种阶级对立之上的。他们要改善社会一切成员的生活状况，甚至生活最优裕的成员也包括在内。因此，他们总是不加区别地向整个社会呼吁，而且主要是向统治阶级呼吁。他们以为，人们只要理解他们的体系，就会承认这种体系是最美好的社会的最美好的计划。因此，他们拒绝一切政治行动，特别是一切革命行动；他们想通过和平的途径达到自己的目的，并且企图通过一些小型的、当然不会成功的试验，通过示范的力量来为新的社会福音开辟道路。这种对未来社会的幻想的描绘，在无产阶级还很不发展、因而对本身的地位的认识还基于幻想的时候，是同无产阶级对社会普遍改造的最初的本能的渴望相适应的。但是，这些社会主义和共产主义的著作也含有批判的成分。这些著作抨击现存社会的全部基础。因此，它们提供了启发工人觉悟的极为宝贵的材料。它们关于未来社会的积极的主张，例如消灭城乡对立，消灭家庭，消灭私人营利，消灭雇佣劳动，提倡社会和谐，把国家变成纯粹的生产管理机构，——所有这些主张都只是表明要消灭阶级对立，而这种阶级对立在当时刚刚开始发展，它们所知道的只是这种对立的早期的、不明显的、不确定的形式。因此，这些主张本身还带有纯粹空想的性质。批判的空想的社会主义和共产主义的意义，是同历史的发展成反比的。阶级斗争越发展和越具有确定的形式，这种超乎阶级斗争的幻想，这种反对阶级斗争的幻想，就越失去任何实践意义和任何理论根据。所以，虽然这些体系的创始人在许多方面是革命的，但是他们的信徒总是组成一些反动的宗派。这些信徒无视无产阶级的历史进展，还是死守着老师们的旧观点。因此，他们一贯企图削弱阶级斗争，调和对立。他们还总是梦想用试验的办法来实现自己的社会空想，创办单个的法伦斯泰尔，建立国内移民区，创立小伊加利亚，即袖珍版的新耶路撒冷，——而为了建造这一切空中楼阁，他们就不得不呼吁资产阶级发善心和慷慨解囊。他们逐渐地堕落到上述反动的或保守的社会主义者的一伙中去了，所不同的只是他们更加系统地卖弄学问，狂热地迷信自己那一套社会科学的奇功异效。因此，他们激烈地反对工人的一切政治运动，认为这种运动只是由于盲目地不相信新福音才发生的。在英国，有欧文主义者反对宪章派，在法国，有傅立叶主义者反对改革派。四、共产党人对各种反对党派的态度看过第二章之后，就可以了解共产党人同已经形成的工人政党的关系，因而也就可以了解他们同英国宪章派和北美土地改革派的关系。共产党人为工人阶级的最近的目的和利益而斗争，但是他们在当前的运动中同时代表运动的未来。在法国，共产党人同社会主义民主党联合起来反对保守的和激进的资产阶级，但是并不因此放弃对那些从革命的传统中承袭下来的空谈和幻想采取批判态度的权利。在瑞士，共产党人支持激进派，但是并不忽略这个政党是由互相矛盾的分子组成的，其中一部分是法国式的民主社会主义者，一部分是激进的资产者。在波兰人中间，共产党人支持那个把土地革命当作民族解放的条件的政党，即发动过1846年克拉科夫起义的政党。在德国，只要资产阶级采取革命的行动，共产党就同它一起去反对专制君主制、封建土地所有制和小市民的反动性。但是，共产党一分钟也不忽略教育工人尽可能明确地意识到资产阶级和无产阶级的敌对的对立，以便德国工人能够立刻利用资产阶级统治所必然带来的社会的和政治的条件作为反对资产阶级的武器，以便在推翻德国的反动阶级之后立即开始反对资产阶级本身的斗争。共产党人把自己的主要注意力集中在德国，因为德国正处在资产阶级革命的前夜，因为同17世纪的英国和18世纪的法国相比，德国将在整个欧洲文明更进步的条件下，拥有发展得多的无产阶级去实现这个变革，因而德国的资产阶级革命只能是无产阶级革命的直接序幕。总之，共产党人到处都支持一切反对现存的社会制度和政治制度的革命运动。在所有这些运动中，他们都强调所有制问题是运动的基本问题，不管这个问题的发展程度怎样。最后，共产党人到处都努力争取全世界民主政党之间的团结和协调。共产党人不屑于隐瞒自己的观点和意图。他们公开宣布：他们的目的只有用暴力推翻全部现存的社会制度才能达到。让统治阶级在共产主义革命面前发抖吧。无产者在这个革命中失去的只是锁链。他们获得的将是整个世界。全世界无产者，联合起来！","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"语音合成应用1","slug":"2019-01-12-语音合成应用1","date":"2019-01-12T05:34:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-01-12-语音合成应用1.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-01-12-语音合成应用1.html","excerpt":"","text":"文章采集及分段ffmpeg合并音频 生成srt字幕文件 pip install librosa","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"ffmpeg","slug":"ffmpeg","permalink":"https://blog.ccsyue.com/tags/ffmpeg/"},{"name":"pyspider","slug":"pyspider","permalink":"https://blog.ccsyue.com/tags/pyspider/"}]},{"title":"windows下安装pyspider","slug":"2019-01-09-windows下安装pyspider","date":"2019-01-09T08:17:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-01-09-windows下安装pyspider.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-01-09-windows下安装pyspider.html","excerpt":"","text":"安装python查看朋友spider所支持的Python版本，Python 2.{6,7}, 3.{3,4,5,6} support。下载地址：https://www.python.org/downloads/ ，安装3.5，安装时后勾选添加环境变量。自带pycurl，如果其他版本，还需下载安装：https://www.lfd.uci.edu/~gohlke/pythonlibs/ 可能缺少api-ms-win-crt-runtime-l1-1-0.dll 安装pip使用get-pip.py进行安装 curl https://bootstrap.pypa.io/get-pip.py -o get-pip.pypython get-pip.py 安装pyspider pip install pyspiderpyspider 安装phantomjshttp://phantomjs.org/download.html win10+python3.5.4运行pyspider错误解决 Deprecated option ‘domaincontroller’: use ‘http_authenticator.domain_controller’ instead这个问题 是因为默认pip安装的版本是3.0.x 解决方法 是卸载该版本 切换成2.4.1版本 pip uninstall wsgidavpip install wsgidav==2.4.1 pyspider启动报cannot import name ‘DispatcherMiddleware’解决办法降低werkzeug版本 python -m pip uninstall werkzeug -y # 卸载python -m pip install werkzeug==0.16.1 #安装0.16.1版本 pip install librosa 安装出错 pip3 install llvmlite-0.31.0-cp35-cp35m-win_amd64.whl","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"python","slug":"python","permalink":"https://blog.ccsyue.com/tags/python/"},{"name":"pyspider","slug":"pyspider","permalink":"https://blog.ccsyue.com/tags/pyspider/"}]},{"title":"ffmpeg使用","slug":"2019-01-08-ffmpeg使用","date":"2019-01-08T08:00:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-01-08-ffmpeg使用.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-01-08-ffmpeg使用.html","excerpt":"","text":"裁剪视频 使用开始时间和裁剪时长来确定裁剪范围 ffmpeg -ss 0:0:0 -t 0:1:29 -i “input.mp4” -vcodec copy -acodec copy “output.mp4” 压缩视频 根据“原文件数据速率”*“文件大小比例”计算-b后的数值 ffmpeg -i “input.mp4” -b 720k -strict -2 “output.mp4” excel公式：=”ffmpeg -ss 0:0:0 -t 0:1:29 -i “””&amp;A1&amp;””” -vcodec copy -acodec copy “”E:\\3集压缩\\”&amp;A1&amp;”””” 合并视频filelist.txt： 123file &apos;1.mp4&apos;file &apos;2.mp4&apos;file &apos;3.mp4&apos; ffmpeg -f concat -safe 0 -i filelist.txt -c copy output.mp4 excel公式：重命名：=”rename “”E:\\3集压缩\\c”&amp;A1&amp;””” “&amp;LEFT(A1,FIND(“.”,A1)-1)&amp;”.mp4”合并：=”ffmpeg -i “”c”&amp;A1&amp;””” -b 720k -strict -2 “””&amp;A1&amp;””””","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"ffmpeg","slug":"ffmpeg","permalink":"https://blog.ccsyue.com/tags/ffmpeg/"}]},{"title":"舟子解梦","slug":"2019-01-07-舟子解梦","date":"2019-01-07T09:30:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2019/2019-01-07-舟子解梦.html","link":"","permalink":"https://blog.ccsyue.com/2019/2019-01-07-舟子解梦.html","excerpt":"","text":"1.人间有梦 梦里时空“梦之辽阔，可纳山川日月；梦之幽远，直抵心海深渊。一个人平均一天要做4到6个梦，一个梦平均要十几到二十分钟，这样算下来，一个人一生当中做梦的时间长达六年。弗洛伊德说，人的意识就像冰山露出水面的那个小小山尖，而它隐藏在水面之下的庞大身躯，则代表着人的无意识和潜意识。人做梦时，就像冰山一样，思绪漂浮摇曳在意识、无意识和潜意识的山尖上。但是现代认知心理学认为，梦，与醒着时候的思维并没有本质的区别；差别在于，在清醒的时候我们的思维可以在大脑的各个区域畅通无阻，而在做梦的时候，有一些“门”是关着的。在梦中，所有你以为已经忘记的人和事，隐藏在潜意识中的爱恨情仇，都可能以不同的面目重组出现。 2.因何而梦 梦醒时分“梦里不知身是客。既然我们每晚都做梦，为什么有时记得自己做了梦，有时却觉得一夜无梦？这跟我们醒来的时间有关。认知心理学认为睡眠可以分成“慢波睡眠”和“快波睡眠”两部分。我们刚刚入睡的时候，是属于慢波睡眠，然后进入快波睡眠阶段。慢波睡眠阶段对我们身体和肌肉进行调节，是不做梦的；快波睡眠的阶段是做梦的，快波睡眠也叫做快速眼动睡眠，这个时候眼球会快速转动，如果把处于快波睡眠阶段的人给叫醒的话，他一定会告诉你，我正在做梦。慢波睡眠和快波睡眠交替进行，这样形成一个周期，一个周期持续的时间大概是90分钟，一个晚上完整睡一觉，大概要经历4到6个周期。如果你醒来的时候是处于“快波睡眠”的状态，那么你就会依稀记得自己做过了梦；如果醒来的时候是处于“慢波睡眠”的状态，这时你就会觉得这一晚上都没有做梦。 3.梦中非我 我非梦中“我思，故我在；但在梦中，有时我却成了一条鱼，有时变成了一只老虎，有时甚至压根不存在自己。为什么在梦中会迷失自我？这跟大脑的前额叶有关。额叶是我们产生意识的地方，同时承担着组织信息的功能。而在睡眠状态，额叶是受到抑制的，这样会导致自我意识与信息的处理产生分离，所以在梦中就分不清自己、他人、甚至别的事物，导致你在梦中看到的他人和别的事物，往往还带着自己的成分。额叶受到抑制以后，对信息的组织功能也受到了抑制，这就导致做梦的时候，思维没法集中，所以在梦中发生的这个故事发展的方向往往是随机的。大脑的额叶是否处于活跃的状态是区分一个人清醒还是睡梦的一个标志，如果额叶受到抑制，人就进入睡眠的状态，这个时候如果大脑的其它区域处于活跃的状态，人就开始做梦。庄周晓梦迷蝴蝶，两千多年前的庄子在梦中的疑惑，大概也源于此。而我们，是否也有过如庄子一样的迷惑？ 4.梦游非梦 觉后空空“梦游，让许多人感到恐惧。梦游现象产生的原因，迄今还没有获得确切的科学解释。准确地说，梦游应该叫为“睡游”，因为梦游的时候实际上并不是处于做梦的快波睡眠状态，而是处于没有梦的慢波睡眠状态。这就是为什么你如果把梦游的人叫醒的话，他什么都记不得，因为他并不是在做梦。有一种推测认为，梦游可能跟大脑深处的海马体有关系。海马体它起两个作用，一个是把临时储存的信息转化成记忆，另一个跟空间定位有关，所以海马体发育还不成熟的儿童容易发生梦游，老人也容易发生梦游，这可能跟海马体的功能退化有关系。有一种说法认为，你不能去叫醒梦游的人，如果把他们叫醒的话，他们会失魂而发疯，实际上这是一种迷信的说法，梦游的人是很难把他们叫醒的，如果把他们叫醒的话，他们只会觉得迷惑不解，不知道发生了什么事。人生若只如初见。人们梦游，是否为了赶赴那隐藏在心底的一面之缘？ 5.缠绵悱恻 梦里水乡“梦里涕泪交流，醒来枕巾尽湿，许多人都做过这样的伤感之梦。为何做梦时什么都是假的，情绪却如此真实？答案在于杏仁核，杏仁核位于海马体的旁边，是我们大脑的情绪中心，在储存记忆的过程中，杏仁核会对接收来的信息，先进行一番衡量，给出喜、怒、哀、乐的结果，再把这个结果传到海马体，海马体把接收来的结果，跟原来的信息进行综合，储存进去变成我们的记忆，所以情绪反应强烈的事件会给我们留下更加深刻的记忆。杏仁核是人脑当中最敏感的区域，几乎任何身体的刺激都会唤醒杏仁核，即使是在睡梦当中大脑产生的无中生有的景象，也会作为一种信号传到这个控制情绪的中心。拜多愁善感的杏仁核所赐，我们睡梦中的喜怒哀愁是那么的真实，甚至强于白天清醒时；醒来的那一刻，却又往往让人怅然若失。 6.有梦如觉 梦中有梦“许多人还做过这样一种梦：在梦里，自己突然意识到自己是在做梦；更有甚者，梦中还会做梦，如同电影《盗梦空间》所示。这种情况跟丘脑有关系。丘脑是一个很特殊的器官，它的功能是合成大脑各个部位的信息，并且跟现实感官的信息做比较，让大脑做出一个综合的判断。从而知道我是谁、我怎么样、我正在做什么、我应该干什么。做梦的时候，丘脑的功能被抑制了，这样人就迷失了自我，被梦境所左右，不知道自己是在做梦；但是有时候，丘脑的抑制不深，这个时候你就会意识到自己正在面临着什么样的处境，感觉到自己是在做梦。至于梦中有梦，实际上是一种错觉，只不过是梦见自己在做梦而已。像《盗梦空间》所描述的多重梦境纯属异想天开。梦中有梦，或许源于每个人心底都有的、需要穷尽一生探索的那个问题：我是谁？ 7.梦之荒诞 颠倒黑白“在梦中，我们熟悉的亲朋好友有时会变成豺狼虎豹，原本慈爱的长辈会突然化身为恶魔。这与大脑中负责识别事物的颞叶有关系。听觉、视觉、触觉、嗅觉收集来的信息传递到了颞叶，让我们能够对事物做出识别，一旦颞叶被关闭了，我们对当前的事物就失去了识别能力。另外，在梦中的角色往往是杂乱无章的。大脑搜寻信息的过程，类似于电脑中用“关键词”来搜索信息，得到的结果往往不只是一个；睡梦中视觉、听觉、味觉这些感觉中枢受到了抑制，导致搜索得来的多个结果没法输出到颞叶，去和大脑各个区域得到的信息进行比较，没法验证，没法对思维过程进行修正、补充，这样就导致在梦里出现的信息往往是非常地荒诞离奇，漏洞百出。梦里黑白可能颠倒，真实的人生何尝不是如此。 8.众生有梦 梦自何始“婴幼儿会做梦吗？比婴儿更小的胎儿会做梦吗？猫猫狗狗会做梦吗？据科学家观察，8个月大的胎儿在母亲睡着了以后，身体也会停止运动，但是有眼球快速转动的现象，这是做梦的迹象。至于动物，大多数的爬行动物是不会做梦的；鸟类会做短暂的梦；各种哺乳动物，像猫、狗、老鼠都会做梦；而无脊椎动物、鱼类、两栖动物是不会做梦的。动物会做什么样的梦？美国科学家通过实验发现，像猴子这样的灵长类动物会跟人类一样，做类似的梦。这个试验是这样做的：一旦屏幕上出现某个特定的画面，科学家就强迫猴子去推动身边的一根杠杆，反复操作让猴子形成反射；接下来观察睡着了的猴子，发现它们会不时地也去推动身边的这根杠杆。这表明猴子在睡梦中“看见”了那个特定的画面。当我们养的宠物做梦时，在梦里它们会有被主人遗弃的恐惧吗？还是梦见的都是与主人在一起的欢乐时光？ 9.神游天外 灵感之梦“许多人听说过科学和技术史上的几个著名的梦美国人埃利亚斯•豪因梦见头上带孔的长矛，由此发明了将针孔设计在针头旁的缝纫机；俄国科学家门捷列夫因受到梦的启示而发现元素周期律；奥地利生物学家洛伊在梦中找到一种实验方法，最终发现了神经传导的化学递质。有人把睡梦中的灵感当作了神的启示。实际上，这些科学家在做这些梦之前，无一例外都曾经苦苦思索过这些难题，他们的梦境不过是他们清醒时候思维的延伸罢了。只不过在睡梦中思维没有受到严格的约束，更加无拘无束，而所谓的“灵感”，就是在这种更大的随机性条件下一个低概率事件。正因如此，我们永远不要期望梦中的灵光一现——灵感，从来都只钟情于努力而勤奋的思考者。 10.疗伤于梦 盗梦空间“在公众心目中，催眠术似乎很神奇。实际上，专业的催眠师不过是比较高明地利用了心理暗示；而催眠作为一种治疗心理疾病以及作为麻醉的一种手段，由来已久。催眠控制的是人的注意力，一旦注意力变窄，人就进入了睡眠状态，但是还能通过听觉与催眠师的语言相互联系。催眠师通过语言，与梦境中的潜意识进行交流，把无序的梦变成有序，从而达到了改善睡眠、减压放松、调整心理、提高人的应变能力的目的。大约有98%的人在一定程度上对催眠比较敏感，而剩下2%的人很难被催眠。那些喜欢分析问题的人不容易被催眠，比如科学家、律师、会计师；而虔诚的宗教信徒、艺术家、喜欢幻想的人则很容易被催眠。这大概也可以说明，假如我们对什么都深信不疑，即使睁着眼睛生活，也像被催眠，活在睡梦中。 11.梦中祸福 预言之梦“人的一生平均有六年时间在做梦。有时，梦似乎像预言一般灵验。1865年4月，林肯遇刺身亡，遇刺前几天，他做了一个梦，梦见自己躺在白宫的灵柩里。1917年，还只是一个下士的希特勒在前线作战，一天晚上他梦见自己葬身于崩塌的土中，惊醒后他从掩体中跑出战壕，随后战壕被炸弹命中。且不说这些事情是真是假，从科学的角度来看，所谓的预言梦只发生在个别人的个别事情上，这说明它不过是一种巧合而已。还有一种情形，有一些人有一些似曾相识的体验，看到刚刚发生的事情似乎曾经在梦中发生过。这是不是说明了梦能够预言呢？不是的，这是大脑发生的记忆错误导致的，把刚刚产生的短期记忆，错误地当成了以前就已经有的长期记忆。但无论如何，当人们走在命运的十字路口时，还是有人希望从梦中寻找人生的方向。 12.身心造梦 梦的解析（一）“梦从何来？这个问题，人类探究了几千年。“日有所思夜有所梦”有一定道理，但不完全。认知心理学把梦因分成三类：一类是睡眠环境信息；一类是身体状况，包括身体各个器官的信息；还有一类是大脑内部活动。真正意义上的梦的解析，应该寻找梦因。由睡眠环境引发的梦境是最为常见的。比如说在清醒的状态下，有人把一个苹果放在你的手上，那么在嗅觉、触觉、视觉的共同作用下你能够判断这是一个苹果。但是在睡眠状态下，视觉和嗅觉被抑制住了，手上的一个苹果只会诱发触觉，“光滑”和“凉”的触觉信息传给了大脑，大脑进行搜索，得出的结果可能是“鱼”，于是在做梦的时候就梦见捉到了一条鱼。同样的道理，在睡梦中你的手脚伸到了被子外面受凉，那么你就可能做梦梦见自己掉进了水里或者其他与“凉”有关的事件。“如人饮水、冷暖自知”，梦如人生，人生如梦。 13.身心造梦 梦的解析（二）“身体状况导致的梦或许对我们更有提示意义。许多人都有经验，睡觉时手压在胸前容易做噩梦。这个过程是如何发生的？手放在胸部，压迫胸腔导致呼吸困难，信息传入到大脑中枢，体觉感受中枢判断“难受”的感觉来自于胸肺部；杏仁核接收到“呼吸障碍”信息，找到对应的情绪是“恐惧”；大脑根据“恐惧”这个关键词进行相关的搜索，找到与恐惧相关的事件，比如亲人去世、妖魔鬼怪这些信息被寻找到，组成了新的思维的结果，就出现了噩梦。这个时候如果额叶没有被唤醒，就导致“梦魇”。同样道理，心动过速产生似乎被追赶的心悸感，就会产生被别人或者动物、或者鬼怪追赶的恶梦；心动过缓或早博产生的心悸感，就会出现人悬空或者坠落的恶梦。所以如果经常出现某一种噩梦，可能是身体有某种疾病的警示。所以，当你从噩梦中醒来，应该考虑的不是人生问题，而是健康问题。 14.身心造梦 梦的解析（三）“大脑内在信息触发而做梦，这才是古人所总结的“日有所思夜有所梦”。这类梦全部来自于大脑记忆区的信息。在白天反复地想着某一个人，或某一件事，这一信息一再被加强，在睡梦中就有可能成为大脑进行搜索的“关键词”。既然梦来自于身心以及环境因素，那么我们不但可以根据梦的内容去寻找梦因，还可以据此来改善梦的条件。比如说睡前不要喝容易让人兴奋的食品饮料；要刷牙漱口，避免口腔的恶臭引发恶梦；要盖好被子，保持全身的温暖；最关键的是，在睡觉之前不要去想那些让人情绪恶劣的事情，尽量想美好的事情，让大脑储存下“美好”的信息，同时要保持舒适的睡姿，引导美梦。当然，我们没必要每晚为制造美梦而精心布置，这些睡前行为应该养成习惯，成为顺其自然的生活之道。 15.我行我梦 美梦方甘“白日梦，这是一个略带有讽刺意味的词汇；诚然，如果一个人整天沉浸在不切实际的幻想中，那么他与真正意义上的精神病已经相去不远。有研究认为，如果一个人做了太多的白日梦，就有可能对他的语言、记忆和思考能力造成损伤。但是也有研究认为，适当的幻想反而有益身心健康——它不仅能够减轻心理的压力，还能够拓展思考的空间，激发潜能，让人能够从更广泛的角度来审视自己。现实生活中，几乎每一个人都戴着一副沉重的人格面具，只有在超越现实的幻想中，人们才会彻底抛开由人际交往造成的桎梏，从而让自己的思绪更加宽广。而带有幻想性质的梦，无论是美梦、噩梦还是白日梦，都给了你从另一个角度、另一个空间窥视自己的机会。","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"科普","slug":"科普","permalink":"https://blog.ccsyue.com/tags/科普/"},{"name":"梦","slug":"梦","permalink":"https://blog.ccsyue.com/tags/梦/"}]},{"title":"Level4 Unit2 Part1","slug":"2018-11-09-Level4 Unit2 Part1","date":"2018-11-09T10:46:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2018/2018-11-09-Level4 Unit2 Part1.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-11-09-Level4 Unit2 Part1.html","excerpt":"","text":"Level4 Unit2 Part1 ListeningThe Earth was formed about 4.6 billion years ago.The first life appeared about a billion years later.The first plants didn’t appear until around 2 billion years ago.Until about 580 million years ago, life forms were small and microscopic.Since that time, life has evolved into many different types, or species.However, scientists estimate that more than 99% of them are now extinct.There have been several extinction events in the history of the Earth.In an extinction event many life forms, or species of life, die out.The causes of mass extinction events are unsolved mysteries.These events are not predictable and can happen at any time.Scientists think that some of them were started by asteroid impacts or volcanic eruptions.Events like these can change the global conditions that life depends on.One major extinction event happened about 66 million years ago.That event may have been started by a large asteroid that hit the Earth.As a result, the dinosaurs and about half of all species on the planet died out.When the asteroid hit the earth it started a chain of events.A chain of events is a series of events linked together, like a chain.This particular chain of events happened over a period of months and years.When the asteroid hit the Earth, it caused a huge cloud of dust to enter the atmosphere.This cloud of dust blocked the sun and darkened the Earth for many months.Without enough sunlight, plants and plant-eating animals quickly died.With the deaths of so many plants and animals, the food chain collapsed.This led to the deaths of many more species.Mass extinction events have played an important part in the evolution of life.In fact, some extinction events have helped to accelerate evolution.For example, some mammals lived through the age of the dinosaurs, but they couldn’t compete.When the dinosaurs were removed, the mammals were able to compete more successfully.Once they could compete, mammals evolved to a higher state.Without extinction events, perhaps we wouldn’t be here today.Scientists estimate that there have been at least 5 mass extinctions in the last 540 million years.They also believe that we have entered a new extinction event.Species are becoming extinct at a much faster rate than before.Instead of asteroids or volcanic eruptions, the current event is the result of human activities.Human activities, for example, have led to global warming.Global warming is the result of an increase in carbon gases in our atmosphere.These gases trap heat from the sun, so the Earth is getting warmer.As a result, sea levels are rising and weather patterns are changing.In addition, we humans are destroying the habitats of many plants and animals.Cutting down forests and polluting rivers destroys the habitats of many forms of life.There is no longer any doubt that this is happeningSpecies of life are disappearing at an increasing rate.Global temperatures are rising and weather patterns are changing.Scientists are warning us that fast action is necessary to save our future.If we don’t act, we may go the way of the dinosaurs.(This new extinction event is caused by humans.) Level4 Unit2 Part1 VocabularyThe body’s circulatory system includes the heart and blood vessels.The heart pumps blood to all parts of the body through a network of arteries and veins.The digestive system breaks down and absorbs food into the body.It supplies the energy that the body needs for growth and repair.After digestion, excess food is turned into waste and eliminated from the body.The nervous system includes the brain, spinal cord and nerves.This is your body’s control system.It controls your muscles and organs, including your circulatory and digestive system.The respiratory system includes the nose and lungs.It brings air and oxygen into the body and removes carbon dioxide.The lungs are where oxygen enters the bloodstream, and carbon dioxide is removed.The immune system protects the body against infections and diseases.Sneezing and fever are examples of how the immune system works.If an infection invades the body, the immune system attacks it.(The blood vessels that carry oxygen-rich blood from the heart are called arteries.)(The digestive system is where food is broken down and absorbed into the body.)(The nervous system regulates your heartbeat and digestion.)The controlled use of fire allowed people to cook food and survive in the colder climates.Fire provided light so that people could work and socialize for longer hours.With the invention of agriculture, people could grow food and settle into communities.By growing food, people could spend less time hunting, and more time for other things such as art.The domestication of animals allowed people to raise and use animals for food and work.By raising herds of animals such as sheep, humans had a regular supply of meat and clothing.The strength of animals such as horses and oxen was used for work and transportation.The development of tools and machines has resulted in more efficient manufacturing and construction.With better tools and machines, work can be done with fewer people and at much lower costs.The development of science and engineering has improved many things, including communications.With an understanding of electricity, telephones and radios allow people to communicate over long distances.(Science and engineering have changed the way we communicate with each other.)(With the development of agriculture, people had more time for other activities.)(The use of machines has reduced the number of people needed to make things.) Level4 Unit2 Part1 DialogueI took a vacation last night.What are you talking about?Where did you take your vacation?I didn’t go anywhere.I just spent an evening without my smartphone.How was it?It was great. I got a real magazine and read it with no interruption.It was very peaceful.Yes, I haven’t done that in a long time.You know what?I’m beginning to hate smartphones.Really? but you can’t live without one, right?Yes, that’s the problem.These things are changing the way people live.Yes, I just saw a documentary about that.A husband was complaining to his wife that she was spending too much time on her smartphone.what happened? Did they get a divorce?You guessed it. In the end, they got a divorce.It’s a bit ironic, don’t you think?Smartphone were supposed to bring people together, but they are pulling people apart.Yes, you are right.Hey, just a minute. I’ve got a message on my smartphone, and it can’t wait.Hey, wake up and get back to work.What’s wrong with you?I’m on my break sir, and I have a bad headache.Well, we are not paying you to sleep.If you’re going to sleep, sleep someplace else.Yes, sir, sorry, it won’t happen again.It had better not.Just a minute.Don’t talk to me like that.What did you say?You hurt me. you don’t have to treat people like that.Well, if you don’t like it, I suggest you leave.OK, I will. I’ve had enough of you.I’ll get a job somewhere else.(The manager treats the employees in a threatening manner.)(The employee treats the manager respectfully.)","categories":[{"name":"英语","slug":"英语","permalink":"https://blog.ccsyue.com/categories/英语/"}],"tags":[{"name":"英语流利说","slug":"英语流利说","permalink":"https://blog.ccsyue.com/tags/英语流利说/"}]},{"title":"Level4 Unit1 Part4","slug":"2018-11-09-Level4 Unit1 Part4","date":"2018-11-09T10:21:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2018/2018-11-09-Level4 Unit1 Part4.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-11-09-Level4 Unit1 Part4.html","excerpt":"","text":"Level4 Unit1 Part4 ListeningQuickserve is a successful home repair company.It provides quick reliable repair services to homes.It was established 5 years ago and has been expanding rapidly.In the last two years, it has opened offices in three new cities.Because of its rapid growth it has to hire many new employees.In the last six months, it has hired 50 new employees.The total number of employees in the company is now over 500.And the number of customers has increased to more than 5000.The company has also improved its business model.Instead of offering only repair services it can now help customers upgrade their appliances.Quickserve does this by giving a choice.Customers can choose to repair an appliance or upgrade it by buying a new one.If they choose to buy a new one they will get a discounted price.So a customer can either repair a broken refrigerator for a small fee or buy a new one.If they buy a new one ,they will get a discounted price, along with free installation.This is possible because several appliance manufacturers have agreed to give Quickserve big discounts.Quickserve then installs the new appliance and removes the old one.Feedback from customers has been positive.A high percentage of customers have taken advantage of this new service.As a result, Quickserve has developed a great reputation.Its dedication to high quality service has proven to be successful.Its word-of-mouth approach to advertising has been cost effective.The appliance manufactures have also been happy with the results.Their growing relationship with Quickserve has helped to increase their sales.The world’s population is growing.There are now over 7 billion people in the world.During the 20th century, the population grow from 1.65 billion to 6 billion.It’s now growing at a rate of around 1.1 percent per year.That means an increase about 80 million per year.By 2024, the population is expected to be around 8 billion people.The growth rate used to be higher.In the late 1960s. the rate of growth was about 2%.Since then the growth rate has declined .It is estimated that the growth rate will be less than 1% by 2020.By the year 2050, the growth rate should be even less.Even with a declining growth rate, the population will continue to grow.But it will grow at a slower rate.In the past 50 years, the world’s population has more than doubled.It has doubled from around 3 billion in 1960 to more than 7 billion in 2011.The rate of growth varies by country.The growth rate in India is more than twice that of China.And the growth rate in Nigeria, which is in Africa, is more than twice India’s growth rate.Russia on the other hand, has had a negative growth rate in some years.When a country has a negative growth rate, its population is decreasing. Level4 Unit1 Part4 VocabularyCo-founder of Apple, this entrepreneur was a major figure in the computer industry.He was self-centered and difficult to work for, but he led the development of many great products.He died of cancer when he was just 56 years old.Jack Ma, is one of the richest and most famous man in China.He comes from a poor family and failed his college entrance exams twice.Despite his many failures he has built one of the world’s largest internet companies.David Beckham is one of the world’s richest and most famous athletes.He started playing professional football when he was just 17.Much of his success as an athlete, is because he practiced harder than many other players.As a young girl in Pakistan, Mlala became famous for her writings on women’s education.In 2012, She was shot in the head and nearly killed.She survived the injury, and became the world’s most famous teenager.Born in 1942, Stephen Hawking is one of the world’s most famous scientist.When he was 23, he was diagnosed with ALS, a rare disease of the nerves.Because of his disease, he is unable to walk and talk.Shy people are usually quiet and uncomfortable around other people.They generally dislike going to social events such as parties.It’s often difficult to make friends with a shy person because they won’t open up.Outgoing people enjoy being with others and are comfortable in social situations.They are friendly and pleasant to be with, though sometimes they can’t be trusted.Self-centered people like to be the center of attentionThey like people to look at them, and pay attention to them.Self-centered people often talk too much, and don’t listen enough.Selfish and greedy people don’t share things with others.They keep things for themselves and always want more.People who are responsible and trustworthy are important in almost any situation.They can be depended on to get things done.These people can be trusted.（She has won many prizes, including the Nobel Peace Prize.）（Outgoing people often have many friends and can be quite popular.）（Greedy people want more than their share and can cause many problems for others.）(Though he was difficult to work for, his creative genius inspired others to do great work.) Level4 Unit1 Part4 DialogueHey, Steven, you know I’m your friend, right?Sure, I know that.What are you trying to say.I’m sorry to say this. But I think you’re making a fool of yourself.How am I making a fool of myself.Your girlfriend is taking advantage of you.Taking advantage of me?Yes, I think so.She’s just using you.So, maybe she is.But I don’t mind.Even if she is using me, it’s ok.I’m using her too.What do you mean?Aren’t you in love with her?Yes, I’m in love with her.But that doesn’t mean I’m not using her too.I don’t understand.What do you mean?Maybe I’m using her because I enjoy being in love.I can’t imagine life without her.Even if she hurts me sometimes, I love her.Do you trust her?Yes, I trust her.She tells me what’s important to her.She’s honest with me.She has never lied to me about anything important.Are you honest with her?Yes, we are honest with each other, even when it hurts.And because we’re honest with each other, we trust each other.OK, so you don’t think you’re being taken advantage of.No, I don’t, as long as she is honest with me.The day she isn’t honest with me, will be the end of our relationship.And when that happens, my heart will break.But until then, I’m her man.OK, I think I understand.I didn’t think you knew what was going on.I’m not as stupid as my look, my friend.Being in love with her, makes my life exciting.Well, I hope you’re right.","categories":[{"name":"英语","slug":"英语","permalink":"https://blog.ccsyue.com/categories/英语/"}],"tags":[{"name":"英语流利说","slug":"英语流利说","permalink":"https://blog.ccsyue.com/tags/英语流利说/"}]},{"title":"国庆感冒进修","slug":"2018-10-04-国庆感冒进修","date":"2018-10-04T15:10:00.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2018/2018-10-04-国庆感冒进修.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-10-04-国庆感冒进修.html","excerpt":"","text":"工具如下： 必须往usb插入一个东西，防止卡在菜单界面。 几个应用: qq文件助手、docker:shadowsocks-privoxy。 用了gsuit和onedrive才知道百度云是多么的烂。 frp客户端的配置以及Padavan 设置 frp客户端配置： 12345678910111213141516171819202122232425262728293031#客户端配置：cat &gt; &quot;/tmp/frp/myfrpc.ini&quot; &lt;&lt;-\\EOF[common]server_addr = freenat.club#frps服务端地址server_port = 7000token = frp888log_file = frpc.loglog_level = infolog_max_days = 3login_fail_exit = falseprotocol = kcp[http_dsmdeffyc]type = httplocal_ip = 192.168.3.3local_port = 5000use_compression = trueuse_encryption = truecustom_domains = xx1.xx.xx[http_routedeffyc]type = httplocal_ip = 192.168.123.1local_port = 81use_compression = trueuse_encryption = truecustom_domains = xx2.xx.xxEOF 7ghost从iis迁移至nginx配置：12345678910111213141516171819202122232425262728293031323334353637server &#123; listen 81; # 访问端口1 server_name localhost; root /opt/www/default/; index index.html index.htm index.php default.php tz.php; error_page 500 502 503 504 /50x.html; charset gbk;//编码 location = /50x.html &#123; root html; &#125; location ~* ^.+\\.php(\\/.*)*$ &#123; #fastcgi_pass 127.0.0.1:9000; fastcgi_pass unix:/tmp/php5-fpm.sock; fastcgi_index index.php; fastcgi_param SCRIPT_FILENAME $document_root$fastcgi_script_name; include fastcgi_params; &#125; location ~* \\.html$ &#123; rewrite ^(.*)$ /index.php last; &#125; location ~* \\.*$ &#123; set $tmp &quot;/tmp&quot;; try_files $tmp$uri $uri /index.php; &#125; location / &#123; #root /tmp #autoindex on; #autoindex_localtime on; #autoindex_exact_size off; rewrite ^(.*)$ /index.php last; &#125; &#125; php发送udp远程唤醒1234567891011121314151617181920212223242526272829303132333435&lt;?phpfunction wakeOnLan($ip, $mac, $port) &#123; $addr_byte = explode(&apos;:&apos;, $mac); $hw_addr = &apos;&apos;; for ($i = 0; $i &lt; 6; $i++) $hw_addr.= chr(hexdec($addr_byte[$i])); $msg = chr(255) . chr(255) . chr(255) . chr(255) . chr(255) . chr(255); for ($i = 1; $i &lt;= 16; $i++) $msg.= $hw_addr; $socket = socket_create(AF_INET, SOCK_DGRAM, SOL_UDP); if ($socket == false) &#123; echo &quot;create socket failed!\\n&quot;; echo &quot;error：&apos;&quot; . socket_last_error($socket) . &quot;&apos; - &quot; . socket_strerror(socket_last_error($socket)); return FALSE; &#125; else &#123; $opt_ret = socket_set_option($socket, SOL_SOCKET, SO_BROADCAST, TRUE); if ($opt_ret &lt; 0) &#123; echo &quot;setsockopt() failed, error: &quot; . strerror($opt_ret) . &quot;\\n&quot;; return FALSE; &#125; if (socket_sendto($socket, $msg, strlen($msg) , 0, $ip, $port)) &#123; echo &quot;唤醒数据包发送成功!&quot;; socket_close($socket); return TRUE; &#125; else &#123; echo &quot;唤醒数据包发送失败!&quot;; return FALSE; &#125; &#125;&#125;function actionTestWakeOnLan() &#123; $mac = &apos;00:11:32:0E:36:74&apos;; $ip = &apos;192.168.3.3&apos;; wakeOnLan($ip, $mac, 2304);&#125;;actionTestWakeOnLan();?&gt; 静态路由设置共3级路由，除了光猫无法登陆，2级、3级路由设置如下： 磊科 类型 目标地址 掩码 网关 接口 NET 192.168.123.0 255.255.255.0 192.168.3.2 LAN Padavan 网络/主机 IP 网络掩码 网关 接口 192.168.3.0 255.255.255.0 192.168.3.1 WAN 修改prose使之支持hexo图片路径完美解决，gatekeeper地址在gh-pages处更新，编译master时才获取配置文件。 感受东西 英语学习停了4天 感冒快好了 休息比较少 陪伴家人较少","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"docker","slug":"docker","permalink":"https://blog.ccsyue.com/tags/docker/"},{"name":"php","slug":"php","permalink":"https://blog.ccsyue.com/tags/php/"},{"name":"nginx","slug":"nginx","permalink":"https://blog.ccsyue.com/tags/nginx/"},{"name":"群晖","slug":"群晖","permalink":"https://blog.ccsyue.com/tags/群晖/"}]},{"title":"docker pptp","slug":"2018-10-02-docker pptp","date":"2018-10-02T03:11:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-10-02-docker pptp.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-10-02-docker pptp.html","excerpt":"","text":"12345678910pptp: image: index.docker.io/mobtitude/vpn-pptp:latest privileged: true restart: always ports: - 1723:1723 volumes: - /root/ppp/chap-secrets:/etc/ppp/chap-secrets - /root/ppp/pptpd-options:/etc/ppp/pptpd-options net: host","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"docker","slug":"docker","permalink":"https://blog.ccsyue.com/tags/docker/"}]},{"title":"当excel中vlookup遇到日期匹配","slug":"2018-09-29-当excel中vlookup遇到日期匹配","date":"2018-09-29T09:36:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-09-29-当excel中vlookup遇到日期匹配.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-09-29-当excel中vlookup遇到日期匹配.html","excerpt":"","text":"注意查找日期的单元格格式，日期本质上是一个数字，在查找时不能使用日期来匹配一个text函数的文本结果。","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"excel","slug":"excel","permalink":"https://blog.ccsyue.com/tags/excel/"}]},{"title":"prose部署在heroku","slug":"2018-09-29-prose-heroku","date":"2018-09-28T20:15:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-09-29-prose-heroku.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-09-29-prose-heroku.html","excerpt":"","text":"pull prose 修改prose/app/views/header.js,107行代码12var newPath = pathUtil.join.apply(null, parts.concat([date + &apos;-&apos; + value + &apos;.&apos; + extension]));//util.stringToUrl(value) cause non-alphanumeric words disappeared 注册heroku,并cli","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"git","slug":"git","permalink":"https://blog.ccsyue.com/tags/git/"}]},{"title":"gh-pages静态博客搭建经验","slug":"2018-09-29-gh-pages","date":"2018-09-28T19:05:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-09-29-gh-pages.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-09-29-gh-pages.html","excerpt":"","text":"使用pose.io来在线编写以前使用小书匠，感觉很方便，但随着时间的推移。发现了一些问题。 小书匠收费了 免费版不能同步文档的配置 图片插入问题还无法很好解决 在寻求免费方案时发现了pose.io，但我用的是hexo，折腾一番后请看_pose.yml文件的配置吧。ui修改方面，根据文章列表div的分类名查找所在文件，添加修改按钮 hexo-ruby-character插件的使用 目前将nodejs降级到7.1.0，编译不报错。 在面临大量转换时还是得使用nodepad++之类的使用正则表达式转换。比如进行如下的替换：12&apos;([^0-9#，。？\\r\\n ])&apos; 替换为 &apos; &#123;% ruby \\1 %&#125;&apos;&apos;\\r\\n&#123;&apos; 替换为 &apos;\\r\\n### &#123;&apos; gitment认证域名安全证书过期 Heroku搭建：gh-oauth-server 替换gitment.browser.js里的url https://gh-oauth.imsun.net/ 为heroku应用域名 替换coment.ejs里的js的引用1234&lt;%- css(&apos;vendor/default&apos;) %&gt;&lt;%- js(&apos;vendor/gitment.browser&apos;) %&gt;&lt;!--&lt;link rel=&quot;stylesheet&quot; href=&quot;https://imsun.github.io/gitment/style/default.css&quot;&gt;&lt;script src=&quot;https://imsun.github.io/gitment/dist/gitment.browser.js&quot;&gt;&lt;/script&gt;--&gt;","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"markdwon","slug":"markdwon","permalink":"https://blog.ccsyue.com/tags/markdwon/"},{"name":"hexo","slug":"hexo","permalink":"https://blog.ccsyue.com/tags/hexo/"}]},{"title":"小学必备诗词","slug":"2018-09-29-小学必备诗词","date":"2018-09-28T17:32:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-09-29-小学必备诗词.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-09-29-小学必备诗词.html","excerpt":"","text":"(title)\\n(content)01 咏鹅骆宾王 鹅，鹅，鹅，曲项向天歌。白毛浮绿水，红掌拨清波。 02 敕勒歌北朝民歌 敕勒川，阴山下。天似穹庐，笼盖四野(ya3)。天苍苍，野茫茫，风吹草低见(xian4)牛羊。 03 春晓孟浩然 春眠不觉晓，处处闻啼鸟。夜来风雨声，花落(luo4)知多少。 04 回乡偶书贺知章 少小离家老大回，乡音无改鬓毛衰(cui1)。儿童相见不相识，笑问客从何处来。 05 静夜思李白 床前明月光，疑是地上霜。举头望明月，低头思故乡。 06 忆江南白居易 江南好，风景旧曾(ceng2)谙。日出江花红胜火，春来江水绿如蓝，能不忆江南？ 07 游子吟孟郊 慈母手中线，游子身上衣。临行(xing2)密密缝，意恐迟迟归。谁言寸草心，报得三春晖？ 08 古朗月行(xing2)（节选）李白 小时不识月，呼作白玉盘。又疑瑶台境，飞在青云端。 09 元日王安石 爆竹声中一岁除，春风送暖入屠苏。千门万户曈曈日，总把新桃换旧符。 10 登鹳雀楼王之涣 白日依山尽，黄河入海流。欲穷千里目，更上一层楼。 11 望庐山瀑布李白 日照香炉生紫烟，遥看瀑布挂前川。飞流直下三千尺，疑是银河落(luo4)九天。 12 早发白帝城李白 朝辞白帝彩云间，千里江陵一日还。两岸猿声啼不住，轻舟已过万重山。 13 江畔独步寻花杜甫 黄四娘家花满蹊，千朵万朵压枝低。留连戏蝶时时舞，自在娇莺恰恰啼。 14 六月二十七日望湖楼醉书苏轼 黑云翻墨未遮山，白雨跳珠乱入船。卷地风来忽吹散，望湖楼下水如天。 15 小池杨万里 泉眼无声惜细流,树荫照水爱晴柔。小荷才露尖尖角,早有蜻蜒立上头。 16 四时田园杂兴范成大 昼出耘田夜绩麻，村庄儿女各当家。童孙未解供耕织，也傍桑阴学种瓜。 17 悯农（其一）李绅 春种一粒粟，秋收万颗子。四海无闲田，农夫犹饿死！ 18 悯农(其二）李绅 锄禾日当午，汗滴禾下土。谁知盘中餐，粒粒皆辛苦 19 晓出净慈寺送林子方杨万里 毕竟西湖六月中，风光不与四时同。接天莲叶无穷碧，映日荷花别样红。 20 绝句杜甫 迟日江山丽，春风花草香。泥融飞燕子，沙暖睡鸳鸯。 21 送元二使安西王维 渭城朝雨浥轻尘，客舍青青柳色新。劝君更尽一杯酒，西出阳关无故人。 22 赋得古原草送别白居易 离离原上草，一岁一枯荣。野火烧不尽，春风吹又生远芳侵古道，晴翠接荒城，又送王孙去，萋萋满别情。 23 鹿柴王维 空山不见人，但闻人语响。返景入深林，复照青苔上。 24 凉州词王翰 葡萄美酒夜光杯，欲饮琵琶马上催。醉卧沙场君莫笑，古来征战几人回？ 25 别董大高适 千里黄云白日曛，北风吹雁雪纷纷。莫愁前路无知己，天下谁人不识君。 26 出塞王昌龄 秦时明月汉时关，万里长征人未还。但使龙城飞将在，不教胡马度阴山。 27 望天门山李白 天门中断楚江开，碧水东流至此回。两岸青山相对出，孤帆一片日边来。 28 山行杜牧 远上寒山石径斜，白云生处有人家。停车坐爱枫林晚，霜叶红于二月花。 29 长歌行汉乐府 青青园中葵，朝露待日晞。阳春布德泽，万物生光辉。常恐秋节至，焜黄华叶衰。百川东到海，何时复西归？少壮不努力，老大徒伤悲。 30 绝句杜甫 两个黄鹂鸣翠柳，一行白鹭上青天。窗含西岭千秋雪，门泊东吴万里船。 31 竹里馆王维 独坐幽篁里，弹琴复长啸。深林人不知，明月来相照。 32 梅花王安石 墙角树枝梅，凌寒独自开。遥知不是雪，为有暗香来。 33 石灰吟于谦 千锤万击出深山，烈火焚烧若等闲。粉身碎骨浑不怕，要留清白在人间。 34 九月九日忆山东兄弟王维 独在异乡为异客，每逢佳节倍思亲。遥知兄弟登高处，遍插茱萸少一人。 35 七步诗曹植 煮豆燃豆萁，漉豉以为汁。萁在釜下燃，豆在釜中泣。本是同根生，相煎何太急。 36 望洞庭刘禹锡 湖光秋月两相和，潭面无风镜未磨。遥望洞庭山水翠，白银盘里一青螺。 37 惠崇《春江晓景》苏轼 竹外桃花三两枝，春江水暖鸭先知。蒌蒿满地芦芽短，正是河豚欲上时。 38 题西林壁苏轼 横看成岭侧成峰，远近高低各不同。不识庐山真面目，只缘身在此山中。 39 乐游原李商隐 向晚意不适，驱车登古原。夕阳无限好，只是近黄昏！ 40 赠汪伦李白 李白乘舟将欲行，忽闻岸上踏歌声。桃花潭水深千尺,不及汪伦送我情。 41 黄鹤楼送孟浩然之广陵李白 故人西辞黄鹤楼，烟花三月下扬州。孤帆远影碧空尽，惟见长江天际流。 42 塞下曲卢纶 林暗草惊风，将军夜引弓。平明寻白羽，没在石棱中。 43 浪淘沙刘禹锡 九曲黄河万里沙，浪淘风簸自天涯。如今直上银河去，同到牵牛织女家。 44 渔歌子张志和 西塞山前白鹭飞，桃花流水鳜鱼肥。青箬笠，绿蓑衣，斜风细雨不须归。 45 江雪柳宗元 千山鸟飞绝，万径人踪灭。孤舟蓑笠翁，独钓寒江雪。 46 游园不值叶绍翁 应怜屐齿印苍苔，小扣柴扉久不开。春色满园关不住，一枝红杏出墙来。 47 逢雪宿芙蓉山主人刘长卿 日暮苍山远，天寒白屋贫。柴门闻犬吠，风雪夜归人。 48 竹石郑燮 咬定青山不放松，立根原在破岩中。千磨万击还坚劲，任尔东西南北风。 49 独坐敬亭山李白 众鸟高飞尽，孤云独去闲。相看两不厌，只有敬亭山。 50 枫桥夜泊张继 月落(luo4)乌啼霜满天，江枫渔火对愁眠。姑苏城外寒山寺，夜半钟声到客船。 51 寻隐者不遇贾岛 松下问童子，言师采药去。只在此山中，云深不知处。 52 墨梅王冕 吾家洗砚池头树，个个花开淡墨痕。不要人夸好颜色，只留清气满乾坤。 53 咏柳贺知章 碧玉妆成一树高，万条垂下绿丝绦。不知细叶谁裁出，二月春风似剪刀。 54 清明杜牧 清明时节雨纷纷，路上行人欲断魂。借问酒家何处有，牧童遥指杏花村。 55 寒食韩翃 春城无处不飞花，寒食东风御柳斜。日暮汉宫传蜡烛，轻烟散入五侯家。 56 春日朱熹 胜日寻芳泗水滨，无边光景一时新。等闲识得东风面，万紫千红总是春。 57 宿建德江孟浩然 移舟泊烟渚，日暮客愁新。野旷天低树，江清月近人。 58 饮湖上初晴后雨苏轼 水光潋滟晴方好，山色空濛雨亦奇。欲把西湖比西子，淡妆浓抹总相宜。 59 从军行王昌龄 青海长云暗雪山，孤成遥望玉门关。黄沙百战穿金甲，不破楼兰终不还。 60 凉州词王之涣 黄河远上白云间，一片孤城万仞山。羌笛何须怨杨柳，春风不度玉门关。 61 秋浦歌李白 白发三千丈，缘愁似个长。不知明镜里，何处得秋霜。 62 商山早行温庭筠 晨起动征铎，客行悲故乡。鸡声茅店月，人迹板桥霜。槲叶落(luo4)山路，枳花明驿墙。因思杜陵梦，凫雁满回塘。 63 芙蓉楼送辛渐王昌龄 寒雨连江夜入吴，平明送客楚山孤。洛阳亲友如相问，一片冰心在玉壶。 64 江南逢李龟年杜甫 岐王宅里寻常见，崔九堂前几度闻。正是江南好风景，落(luo4)花时节又逢君。 65 滁州西涧韦应物 独怜幽草涧边生，上有黄鹂深树鸣。春潮带雨晚来急，野渡无人舟自横。 66 乌衣巷刘禹锡 朱雀桥边野草花，乌衣巷口夕阳斜。旧时王谢堂前燕，飞入寻常百姓家。 67 江南春杜牧 千里莺啼绿映红，水村山郭酒旗风。南朝四百八十寺，多少楼台烟雨中。 68 竹枝词刘禹锡 杨柳青青江水平，闻郎江上唱歌声。东边日出西边雨，道是无晴却有晴。 69 秋夕杜牧 银烛秋光冷画屏，轻罗小扇扑流萤。天阶夜色凉如水，坐看牵牛织女星。 70 赠花卿杜甫 锦城丝管日纷纷，半入江风半入云。此曲只应天上有，人间能得几回闻。 71 题临安邸林升 山外青山楼外楼，西湖歌舞几时休。暖风熏得游人醉，直把杭州作汴州。 72 示儿陆游 死去元知万事空，但悲不见九州同。王师北定中原日，家祭无忘告乃翁。 73 朝天子·咏喇叭王磐 喇叭，唢呐，曲儿小，腔儿大。官船往来乱如麻，全仗你抬身价。军听了军愁，民听了民怕，哪里去辨什么真共假?眼见的吹翻了这家，吹伤了那家，只吹的水尽鹅飞罢！ 74 秋夜将晓出篱门迎凉有感陆游 三万里河东入海，五千仞岳上摩天。遗民泪尽胡尘里，南望王师又一年。 75 夏日绝句李清照 生当作人杰，死亦为鬼雄。至今思项羽，不肯过江东。 76 菩萨蛮-书江西造口壁辛弃疾 郁孤台下清江水，中间多少行人泪。西北望长安，可怜无数山。青山遮不住，毕竟东流去。江晚正愁余，山深闻鹧鸪。 77 泊船瓜州王安石 京口瓜洲一水间，钟山只隔数重山。春风又绿江南岸，明月何时照我还？ 78 己亥杂诗龚自珍 九州生气恃风雷，万马齐喑究可哀。我劝天公重抖擞，不拘一格降人才。 79 闻官军收河南河北杜甫 剑外忽传收蓟北，初闻涕泪满衣裳。却看妻子愁何在，漫卷诗书喜欲狂。白日放歌须纵酒，青青作伴好还乡。即从巴峡穿巫峡，便下襄阳向洛阳。 80 春夜喜雨杜甫 好雨知时节，当春乃发生。随风潜入夜，润物细无声。野径云俱黑，江船火独明。晓看红湿处，花重锦官城。","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"Level4 Unit1 Part3","slug":"2018-09-28-level4-unit1-part3","date":"2018-09-27T23:53:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-09-28-level4-unit1-part3.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-09-28-level4-unit1-part3.html","excerpt":"","text":"Level4 Unit1 Part3 ListeningHarry is an American businessman.His job requires him to do a lot of traveling.He takes 9 or 10 trips a year.In the past six months he has made 5 trips.Three were to Asia and two were to Europe.The purpose of these trips is to attend meetings and make presentations.Harry loves to travel, and he’s traveled to many countries.Most of his trips are for one or two weeks.His first international trip was 15 years ago when he was 20 years old.He really wanted to see Asia, so he and a friend flew to Tokyo, Japan.From Tokyo, they traveled around Japan for two weeks.The people they met were very nice, but most of them didn’t speak English.Harry tried to speak a little Japanese, but it was difficult.He didn’t do very well.When he spoke to people, most of them just looked at him.They didn’t understand what he was trying to say.From Japan, they went to Korea for a week, and then they went to China.In China, they visited the Great Wall, near Beijing.They stayed in Beijing for a few days, and then boarded a train for Shanghai.It was an overnight train with sleeping cars. car 车厢During the journey, they enjoyed looking out the window at the countryside.The view from the train was wonderful.Harry will never forget watching the sun go down in the evening.It was a beautiful sunset.The journey to shanghai, took many hours, but it was an unforgettable experience.On the train, they met a chinese professor who spoke English.He was a middle-aged man whose hair was turning grey.He told them about how things were changing in china.It was wonderful to watch him as he was speaking.His eyes were full of energy and excitement.They only stayed in shanghai for a couple of days.Then they returned to the US and went back to school.They had one more year to finish their studies.Harry‘s next few trips were to different parts of the world.He went to Europe twice, each time to different countries.On one trip, he traveled through the UK and France.On the next trip, he went to Italy and Greece.After Europe, he traveled to Mexico and South America.In south America, he went to Argentina and Brazil.He enjoyed watching some great soccer matches.Then he decided to go back to Asia.But this time he went to southeast Asia.He visited Vietnam, Thailand and Singapore.Each country had a charm of its own.After all this travel, Harry decided to make travel part of his career.He didn’t want to work only in the US.He didn’t want to work only with Americans.He wanted to experience other countries and other cultures.His dream was to work for an international company.Five years ago his dream came true.Now he’s working for a German hi-tech company.As part of his job, he has to travel a lot.As a result, he has been to many cities and countries.And he has met many interesting people. Level4 Unit1 Part3 VocabularyA dental cavity is a hole in the tooth.A cavity is caused by bacteria in the mouth.Brushing your teeth frequently and regularly can help prevent cavities.A cracked tooth can be caused by biting down on something hard.Dentists treat a cracked tooth by covering it with a crown.A dental x-ray is a picture of your teeth and gums.An x-ray shows what can’t be seen on the surface of the teeth and gums.Braces are used by dentists to straighten teeth over a period of years.Though braces are usually for children, they can also be used for adults with crooked teeth.To extract a tooth, means to remove it from the mouth.Dentists have to pull hard to extract a tooth.(Dentists often inject something into the gum to block the pain during the extraction process.)The heart pumps blood to all parts of the body through a system of arteries and veins.It’s located in the chest, between the lungs, and beats about once per second.The kidneys remove waste and toxins from the blood.They are bean shaped organs and are about 10 centimeters long and 6 centimeters wide.The lungs exchange oxygen from the air with carbon dioxide from the blood.They expand when inhaling air, and contract when exhaling air.The stomach is below the heart, and it’s part of the digestive system.It uses acids to digest food before passing it to the small intestine.The bladder is a balloon shaped organ that collects urine from the kidneys.In an adult, the bladder can hold about half a liter of urine. Level4 Unit1 Part3 DialogueGood evening, sir.You were driving too fast.Really? was I?Yes, you were going well above the speed limit.I’m sorry, officer.OK, I need to see your driver’s license.Here is my driver’s license.Your license has expired.Are you aware of that?No, sir. that’s a surprise.I didn’t know.It expired more than a year ago.Is this your car?No, sir. It’s a friend’s.I’m borrowing it for the night.Get out of the car and put your hands behind your back.Why, officer? What have I done?Just do as I say.OK, officer. I’m cooperating.Please don’t push me.Get your hands behind your back.OK, OK.I’m not asking you.I’m ordering you.Please. officer.I haven’t done anything wrong.Stay still and don’t say anything.This is a stolen car. are you aware of that?Are you going to arrest me?What do you think?That’s what we do with car thieves.If you let me go, I’ll give you a couple of thousand dollars.I haven’t hurt anybody.So now you are trying to bribe me.How stupid can you be?I just don’t want to go back to jail.Give me a break.Sure. you are a nice guy.I’d like to give you a break.But there is nothing I can do.Please. officer.OK, where is the money?Let me see it and I’ll think about it.","categories":[{"name":"英语","slug":"英语","permalink":"https://blog.ccsyue.com/categories/英语/"}],"tags":[{"name":"英语流利说","slug":"英语流利说","permalink":"https://blog.ccsyue.com/tags/英语流利说/"}]},{"title":"Level4 Unit1 Part1","slug":"懂你英语Level4Unit1Part1","date":"2018-09-23T00:43:43.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2018/懂你英语Level4Unit1Part1.html","link":"","permalink":"https://blog.ccsyue.com/2018/懂你英语Level4Unit1Part1.html","excerpt":"","text":"Level4 Unit1 Part1 ListeningChristina is on a two-week vacation.This is the first vacation she has had for a long time.The last vacation she took was more than two years ago.Now she is visiting a friend in San Francisco.Her friend and her husband are living near the center of the city.He works for a start-up company in Silicon Valley.While he is working, she works part-time at a department store.Christina hasn’t seen her friend for a long time.The last time they saw each other was 3 years ago.At that time, they were both working at a department store.Then Christina quit her job and started her own business.She designs women’s clothing.She has 2 employees now and her company is slowly growing.Christina has come to San Francisco by herself .Her husband didn’t come because he has to work.He tried to start a company 2 years ago but it didn’t work out.His company failed after only a few months.So now he’s working at another company and saving money.Once he saves enough money he plans to start another company.He doesn’t want to give up.This is the second time Christina has been to San Francisco.The first time was when she was a high school student.That was more than 10 years ago.During that trip she was only in San Francisco for a few days.After that she went to Los Angeles and New York.This time she and her friend plan to relax and have fun.Christina arrived two days ago, the day before yesterday.Her friend met her at the airport and drove her to her apartment.Her apartment is just North of the airport about 20 minutes from San Francisco.It’s a small apartment, but it’s on a hill and it has a great view.Yesterday they went downtown and rode the cable cars.Christina was surprised by how steep the hills are.Then they walked along the ocean and ate lunch at a seafood restaurant.From the restaurant, they could see the Golden Gate Bridge.Tomorrow, they’re planning to drive to Yosemite National Park.By car,it’s about 4 hours away.Christina has never been there before, so she is excited.She has heard that the park is very beautiful.Her friend has been to Yosemite several times.She says it’s one of the most beautiful places in the world.Christina just hopes that her friend is a good driver. Level4 Unit1 Part1 VocabularyHeadaches can be very painful and can last for a long time.If you have a headache, your head hurts.A sprained ankle can be so painful that you can’t walk.Someone with a sprained ankle may need to use crutches to walk.If you have a sore throat, it may be painful to swallow.A sore throat can be caused by viruses or bacteria.A burn is an injury to the skin caused by fire or heat.If you get too close to a fire, you will be burned.An earache is a sharp, dull or burning pain in the ear.Common causes of an earache include an infection, a changing air pressure or water in the ear.Mountains are landforms higher than 2 thousand feet or about 600 meters above sea level.Hills are like mountains, but not as tall.Mountains are formed by forces deep within the Earth and are made of many types of rocks.Rivers are streams of water that usually begin at mountains and flow into the sea.Many early cities were built alongside rivers.Most of the world’s water is in the oceans, which are large bodies of salt water.The oceans are also an important source of oxygen.Deserts are areas of land that receive little or no rainfall.The amount of rainfall in some deserts is so low that only a few plants can survive.A valley is a low, relatively flat area between hills or mountains, often with a river running through it.Some valleys are formed by flowing water, and others are formed by glaciers.(Desert temperatures can range from cold at night to very hot during the daytime, often above 120 degrees F.)(The place where a river begins is its source.) Level4 Unit1 Part1 DialogueHave you eaten yet?No, I haven’t, and I’m hungry.Me too, let’s go out for dinner.Where to?What about Jones Italian?How many times have you eaten there?I eat there a lot.It’s one of my favorite places.I went there two weeks ago, and the service was terrible.Really? then, let’s go some places else.What do you suggest?How about the Royal Indian?It’s not far from here.I’ve never heard of it, is it good?Yes, I’ve been there several times, and I’ve never been disappointed.OK, let’s try it.I haven’t eaten Indian food for a long time.You won’t be disappointed, and the prices are reasonable.Ah~, so you mean I’m going to pay?Well, that would certainly be nice.What about reservations?If we get there early enough, we won’t need them.I hope you’re right.Don’t worry.If we have to wait, I’ll pay the bill.","categories":[{"name":"英语","slug":"英语","permalink":"https://blog.ccsyue.com/categories/英语/"}],"tags":[{"name":"英语流利说","slug":"英语流利说","permalink":"https://blog.ccsyue.com/tags/英语流利说/"}]},{"title":"Level4 Unit1 Part2","slug":"2018-09-23-Level4-Unit1-Part2","date":"2018-09-22T20:02:00.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2018/2018-09-23-Level4-Unit1-Part2.html","link":"","permalink":"https://blog.ccsyue.com/2018/2018-09-23-Level4-Unit1-Part2.html","excerpt":"","text":"Level4 Unit1 Part2 ListeningToday, Christina and her friend are enjoying themselves.This morning they got up very early and drove out of San Francisco.They crossed the Bay Bridge before the early morning commute and drove south.Because it was so early, there were almost no cars.After driving for an hour and a half, they stopped and had breakfast.They ordered pancakes and coffee.They also had some fresh fruit.When they finished eating, it was 7 o’clock.Then they got back into the car and drove south.Christina wanted to listen to music, so they turned on the radio.An hour later they stopped for gas.They noticed that there was also a charging station for electric cars.It’s now 1:15 and they are in Yosemite ParkThey have been there for two hours, since 11:15.They are looking at Yosemite falls, which is the highest waterfall in the Park.The water drops a total of 740 meters from the top of the upper fall to the base of the lower fall.In another 15 minutes they planed eat lunch at a magnificent old hotel in the park.It was built in 1927 and has a great view.They wanted to stay there, but they couldn’t get reservations.To get a room at that hotel, you usually need to make reservations several months in advance.They plan to stay in the park until around 4 o’clock .By then they will have been in the park for nearly 5 hours.Then they’ll get back into the car and drive back to San Francisco.They plan to eat dinner somewhere along the way.If the traffic isn’t too bad ,they should be back in San Francisco by 10 o’clock.Early tomorrow morning they are going to cross the Golden Gate Bridge and go north along the coast.From some places you can look out on the ocean and see whales and other sea life.Christina has never seen a whale before, so she’s looking forward to it.And tomorrow night they have something special planned.They are going to watch a baseball game.Christina has never seen a baseball game, but she has heard that it is very popular in the US.And the San Francisco baseball team is one of the best. Level4 Unit1 Part2 VocabularyA force is a push or a pull on an object.A force changes the motion of a moving object.A force can be strong or weak and it always has a direction.The earth is a planet that goes around the sun in a circular orbit.The speed of its motion doesn’t change, but the direction of its motion does.The earth has a layer of gas above its surface, which helps to support life.Atoms are the building blocks of matter.At the center of an atom is its nucleus, which has a positive electric charge.Outside the nucleus are electrons, which have a negative charge.Asteroids and comets, are objects that orbit our sun, but are smaller than planets.Asteroids that pass close to the Earth are called near-earth objects.The layer of gases just above Earth’s surface is our atmosphere.The atmosphere is made up of gases, such as oxygen and nitrogen.Without an atmosphere, there would be no life on Earth.(A force can increase or decrease the speed of an object, and it can change the direction of motion)(If they collide with Earth they could cause an extinction event).The two lines on the left intersect each other at a right angle, which is 90 degrees.The two lines on the right are parallel, which means they never cross.The adjacent sides of a rectangle are perpendicular, which means they meet at a 90 degree angle.The opposite sides of a rectangle are equal and parallel, which means they never cross.The area of a rectangle is the length times the width.A circle is a two dimensional figure with a radius and circumference, which is the distance around the circle.The area of a circle is PI R squared, well(where), R is the radius and PI is the ratio of a circle’s circumference to its diameter.A sphere is a three dimensional figure with a radius and a volume, which is 4/3 PI R cubed.All points on the surface of a sphere are equidistant from its center.A right triangle is a two dimensional figure with 3 sides, two of which are perpendicular.To find its area, multiply the length of the two perpendicular sides, A &amp; B, and divided by two, A equals one half A B.(A rectangle is a two dimensional figure with 4 sides)(Pi is the ratio of a circle’s circumference to its diameter.)(The electric force between the nucleus and the electrons holds the atom together.) Level4 Unit1 Part2 DialogueHave you finished eating yet?No,I haven’t.Why are you in such a hurry?I’m sorry, but you are such a slow eater.A slow eater?Well,I try to enjoy my food.You just eat and swallow.I don’t see how you can even taste it!Ok, I’m sorry.Do you mind if I get another glass of wine?No, go ahead.I don’t want you to sit there putting pressure on me.I thought we were going to have a relaxing evening.Yes, you are right.I’d like to relax, but I have a lot on my mind.Work related?Yes, it is.I’ve been getting some strange emails from my boss.He wants me to cut down on my expenses.Maybe he wants to fire me.Is business bad?Yes, it is. but I don’t want to talk about it.OK, but I’m a good listener.You can tell me if you’d like to.Thanks,maybe some other time.I’ll try to stop thinking about it and deal with it tomorrow.Good idea.You need to take a break from work.Your health is important, and so am I.Yes you are.I don’t know what I would do without you.","categories":[{"name":"英语","slug":"英语","permalink":"https://blog.ccsyue.com/categories/英语/"}],"tags":[{"name":"英语流利说","slug":"英语流利说","permalink":"https://blog.ccsyue.com/tags/英语流利说/"}]},{"title":"鑫鑫周末作业","slug":"鑫鑫周末作业","date":"2018-09-22T13:31:46.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2018/鑫鑫周末作业.html","link":"","permalink":"https://blog.ccsyue.com/2018/鑫鑫周末作业.html","excerpt":"","text":"数学作业 语文作业练习册13页至24页。写字书写到6页完，家长检查","categories":[{"name":"学习","slug":"学习","permalink":"https://blog.ccsyue.com/categories/学习/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"十九大精神应知应会","slug":"十九大精神应知应会","date":"2018-09-21T13:25:10.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2018/十九大精神应知应会.html","link":"","permalink":"https://blog.ccsyue.com/2018/十九大精神应知应会.html","excerpt":"","text":"摘自：《中国共产党第十九次全国代表大会的工作报告》、《中国共产党章程》和《十八届中央纪律检查委员会向中国共产党第十九次全国代表大会的工作报告》等 十九大报告的题目是：(决胜全面建成小康社会夺取新时代中国特色社会主义伟大胜利)。 大会的主题是：（不忘初心，牢记使命，高举中国特色社会主义伟大旗帜，决胜全面建成小康社会，夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。） 十九大召开时间：（10月18日至10月24日）。 十九大报告明确，中国特色社会主义最本质的特征是（中国共产党领导），国特色社会主义制度的最大优势是（中国共产党领导），党是（最高政治领导力量）。 十九大报告提出一个新目标，即“在本世纪中叶建成（富强民主文明和谐美丽）社会主义现代化强国”。 十九大报告指出，我国经济已由高速增长阶段转向（高质量、建设现代化经济体系）发展阶段，正处在转变发展方式、优化经济结构、转换增长动力的攻关期，是跨越关口的迫切要求和我国发展的战略目标。 十九大报告指出，力争到（2035）年基本实现国防和军队现代化，到本世纪中叶把人民军队全面建成世界一流军队。 十九大报告指出，要组建（退役军人管理保障）机构，维护军人军属合法权益，让军人成为全社会尊崇的职业。 十九大报告指出，军队将开展（“传承红色基因、担当强军重任”）主题教育。 十九大报告指出，坚持房子是（用来住的、不是用来炒）的定位，加快建立多主体供给、多渠道保障、租购并举的住房制度，让全体人民住有所居。 十九大报告指出，必须树立和践行(绿水青山就是金山银山)的理念，坚持节约资源和保护环境的基本国策，像对待生命一样对待生态环境。 十九大报告指出，必须全面贯彻党领导人民军队的一系列根本原则和制度，确立（新时代党的强军思想）在国防和军队建设中的指导地位。 十九大报告指出，必须把维护中央对香港、澳门特别行政区（全面管治权）和保障特别行政区（高度自治权）有机结合起来，确保”一国两制方针不会变、不动摇，确保“一国两制”实践不变形、不走样。 十九大报告指出，培养造就一支（懂农业、爱农村、爱农民）的“三农”工作队伍。 十九大报告强调，全面实施（市场准入负面清单）制度，清理废除妨碍统一市场和公平竞争的各种规定和做法，支持民营企业发展，激发各类市场主体活动。 十九大报告指出，要以（“一带一路”）建设为重点，坚持引进来和走出去并重，遵循共商共建共享原则，加强创新能力开放合作，形成陆海内外联动、东西双向互济的开放格局。 十九大报告指出，成立（中央全面依法治国领导小组），加强对法治中国建设的统一领导。 十九大报告指出，在省市县对职能相近的（党政机关）探索合并设立或合署办公。 十九大报告指出，要以培养（担当民族复兴大任）的时代新人为着眼点，强化教育引导、实践养成、制度保障，发挥社会主义核心价值观对国民教育、精神文明创建、精神文化产品创作生产传播的引领作用，把社会主义核心价值观融入社会发展各方面，转化为人们的情感认同和行为习惯。 十九大报告强调，全党必须牢记，（为什么人的问题），是检验一个政党、一个政权性质的试金石。 十九大报告强调，必须始终把（人民利益）摆在至高无上的地位，让改革发展成果更多更公平惠及全体人民，朝着实现全体人民共同富裕不断迈进。 十九大报告指出，（就业）是最大的民生。 十九大报告指出，重点攻克深度贫困地区脱贫任务，确保到（二零二零年）我国现行标准下农村贫困人口实现脱贫，贫困县全部摘帽，解决区域性整体贫困，做到脱真贫、真脱贫。 十九大报告指出，构建国土空间开发保护制度，完善主体功能区配套政策，建立以（国家公园）为主体的自然保护地体系。 十九大报告指出，同国家现代化进程相一致，全面推进军事理论现代化、军队组织形态现代化、军事人员现代化、武器装备现代化，力争到（二零三五年）年基本实现国防和军队现代化，到本世纪中叶把人民军队全面建成世界一流军队。 十九大报告指出，组建（退役军人管理保障机构），维护军人军属合法权益，让军人成为全社会尊崇的职业。 十九大报告指出，世界正处于大发展大变革大调整时期，（和平与发展）仍然是时代主题。 十九大报告呼吁，全国人民同心协力，构建（人类命运共同体），建设持久和平、普遍安全、共同繁荣、开放包容、清洁美丽的世界。 十九大报告强调，我们党面临的执政环境是复杂的，影响党的先进性、弱化党的纯洁性的因素也是复杂的，党内存在的（思想不纯、组织不纯、作风不纯）突出问题尚未得到根本解决。 十九大报告指出，自觉抵制（商品交换原则）对党内生活的侵蚀，营造风清气正的良好政治生态。 十九大报告指出，以县处级以上领导干部为重点，在全党开展（“不忘初心，牢记使命”）主题教育。 十九大报告指出，赋予有干部管理权限的党组相应（纪律处分权限），强化监督执纪问责。 十九大报告指出，在市县党委建立（巡察制度），加大整治群众身边腐败问题力度。 十九大报告指出，制定国家监察法，依法赋予监察委员会职责权限和调查手段，用（留置）取代“两规”措施。 十九大报告指出，深化国家监察体制改革，将试点工作在全国推开，组建国家、省、市、县（监察委员会），同党的纪律检查机关合署办公，实现对所有形式公权力的公职人员监察全覆盖。 十九大报告指出，改革（全面发力、多点突破、纵深推进），着力增强改革系统性、整体性、协同性。压茬拓展改革广度和深度，推出（一千五百）多项改革举措。 十九大报告指出，过去（五年），公共文化服务水平不断提高，文艺创作持续繁荣，文化事业和文化产业篷勃发展，互联网建设管理运用不断完善，全民健身和竞技体育全面发展。 十九大报告指出，提拔重用牢固树立（四个意识和四个自信）坚决维护党中央权威、全面贯彻执行党的理论和路线方针政策、忠诚干净担当的干部。 十九大报告指出，要建设（知识型、技能型、创新型）劳动者大军，弘扬劳模精神和工匠精神，营造劳动光荣的社会风尚和精益求精的敬业风气。 十九大报告指出，要倡导（创新文化），强化知识产权创造、保护、运用。 习近平同志在十九大报告中指出，经过长期努力，中国特色社会主义进入了（新时代），这是我国发展新的历史方位。 中国共产党第十九次全国代表大会，是在（全面建成小康社会决胜阶段、中国特色社会主义进入新时代。）的关键时期召开的一次十分重要的大会。 依法治国是党领导人民治理国家的（基本方式）。 （党的政治建设）是党的根本性建设，决定党的建设方向和效果。 建设强大的现代化陆军、海军、空军、火箭军和战略支援部队，打造坚强高效的（战区联合作战）指挥机构。 实施共建（”一带一路”倡议），发起创办亚洲基础设施投资银行，设立丝路基金，举办首届“一带一路”国际合作高峰论谈、亚太经合组织领导人非正式会议、二十国集团领导人杭州峰会、金砖国家领导人厦门会晤、亚信峰会。 坚持照镜子、正衣冠、洗洗澡、治治病的要求，开展群众路线教育实践活动和“三严三实”专题教育，推动：（“两学一做学习教育常态化制度化），全党理想信念更加坚定、党性更加坚强。 中国共产党始终把为（人类做出新的更大的贡献）作为自己的使命。 我们党深刻认识到，实现中华民族伟大复兴，必须建立（符合我国实际的先进社会制度）。 全党同志特别是高级干部要加强党性锻炼，不断提高政治觉悟和政治能力，把（对党忠诚、为党分忧、为党尽职、为民作福）作为根本政治担当，永葆共产党人政治本色。 （发展）是解决我国一切问题的基础和关键，发展必须是（科学发展），必须坚定不移贯彻创新、协调、绿色、开放、共享的发展理念。 从（十九大到二十大），是“两个一百年”奋斗目标的历史交汇期。 我国是工人阶级领导的、以工农联盟为基础的人民民主专政的社会主义国家，国家的一切权利属于（人民）。 我们党坚持以马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观为指导，坚持解放思想、实事求是、与时俱进、求真务实，坚持辩证唯物主义和历史唯物主义，紧密结合新的时代条件和实践要求，以全新的视野深化对共产党执政规律、社会主义建设规律、人类社会发展规律的认识，进行艰辛理论探索，取得重大理论创新成果，形成了（新时代中国特色社会主义思想）。 中国共产党人的初心和使命是（为中国人民谋幸福，为中华民族谋复兴）。 （农业农村农民）问题是关系国计民生的根本性问题，必须始终把解决好“三农”问题作为全党工作重中之重。 （党的领导）是人民当家作主和依法治国的根本保证，人民当家作主是社会主义民主政治的本质特征，依法治国是党领导人民治理国家的基本方式，三者统一于我国社会主义民主政治伟大实践。 五年来，我国经济保持中高速增长，在世界主要国家中名列前茅，国内生产总值从五十四万亿元增长到八十万亿元，稳居世界（第二），对世界经济增长贡献率超过百分之三十。 五年来，我国城镇化率年均提高一点二个百分点，(八千多万)农业转移人口成为城镇居民。 (中国特色社会主义)是改革开放以来党的全部理论和实践的主题，是党和人民历尽千辛万苦、付出巨大代价取得的根本成就。 新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义，总任务是(实现社会主义现代化和中华民族伟大复兴)。 十四条新时代坚持和发展中国特色社会主义的基本方略的第一条是(坚持党对一切工作的领导)。 从全面建成小康社会到基本实现现代化，再到（全面建成社会主义现代化强国），是新时代中国特色社会主义发展的战略安排。 要坚持（农业农村优先）发展，按照产业兴旺、生态宜居、乡风文明、治理有效生活富裕的总要求，建立健全城乡融合发展体制机制和政策体系加快推进农业农村现代化。 （人民代表大会制度）是坚持党的颔导、人民当家作主、依法治国有机统一的根本政治制度安排，必须长期坚持、不断完善。 （社会主义核心价值观）是当代中国精神的集中体现，凝结正全体人民共同价值追求。 社会主义文艺是人民的文艺，必须坚持（以人民为中心）的创作导向，在深入生活、扎根人民中进行无愧于时代的文艺创造。 坚持（行贿受贿）一起查，坚决防止党内形成利益集团。 （一个中国原则）是两岸关系的政治基础。 深化司法体制综合配套改革，全面落实（司法责任制），努力让人民群众在每一个司法案件中感受到公平正义。 （文化自信）是一个国家、一个民族发展中更基本、更深沉、更持久的力量。 加强（社会心理服务）体系建设，培育自尊自信、理性平和、积极向上的社会心态。 鼓励勤劳守法致富，扩大中等收入群体，增加（低收入者）收入，调节过高收入，取缔非法收入。 中国积极发展全球伙伴关系，扩大同各国的利益交汇点，推进大国协调和合作，构建总体稳定、（均衡发展）的大国关系框架。 健全学生资助制度，使绝大多数城乡新增劳动力接受（高中阶段）教育、更多接受高等教育。 坚持富国和强军相统一，强化统一领导、顶层设计、改革创新和重大项目落实，深化国防科技工业改革，形成军民融合深度发展格局，构建（一体化）的国家战略体系和能力。 构建（政府为主导）、企业为主体、社会组织和公众共同参与的环境治理体系。 扩大党内基层民主，推进（党务公开），畅通党员参与党内事务、监督党的组织和干部、向上级党组织提出意见和建议的渠道。 世界面临的不稳定性不确定性突出，世界经济增长动能不足，贫富分化日益严重，地区热点问题此起彼伏，（恐怖主义）、网络安全、重大传染性疾病、气候变化等非传统安全威胁持续蔓延，人类面临许多共同挑战。 构建（市场导向）的绿色技术创新体系，发展绿色金融，壮大节能环保产业、清洁生产产业、清洁能源产业。 坚持（“三会一课”）制度，推进党的基层组织设置和活动方式创新，加强基层党组织带头人队伍建设，扩大基层党组织覆盖面，着力解决一些基层党组织弱化、虚化、边缘化问题。 我国经济已由高速增长阶段转向（高质量）发展阶段，正处在转变发展方式、优化经济结构、转换增长动力的攻关期。 勇于（自我革命），从严管党治党，是我们党最鲜明的品格。 以（城市群）为主体构建大中小城市和小城镇协调发展的城镇格局，加快农业转移人口市民化。 农业农村农民问题是关系国计民生的（根本性）问题，必须始终把解决好“三农”问题作为全党工作重中之重。 世界多极化、（经济全球化）、社会信息化、文化多样化深入发展，全球治理体系和国际秩序变革加速推进，各国相互联系和依存日益加深，国际力量对比更趋平衡，和平发展大势不可逆转。 从现在到二零二零年，是全面建成小康社会（决胜期）。 我们坚持爱国者为主体的“港人治港”、“澳人治澳”，发展壮大爱国爱港爱澳力量，增强香港、澳门同胞的（国家意识）和爱国精神，让香港、澳门同胞同祖国人民共担民族复兴的历史责任、共享祖国繁荣富强的伟大荣光。 统筹（发展和安全），增强忧患意识，做到居安思危，是我们党治国理政的一个重大原则。 要全面贯彻党的教育方针，落实立德树人根本任务，发展（素质教育），推进教育公平，培养德智体美全面发展的社会主义建设者和接班人。 伟大斗争，伟大工程，伟大事业，伟大梦想，紧密联系、相互贯通、相互作用，其中起决定性作用的是（党的建设新的伟大工程）。 （党支部）要担负好直接教育党员、管理党员、监督党员和组织群众、宣传群众、凝聚群众、服务群众的职责，引导广大党员发挥先锋模范作用。 推动全党尊崇（党章），增强政治意识、大局意识、核心意识、看齐意识，坚决维护党中央权威和集中统一领导，严明党的政治纪律和政治规矩，层层落实管党治党政治责任。 坚定不移走中国特色社会主义法治道路，完善以（宪法）为核心的中国特色社会主义法律体系。 中国特色社会主义事业总体布局是（“五位一体”）。 坚持（预防）为主，深入开展爱国卫生运动，倡导健康文明生活方式，预防控制重大疾病。 必须推进马克思主义中国化时代化大众化，建设具有强大凝聚力和引领力的社会主义意识形态，使全体人民在（理想信念）、价值理念、道德观念上紧紧团结在一起。 我们秉持（“两岸一家亲”）理念，尊重台湾现有的社会制度和台湾同胞生活方式，愿意率先同台湾同胞分享大陆发展的机遇。 保持土地承包关系稳定并长久不变，第二轮土地承包到期后再延长（三十）年。 加强（国家安全）教育，增强全党全国人民国家安全意识，推动全社会形成维护国家安全的强大合力。 坚持引进来和走出去并重，遵循（共商共建共享）原则，加强创新能力开放合作，形成陆海内外联动、东西双向互济的开放格局。 （中国特色社会主义）是改革开放以来党的全部理论和实践的主题，是党和人民历尽千辛万苦、付出巨大代价取得的根本成就。 必须以党章为根本遵循，把党的政治建设摆在首位，思想建党和（制度治党）同向发力，统筹推进党的各项建设。 办好继续教育，加快建设（学习型）社会，大力提高国民素质。 完善促进（消费）的体制机制，增强消费对经济发展的基础性作用。 （人才）是实现民族振兴、赢得国际竞争主动的战略资源。 （建设生态文明）是中华民族永续发展的千年大计。 深刻认识党面临的精神懈怠危险、能力不足危险、脱离群众危险、消极腐败危险的尖锐性和严峻性，坚持（问题导向），保持战略定力，推动全面从严治党向纵深发展。 全面（依法治国）是国家治理的一场深刻革命，必须坚持厉行法治，推进科学立法、严格执法、公正司法、全民守法。 中国坚持对外开放的基本国策，坚持打开国门搞建设，积极促进（“一带一路”国际合作），努力实现政策沟通、设施联通、贸易畅通、资金融通、民心相通，打造国际合作新平台，增添共同发展新动力。 建设（现代化）经济体系是跨越关口的迫切要求和我国发展的战略目标。 新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义，总任务是实现社会主义现代化和（中华民族伟大复兴）。 建设一支（听党指挥）、能打胜仗、作风优良的人民军队，是实现“两个一百年”奋斗目标、实现中华民族伟大复兴的战略支撑。 新时代我国社会主要矛盾是（人民日益增长的美好生活需要和不平衡不充分的发展之间的矛盾）。 解决台湾问题、实现祖国完全统一，是全体中华儿女共同愿望，是中华民族（根本利益）所在。 旗帜鲜明（讲政治）是我们党作为马克思主义政党的根本要求。 完善政府、（工会）、企业共同参与的协商协调机制，构建和谐劳动关系。 确保到（二〇二〇年）我国现行标准下农村贫困人口实现脱贫，贫困县全部摘帽，解决区域性整体贫困，做到脱真贫、真脱贫。 大规模开展（职业技能）培训，注重解决结构性就业矛盾，鼓励创业带动就业。 深化医药卫生体制改革，全面建立中国特色基本医疗卫生制度、（医疗保障）制度和优质高效的医疗卫生服务体系，健全现代医院管理制度。 加强社区治理体系建设，推动社会治理重心向基层下移，发挥（社会组织）作用，实现政府治理和社会调节、居民自治良性互动。 要相互尊重、平等协商，坚决摒弃冷战思维和强权政治，走对话而不对抗、（结伴而不结盟）的国与国交往新路。 中国特色社会主义进入新时代，意味着中国特色社会主义（道路、理论、制度、文化）不断发展,拓展了发展中国家走向现代化的途径，给世界上那些既希望加快发展又希望保持自身独立性的国家和民族提供了全新选择，为解决人类问题贡献了中国智慧和中国方案。 积极应对人口老龄化，构建养老、孝老、敬老政策体系和社会环境，推进（医养）结合，加快老龄事业和产业发展。 完成（生态保护红线）、永久基本农田、城镇开发边界三条控制线划定工作。 必须统筹国内国际两个大局，始终不渝走和平发展道路、奉行互利共赢的开放战略，坚持正确（义利观），树立共同、综合、合作、可持续的新安全观。 发展是解决我国一切问题的基础和关键，发展必须是（科学发展），必须坚定不移贯彻创新、协调、绿色、开放、共享的发展理念。 从十九大到二十大，是“两个一百年”奋斗目标的（历史交汇期）。 广泛开展理想信念教育，深化中国特色社会主义和中国梦宣传教育，弘扬民族精神和时代精神，加强爱国主义、集体主义、（社会主义）教育，引导人们树立正确的历史观、民族观、国家观、文化观。 建设教育强国是中华民族伟大复兴的基础工程，必须把（教育事业）放在优先位置，加快教育现代化，办好人民满意的教育。 把提高（供给体系）质量作为主攻方向，显著增强我国经济质量优势。 脱贫攻坚战取得决定性进展，（六千多万）贫困人口稳定脱贫，贫困发生率从百分之十点二下降到百分之四以下。 经济体制改革必须以完善（产权制度）和要素市场化配置为重点，实现产权有效激励、要素自由流动、价格反应灵活、竞争公平有序、企业优胜劣汰。 （“一国两制”）是解决历史遗留的香港、澳门问题的最佳方案，也是香港、澳门回归后保持长期繁荣稳定的最佳制度。 发展社会主义（民主政治）就是要体现人民意志、保障人民权益、激发人民创造活力，用制度体系保证人民当家作主。 把纪律挺在前面，着力解决（人民群众）反映最强烈、对党的执政基础威胁最大的突出问题。 深化（国有企业）改革，发展混合所有制经济，培育具有全球竞争力的世界一流企业。 党要团结带领人民进行伟大斗争、推进伟大事业、实现伟大梦想，必须毫不动摇坚持和完善（党的领导），毫不动摇把党建设得更加坚强有力。 必须把维护中央对香港、澳门特别行政区（全面管治权）和保障特别行政区高度自治权有机结合起来，确保“一国两制”方针不会变、不动摇，确保“一国两制”实践不变形、不走样。 要尊重（世界文明多样性），以文明交流超越文明隔阂、文明互鉴超越文明冲突、文明共存超越文明优越。 坚持大扶贫格局，注重扶贫同扶志、扶智相结合，深入实施东西部扶贫协作，重点攻克（深度贫困地区）脱贫任务。 要深化文化体制改革，完善文化管理体制，加快构建把（社会效益）放在首位、社会效益和经济效益相统一的体制机制。 只有社会主义才能救中国，只有（改革开放）才能发展中国、发展社会主义、发展马克思主义。 坚持和加强党的全面领导，坚持党要管党、全面从严治党，以加强党的长期执政能力建设、先进性和纯洁性建设为主线，以党的（政治建设）为统领，以坚定理想信念宗旨为根基，以调动全党积极性、主动性、创造性为着力点。 以疏解北京（非首都功能）为“牛鼻子”推动京津冀协同发展，高起点规划、高标准建设雄安新区。 实现“两个一百年”奋斗目标、实现中华民族伟大复兴的中国梦，不断提高人民生活水平，必须坚定不移把（发展）作为党执政兴国的第一要务。 建设现代化经济体系，必须把发展经济的着力点放在（实体经济）上。 树立（科技）是核心战斗力的思想，推进重大技术创新、自主创新，加强军事人才培养体系建设，建设创新型人民军队。 全党要牢牢把握社会主义初级阶段这个基本国情，牢牢立足社会主义初级阶段这个最大实际，牢牢坚持（党的基本路线）这个党和国家的生命线、人民的幸福线。 坚持（全民共治）、源头防治，持续实施大气污染防治行动，打赢蓝天保卫战。 坚持正确选人用人导向，匡正选人用人风气，突出（政治标准），提拔重用牢固树立“四个意识”和“四个自信”、坚决维护党中央权威、全面贯彻执行党的理论和路线方针政策、忠诚干净担当的干部。 完善社会救助、社会福利、慈善事业、优抚安置等制度，健全（农村留守儿童）和妇女、老年人关爱服务体系。 区域发展协调性增强，“一带一路”建设、京津冀协同发展、（长江经济带）发展成效显著。 （增进民生福祉）是发展的根本目的。 要以提升（组织力）为重点，突出政治功能，把企业、农村、机关、学校、科研院所、街道社区、社会组织等基层党组织建设成为宣传党的主张、贯彻党的决定、领导基层治理、团结动员群众、推动改革发展的坚强战斗堡垒。 国防和军队改革取得历史性突破，形成军委管总、战区主战、（军种主建）新格局，人民军队组织架构和力量体系实现革命性重塑。 深入贯彻（以人民为中心）的发展思想，一大批惠民举措落地实施，人民获得感显著增强。 中国特色社会主义最本质的特征是（中国共产党领导）。 中国共产党一经成立，就把（实现共产主义）作为党的最高理想和最终目标。 构建国土空间开发保护制度，完善主体功能区配套政策，建立以（国家公园）为主体的自然保护地体系。 发展积极健康的党内政治文化，全面（净化党内政治生态），坚决纠正各种不正之风，以零容忍态度惩治腐败。 弘扬马克思主义学风，推进“两学一做”学习教育常态化制度化，以县处级以上领导干部为重点，在全党开展“不忘初心、牢记使命”主题教育，用党的（创新理论）武装头脑，推动全党更加自觉地为实现新时代党的历史使命不懈奋斗。 中国坚定奉行（独立自主）的和平外交政策，尊重各国人民自主选择发展道路的权利，维护国际公平正义，反对把自己的意志强加于人，反对干涉别国内政，反对以强凌弱。 必须坚持人民主体地位，坚持立党为公、执政为民，践行全心全意为人民服务的根本宗旨，把党的群众路线贯彻到治国理政全部活动之中，把人民对（美好生活的向往）作为奋斗目标，依靠人民创造历史伟业。 深化投融资体制改革，发挥（投资）对优化供给结构的关键性作用。 （思想建设）是党的基础性建设。 不敢腐的目标初步实现，不能腐的笼子越扎越牢，不想腐的堤坝正在构筑，反腐败斗争（压倒性态势）已经形成并巩固发展。 中国共产党第十九次全国代表大会，是在全面建成小康社会决胜阶段、中国特色社会主义进入（新时代）的关键时期召开的一次十分重要的大会。 十九大的主题是：不忘初心，（牢记使命），高举中国特色社会主义伟大旗帜，决胜全面建成小康社会，夺取新时代中国特色社会主义伟大胜利，为实现中华民族伟大复兴的中国梦不懈奋斗。 中国共产党人的初心和使命，就是为中国人民（谋幸福），为中华民族（谋复兴）。这个初心和使命是激励中国共产党人不断前进的根本动力。 五年来，我们统筹推进（“五位一体”）总体布局、协调推进（“四个全面”）战略布局，“十二五”规划胜利完成，“十三五”规划顺利实施，党和国家事业全面开创新局面。 过去五年，经济保持中高速增长，在世界主要国家中名列前茅，国内生产总值从五十四万亿元增长到（八十）万亿元，稳居世界第二，对世界经济增长贡献率超过百分之三十。 实施共建“一带一路”倡议，发起创办亚洲基础设施投资银行，设立丝路基金，举办首届“一带一路”国际合作高峰论坛、亚太经合组织领导人非正式会议、二十国集团领导人（杭州）峰会、金砖国家领导人（厦门）会晤、亚信峰会。 坚持反腐败无禁区、全覆盖、零容忍，坚定不移“打虎”、“拍蝇”、“猎狐”，（不敢腐）的目标初步实现，（不能腐）的笼子越扎越牢，（不想腐）的堤坝正在构筑，反腐败斗争压倒性态势已经形成并巩固发展。 经过长期努力，中国特色社会主义进入了新时代，这是我国发展新的（历史方位）。 必须认识到，我国社会主要矛盾的变化，没有改变我们对我国社会主义所处历史阶段的判断，我国仍处于并将长期处于（社会主义初级阶段)的基本国情没有变，我国是世界最大发展中国家的国际地位没有变。 （中国特色社会主义道路）是实现社会主义现代化、创造人民美好生活的必由之路。 （中国特色社会主义理论体系）是指导党和人民实现中华民族伟大复兴的正确理论。 （中国特色社会主义制度）是当代中国发展进步的根本制度保障。 （中国特色社会主义文化）是激励全党全国各族人民奋勇前进的强大精神力量。 新时代中国特色社会主义思想，明确坚持和发展中国特色社会主义，总任务是实现社会主义现代化和中华民族伟大复兴，在全面建成小康社会的基础上，分(两步走)在本世纪中叶建成富强民主文明和谐美丽的社会主义现代化强国。 发展是解决我国一切问题的基础和关键，发展必须是科学发展，必须坚定不移贯彻(创新、协调、绿色、开放、共享)的发展理念。 (全面依法治国)是中国特色社会主义的本质要求和重要保障。 必须统筹国内国际两个大局，始终不渝走和平发展道路、奉行(互利共赢)的开放战略。 从(十九大)到(二十大)，是“两个一百年”奋斗目标的历史交汇期。 综合分析国际国内形势和我国发展条件，从二〇二〇年到本世纪中叶可以分两个阶段来安排。第一个阶段，从(二〇二〇年)到(二〇三五年)，在全面建成小康社会的基础上，再奋斗十五年，基本实现社会主义现代化。 综合分析国际国内形势和我国发展条件，从二〇二〇年到本世纪中叶可以分两个阶段来安排。第二个阶段，从(二〇三五年)到(本世纪中叶)，在基本实现现代化的基础上，再奋斗十五年，把我国建成富强民主文明和谐美丽的社会主义现代化强国。 贯彻新发展理念，建设现代化经济体系，必须坚持质量第一、效益优先，以(供给侧结构性改革)为主线。 推动形成全面开放新格局。要以(“一带一路”)建设为重点，坚持引进来和走出去并重，遵循共商共建共享原则，加强创新能力开放合作，形成陆海内外联动、东西双向互济的开放格局。 赋予自由贸易试验区更大改革自主权，探索建设(自由贸易港)。 加强人民当家作主制度保障。(人民代表大会制度)是坚持党的领导、人民当家作主、依法治国有机统一的根本政治制度安排。 发挥社会主义协商民主重要作用。(人民政协)是具有中国特色的制度安排，是社会主义协商民主的重要渠道和专门协商机构。 深化依法治国实践。成立中央全面(依法治国)领导小组，加强对法治中国建设的统一领导。 深化机构和行政体制改革。转变政府职能，深化简政放权，创新监管方式，增强政府公信力和执行力，建设人民满意的(服务型)政府。 全党必须牢记，(为什么人)的问题，是检验一个政党、一个政权性质的试金石。 建设(教育强国)是中华民族伟大复兴的基础工程。 国家安全是安邦定国的重要基石，(维护国家安全)是全国各族人民根本利益所在。 我们要建设的现代化是人与自然(和谐共生)的现代化。 加快建立绿色生产和消费的法律制度和政策导向，建立健全(绿色低碳循环发展)的经济体系。 加强对生态文明建设的总体设计和组织领导，设立(国有自然资源资产管理和自然生态监管)机构。 我们要牢固树立社会主义生态文明观，推动形成(人与自然和谐发展)现代化建设新格局，为保护生态环境作出我们这代人的努力！ 适应世界新军事革命发展趋势和国家安全需求，提高建设质量和效益，确保到二〇二〇年基本实现(机械化)，(信息化)建设取得重大进展，(战略能力)有大的提升。 力争到二〇三五年(基本实现)国防和军队现代化，到本世纪中叶把人民军队(全面建成)世界一流军队。 军队是要准备打仗的，一切工作都必须坚持(战斗力)标准，向能打仗、打胜仗聚焦。 (一个中国原则)是两岸关系的政治基础。 我们呼吁，各国人民同心协力，构建人类命运共同体，建设(持久和平、普遍安全、共同繁荣、开放包容、清洁美丽)的世界。 深刻认识党面临的(精神懈怠危险、能力不足危险、脱离群众危险、消极腐败危险)的尖锐性和严峻性，坚持问题导向，保持战略定力，推动全面从严治党向纵深发展。 要尊崇党章，严格执行新形势下党内政治生活若干准则，增强党内政治生活的(政治性、时代性、原则性、战斗性)。 坚决防止和反对(个人主义、享乐主义、自由主义、本位主义、好人主义)，坚决防止和反对宗派主义、圈子文化、码头文化，坚决反对搞两面派、做两面人。 (共产主义远大理想)和(中国特色社会主义共同理想)，是中国共产党人的精神支柱和政治灵魂，也是保持党的团结统一的思想基础。 要坚持党管干部原则，(坚持德才兼备、以德为先，坚持五湖四海、任人唯贤，坚持事业为上、公道正派)，把好干部标准落到实处。 要坚持无禁区、全覆盖、零容忍，坚持(重遏制、强高压、长震慑)，坚持受贿行贿一起查，坚决防止党内形成利益集团。 增强党自我净化能力，根本靠强化(党的自我监督)和(群众监督)。 推进(反腐败国家立法)，建设覆盖纪检监察系统的检举举报平台。强化不敢腐的震慑，扎牢不能腐的笼子，增强不想腐的自觉，通过不懈努力换来海晏河清、朗朗乾坤。 全党同志一定要永远与人民(同呼吸)、(共命运)、(心连心)，永远把人民对美好生活的向往作为奋斗目标，以永不懈怠的精神状态和一往无前的奋斗姿态，继续朝着实现中华民族伟大复兴的宏伟目标奋勇前进。 过去五年，开放型经济新体制逐步健全，(对外贸易)、(对外投资)、(外汇储备)稳居世界前列。 科学立法、严格执法、公正司法、全民守法深入推进，(法治国家)、(法治政府)、(法治社会)建设相互促进，中国特色社会主义法治体系日益完善，全社会法治观念明显增强。 引导应对气候变化国际合作，成为全球生态文明建设的重要(参与者)、（贡献者）、（引领者）。 出台中央八项规定，严厉整治（形式主义）、（官僚主义）、（享乐主义）和（奢靡之风），坚决反对特权。 五年来，我们勇于面对党面临的重大风险考验和党内存在的突出问题，以顽强意志品质正风肃纪、反腐惩恶，消除了党和国家内部存在的严重隐患，党内政治生活气象更新，党内政治生态明显好转，党的（创造力、凝聚力、战斗力）显著增强。 这个新时代，是（承前启后、继往开来、在新的历史条件下继续夺取中国特色社会主义伟大胜利的时代、决胜全面建成小康社会、进而全面建设社会主义现代化强国的时代、全国各族人民团结奋斗、不断创造美好生活、逐步实现全体人民共同富裕的时代、全体中华儿女勠力同心、奋力实现中华民族伟大复兴中国梦的时代、我国日益走近世界舞台中央、不断为人类作出更大贡献的时代）。 加强社会保障体系建设。坚持房子是用来住的、不是用来炒的定位，加快建立（多主体供给、多渠道保障、租购并举）的住房制度，让全体人民住有所居。 加强社会治理制度建设，完善党委领导、政府负责、社会协同、公众参与、法治保障的社会治理体制，提高社会治理（社会化、法治化、智能化、专业化）水平。 必须坚持（节约优先、保护优先、自然恢复）为主的方针，形成节约资源和保护环境的空间格局、产业结构、生产方式、生活方式，还自然以宁静、和谐、美丽。 构建市场导向的绿色技术创新体系，发展绿色金融，壮大（节能环保产业、清洁生产产业、清洁能源产业）。 倡导简约适度、绿色低碳的生活方式，反对奢侈浪费和不合理消费，开展创建节约型机关、（绿色家庭、绿色学校、绿色社区、.绿色出行）等行动。 提高污染排放标准，强化排污者责任，健全（环保信用评价、信息强制性披露、严惩重罚）等制度。 要支持香港、澳门融入国家发展大局，以（粤港澳大湾区建设、粤港澳合作、泛珠三角区域合作）等为重点，全面推进内地同香港、澳门互利合作。 中国将高举（和平、发展、合作、共赢）的旗帜，恪守维护世界和平、促进共同发展的外交政策宗旨。 积极促进“一带一路”国际合作，努力实现（政策沟通、设施联通、贸易畅通、资金融通、民心相通），打造国际合作新平台，增添共同发展新动力。 青年兴则国家兴，青年强则国家强。青年一代（有理想、有本领、有担当），国家就有前途，民族就有希望。 全党全国各族人民要紧密团结在党中央周围，高举中国特色社会主义伟大旗帜，锐意进取，埋头苦干，为实现推进现代化建设、完成祖国统一、维护世界和平与促进共同发展三大历史任务，为（决胜全面建成小康社会、夺取新时代中国特色社会主义伟大胜利、实现中华民族伟大复兴的中国梦、实现人民对美好生活的向往）继续奋斗！ 中国共产党第十九次全国代表大会对党章做了部分修改，2017年10月24日通过新修订的《中国共产党章程》。 中国共产党以马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观、（习近平新时代中国特色社会主义思想）作为自己的行动指南。 （十八大）以来，以习近平同志为主要代表的中国共产党人，顺应时代发展，从理论和实践结合上系统回答了新时代坚持和发展什么样的中国特色社会主义、怎样坚持和发展中国特色社会主义这个重大时代课题，创立了习近平新时代中国特色社会主义思想。 （习近平新时代中国特色社会主义思想）是对马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观的继承和发展，是马克思主义中国化最新成果，是党和人民实践经验和集体智慧的结晶，是中国特色社会主义理论体系的重要组成部分，是全党全国人民为实现中华民族伟大复兴而奋斗的行动指南，必须长期坚持并不断发展。 在习近平新时代中国特色社会主义思想指导下，中国共产党领导全国各族人民，统揽（伟大斗争、伟大工程、伟大事业、伟大梦想），推动中国特色社会主义进入了新时代。 全党同志要倍加珍惜、长期坚持和不断发展党历经艰辛开创的这条道路、这个理论体系、这个制度、这个文化，高举中国特色社会主义伟大旗帜，坚定（道路自信、理论自信、制度自信、文化自信），贯彻党的（基本理论、基本路线、基本方略），为实现推进现代化建设、完成祖国统一、维护世界和平与促进共同发展这三大历史任务，（实现“两个一百年”奋斗目标、实现中华民族伟大复兴的中国梦）而奋斗。 在新世纪新时代，经济和社会发展的战略目标是，（到建党一百年时，全面建成小康社会）；（到新中国成立一百年时，全面建成社会主义现代化强国）。 要实施科教兴国战略、人才强国战略、（创新驱动发展战略、乡村振兴战略、区域协调发展战略）、可持续发展战略、（军民融合发展战略），充分发挥科学技术作为第一生产力的作用，充分发挥（创新）作为引领发展第一动力的作用，依靠科技进步，提高劳动者素质，促进国民经济（更高质量、更有效率、更加公平、更可持续发展）。 要（全面深化改革），完善和发展中国特色社会主义制度，推进国家治理体系和治理能力现代化。 发挥市场在资源配置中的（决定性）作用，更好发挥（政府）作用，建立完善的宏观调控体系。 大力发展教育、科学、文化事业，（推动中华优秀传统文化），（创造性转化、创新性发展，继承革命文化），发展社会主义先进文化，提高国家文化软实力。 牢牢掌握（意识形态）工作领导权，不断巩固马克思主义在意识形态领域的指导地位，巩固全党全国人民团结奋斗的共同思想基础。 坚持（总体国家安全观），坚决维护国家主权、安全、发展利益。 树立尊重自然、顺应自然、保护自然的生态文明理念，（增强绿水青山就是金山银山）的意识。 中国共产党坚持对人民解放军和其他人民武装力量的（绝对）领导，贯彻（习近平强军思想），加强人民解放军的建设，坚持（政治建军、改革强军、科技兴军、依法治军），建设一支听党指挥、能打胜仗、作风优良的人民军队，切实保证人民解放军有效履行新时代军队使命任务，充分发挥人民解放军在巩固国防、保卫祖国和参加社会主义现代化建设中的作用。 加强各级领导班子建设，培养选拔(党和人民需要的好干部)，培养和造就千百万社会主义事业接班人，从组织上保证党的(基本理论、基本路线、基本方略)的贯彻落实。 加强和规范党内政治生活，增强党内政治生活的(政治性、时代性、原则性、战斗性)，发展积极健康的党内监督制度政治文化，营造风清气正的良好政治生态。 (全面从严治党)永远在路上。新形势下，党面临的(执政考验、改革开放考验、市场经济考验、外部环境考验)是长期的、复杂的、严峻的，(精神懈怠危险、能力不足危险、脱离群众危险、消极腐败危险)更加尖锐地摆在全党面前。 坚持(依规治党、标本兼治)，坚持把(纪律)挺在前面，加强组织性纪律性，在党的纪律面前(人人平等)。 强化管党治党(主体责任和监督责任)，加强对党的领导机关和党员领导干部特别是(主要领导干部)的监督，不断完善党内监督体系。深入推进党风廉政建设和反腐败斗争，以零容忍态度惩治腐败，构建(不敢腐、不能腐、不想腐)的有效机制。 党政军民学，东西南北中，(党)是领导一切的。 (中国共产党的领导)是中国特色社会主义最本质的特征，是中国特色社会主义制度的最大优势。 自觉遵守党的纪律，首先是党的（政治纪律和政治规矩）。 切实开展批评和自我批评，勇于揭露和纠正（违反党的原则的言行）和工作中的缺点、错误，坚决同消极腐败现象作斗争。 发扬社会主义新风尚，带头实践（社会主义核心价值观和社会主义荣辱观），提倡共产主义道德，弘扬中华民族传统美德。 发展党员，必须把（政治标准）放在首位。 党的中央和省、自治区、直辖市委员会实行巡视制度。在（一届）任期内，对所管理的地方、部门、企事业单位党组织实现（巡视全覆盖）。 党的市（地、州、盟）和县（市、区、旗）委员会建立（巡察制度）。 党的中央军事委员会组成人员由中央委员会决定，中央军事委员会实行（主席负责制）。 监督党员干部和其他任何工作人员严格遵守（国家法律法规）。 （国有企业党委（党组））发挥领导作用，把方向、管大局、保落实，依照规定讨论和决定企业重大事项。 社会组织中（党的基层组织），宣传和执行党的路线、方针、政策，领导工会、共青团等（群团组织），教育管理党员，引领服务群众，推动事业发展。 党的各级领导干部必须（信念坚定、为民服务、勤政务实、敢于担当、清正廉洁）。 党的纪律主要包括（政治纪律、组织纪律、廉洁纪律、群众纪律、工作纪律、生活纪律）。 坚持惩前毖后、治病救人，（执纪必严、违纪必究，抓早抓小、防微杜渐），按照错误性质和情节轻重，给以批评教育直至纪律处分。运用监督执纪“四种形态”，让“红红脸、出出汗”成为常态，（党纪处分、组织调整）成为管党治党的重要手段，严重违纪、严重触犯刑律的党员必须开除党籍。 对党的中央委员会委员、候补委员，给以警告、严重警告处分，由（中央纪律检查委员会常务委员会审议后，报党中央批准）。对地方各级党的委员会委员、候补委员，给以警告、严重警告处分，应由（上一级纪律检查委员会批准，并报它的同级党的委员会备案）。 党的各级纪律检查委员会是党内监督（专责机关）。 党的各级纪律检查委员会的职责是（监督、执纪、问责）。","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"两学一做","slug":"两学一做","date":"2017-11-21T10:00:14.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/两学一做.html","link":"","permalink":"https://blog.ccsyue.com/2017/两学一做.html","excerpt":"","text":"（党性教育）是共产党人的“心学”。（党章）是共产党人的“原教旨”。（党支部）是党的基础组织。（邓小平）提出了“和平统一、一国两制”方针。（构建人类命运共同体）思想是习近平总书记外交思想的核心和精髓。（国有企业）是国有经济的主体。（去产能）是优化存量资源配置的根本途径。（事业单位）是提供公益服务的主体。（文化自信）是民族自信的源头。（文化自信）是一个国家、一个民族发展中更基本、更深沉、更持久的力量。（现代产权制度）是社会主义市场经济体制的基石。（新兴产业）是经济体系中最具活力、最具增长潜力的部分。（政治功能）是党组织第一位的功能。（职能转变）是深化行政体制改革的核心。2014年以来，“百名红通人员”中已有（49）人落网。2014年以来，全国共有（7020）个单位党委（党组）、党总支、党支部被问责。2016年，我国举办了二十国集团领导人（杭州）峰会。按照中央统一部署要求，从（2018年）起正式实行全国统一的市场准入负面清单制度。创新是建设现代化经济体系的（战略支撑）。从二○三五年到本世纪中叶，要（把我国建成社会主义现代化强国）。党的（政治建设）是党的根本性建设，决定党的建设方向和效果。党的基层委员会、总支部委员会、支部委员会每届任期（三年至五年）。党的基层组织建设要以提升（组织力）为重点。党的领导是人民当家作主和依法治国的（根本保证）。到本世纪末，要把我国建成（富强民主文明和谐美丽）的社会主义现代化强国。发展经济的着力点要放在（实体经济）上。发展是解决我国一切问题的（基础和关键）。加强军队党的建设，开展（传承红色基因、担当强军重任）主题教育。加强思想道德建设，要深入实施（公民道德）建设工程。加强思想道德建设，要推进诚信建设和志愿服务（制度化）。坚持党对一切工作的领导，必须提高党（把方向、谋大局、定政策、促改革）的能力和定力。坚持总体国家安全观，要以（人民安全）为宗旨。坚持总体国家安全观，要以（政治安全）为根本。建设生态文明必须树立和践行（绿水青山就是金山银山）的理念。建设现代化经济体系，必须把（提高供给体系质量）作为主攻方向。经济体制改革必须以（完善产权制度和要素市场化配置）为重点。军队一切工作都必须坚持（战斗力）标准。培育和践行社会主义核心价值观，要以（培养担当民族复兴大任的时代新人）为着眼点。全面从严治党，要以（党章）为根本遵循。全面依法治国是中国特色社会主义的本质要求和（重要保障）。社会主义核心价值观凝结着全体人民共同的（价值追求）。社会主义文艺必须坚持（以人民为中心）的创作导向。十八大以来，（6000）多万贫困人口稳定脱贫。十八大以来，贫困发生率从10.2%下降到（4%）以下。十八大以来，全面深化改革推出（1500）多项改革举措。十八大以来，我国城镇新增就业年均（1300万）人以上。十八大以来，我国经济稳居世界（第二）。十八大以来，我国主导制定了（《北京反腐败宣言》）。十八大以来，中央纪委审查的案件中，超过（60%）的线索来自巡视。十八大以来的5年变革是（深层次的、根本性的）。十八大以来的五年，共立案审查违反政治纪律案件1.5万件，处分中管干部（112）人。十八大以来的五年，农业现代化稳步推进，粮食生产能力达到（一万二千）亿斤。十八大以来的五年，全国纪检监察机关共处分村党支部书记、村委会主任（27.8）万人。十八大以来的五年，在党的历史上（第一次）实现一届任期内巡视全覆盖。十九大报告强调，遵循（共商共建共享）原则，打造国际合作新平台。十九大报告指出，要增强（消费）对经济发展的基础性作用。十九大强调，要建立（全国）统一的社会保险公共服务平台。十九大强调，要普及（高中阶段）教育。十九大提出，要推动协商民主广泛、多层、（制度化）发展。十九届中央委员会由（204）名委员、172名候补委员组成。十九届中央政治局委员中，有（12）名同志是新提拔的。实行行政领导人负责制的事业单位中党的基层组织，发挥（战斗堡垒）作用。统一战线是广泛的（政治联盟）。统战工作的本质是（扩大共识）。我军维护核心、听从指挥，首要的是维护和贯彻（军委主席负责制）。习近平强调要永远把（人民对美好生活的向往）作为奋斗目标。习近平新时代中国特色社会主义思想的核心要义是（坚持和发展中国特色社会主义）习近平新时代中国特色社会主义思想最重要、最核心的内容是（八个明确）要坚持就业优先战略和（积极就业）政策，实现更高质量和更充分就业。要以（城市群）为主体构建大中小城市和小城镇协调发展的城镇格局。只有（改革开放）才能发展中国、发展社会主义、发展马克思主义。中国秉持（共商共建共享）的全球治理观。中国共产党一经成立，就把（实现共产主义）作为党的最高理想。中国特色社会主义事业战略布局是（四个全面）。中国特色社会主义最本质的特征是（中国共产党领导）。","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"故事：小马过河","slug":"故事：小马过河","date":"2017-10-24T19:42:48.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/故事：小马过河.html","link":"","permalink":"https://blog.ccsyue.com/2017/故事：小马过河.html","excerpt":"","text":"在一座小山旁边，住着一匹老马和一匹小马。小马整天跟着妈妈，从来不肯离开一步。 有一天，妈妈对小马说：“宝宝，你现在已经是个大孩子了。你能帮助妈妈做点事情吗？” 小马点点头说：“嗯，怎么不能呢！我可喜欢做事情啦。” 妈妈听了，高兴地说： “宝宝真是个好孩子。那么，你就把这袋麦子送到磨房里去吧。” 妈妈说着，就把一袋麦子放到了小马的背上。 小马试了一试，一点儿也不重。可是小马对妈妈说： “妈妈，嗯，你能跟我一块儿去吗？” 妈妈说：“怎么，妈妈要是能和你一块儿去，还要你帮忙做什么呢？快点去吧，早点去早点回来，妈妈等着你吃饭。” 小马独自背着麦子向磨房走去。 从小马的家到磨房，要经过一条小河。小马走到河边，看见河水挡在前面哗啦哗啦地响着，心里就有点害怕了。 “过去呢，还是不过去呢？妈妈不在身边，哎呀，怎么办呢？”小马想着，就回过头朝后望。他希望这个时候妈妈跑来就好了。 可是他没有看到妈妈的影子，他只看见老牛伯伯在河边吃草。于是小马连忙“嘚嘚嘚”地跑去了，问牛伯伯：“牛伯伯，请你告诉我，我能过河去吗？” 牛伯伯回答说：“啊，水啊很浅哪。还不到我的小腿那么深，怎么就不能过去呢。” 小马听了，立刻就朝小河跑去。 “喂！慢点跑，慢点跑！” 咦！是谁在说话呀？ 小马停住脚步抬头一看，原来是一只小松鼠。 小松鼠蹲在一棵松树上，摇着大尾巴，对小马说：“哎呀，小马，你可别听那老牛的话。水很深很深，一下水就会淹死你的！” 小马问小松鼠：“你怎么知道水很深呢？” 小松鼠说：“老牛说水浅，水浅怎么会把我的伙冲跑了呢？你可别听老牛的话！” 小河里的水到底是深呢，还是浅呢？小马没有了主意。 “唉！还是回家去问问妈妈吧。”小马甩了甩尾巴，“嘚嘚嘚”又往家里跑去。 妈妈看见小马回来了，奇怪地问：“咦！你怎么回来了呢？” 小马很难为情地说：“河里的水很深，过……过不去呀。……” 妈妈说：“怎么会很深呢？昨天小驴叔叔还到河那边驮了好几趟柴火呢。他说河水呀只齐到他肚子那儿，很浅。” “嗯……是这样的……老牛伯伯说水很浅。他说只到小腿那儿……” “那你为什么不过去呢？” “可是……小松鼠说……水很深，昨天，他的一个同伴过河，被河水冲走了。” “河水到底是深还是浅呢？你仔细想过他们的话吗？” “想了一下，可是没有仔细想，也不知他们俩谁说得对。” 妈妈笑了,说：“你现在仔细想想看：牛伯伯多高多大呀，小松鼠又有多高多大；你再把小松鼠和你自己比一比；你有多高多大，小松鼠又有多高多大呢，你就知道能不能过河了。” 小马听了妈妈的话，高兴得跳了起来。他说：“嗯，明白了，明白了，河水不深，我过得去。唉！我刚才怎么不仔细想想呢！” 小马说着，就连蹦带跳地朝河边跑去。 小马一口气跑到河边，立刻跳到水里。河水刚好齐在小马的膝盖，不像老牛说的那么浅，也不像小松鼠说的那么深。 小马驮着麦子，很快活地蹚着水，“扑通扑通”地过了河，到磨房去了。","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"故事：农夫和蛇","slug":"故事：农夫和蛇","date":"2017-09-06T21:08:48.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/故事：农夫和蛇.html","link":"","permalink":"https://blog.ccsyue.com/2017/故事：农夫和蛇.html","excerpt":"","text":"有一年的冬天特别冷，北风呼呼地刮着，大雪纷纷地下着，地上结的冰有几寸厚。 一天，有个农夫迎着寒风往家赶路，他刚走进院子，就发现篱笆旁边有一团黑呼呼的东西。走过去一看，哎呀！原来是条蛇，他急忙往旁边一躲，不小心撞倒了一捆木柴，木柴哗啦啦的砸在地上，声音像打雷一样响。农夫吓坏了，以为那条蛇马上就会向他扑过来。正想撒腿想要往屋里跑呢，可是回头一看，那条蛇还是躺在那儿一动不动，难道死了吗？他大着胆子走到跟前一瞧，原来呀，这是一条冻僵了的蛇，它的呼吸很微弱，眼看就要死了。一条快要死的蛇是不会咬人的，农夫这下放心了。他把蛇捡起来，打算扔到院子外面去，突然，那条蛇用微弱的声音说：“别把我扔出去，救救我，救救我。” 农夫把蛇捏在手里对它说：“救你？把你救活了不是又要去咬人吗？” 蛇有气无力地说：“唉，我连大声说话的力气都没有了，还会咬人吗？” 农夫一想也是，它连爬都爬不动当然不会咬人了，他看着蛇奄奄一息的样子，很不忍心，就解开衣扣，把它放进怀里，带回了家。 农夫家里有个暖烘烘的火炉，他就把怀里的蛇掏出来，轻轻地放在火炉边，慢慢地温暖着它。他的家人也很善良，还抱来了一条厚厚的毯子，让蛇舒舒服服的躺在上面。全家人都围着这条蛇，不断的往炉子里添柴火，好让屋里更暖和些。一会儿功夫，蛇就醒了过来。农夫一家看见它醒了，都很高兴。蛇动了一下，抬起头来看着四周，忽然它张开大嘴，吐着细长的舌头，冲农夫的小女儿跳了过去，小女儿吓了一跳，一边尖叫一边在屋里躲闪着。蛇在后面紧追不舍，长长的舌头发出“嘶嘶”的声音，农夫跳起来去抓它，可它东游西蹿地怎么也抓不到。这个时候小女儿不小心摔了一跤，蛇嗖的一声窜过去在她的腿上狠狠咬了一口。农夫气坏了，指着它喊：“你这条忘恩负义的毒蛇，我好心救了你，你怎么能恩将仇报呢?” 蛇大笑了起来，得意地说：“哈哈，我是蛇，蛇生来就要咬人的嘛。不错，你是救了我，那是你一时心软，可我犯不着因为这个就改变我的本性。” 听了这话，农夫气得直发抖：“好哇你，现在我总算明白了。”这会儿农夫再也不心软了，他抄起一根粗粗的棍子，狠狠地向蛇抡了过去，“啪”地一下，就把这条毒蛇呀打得稀巴烂了。","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"云服务器实现https访问","slug":"nginx实现https访问","date":"2017-08-02T21:43:24.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/nginx实现https访问.html","link":"","permalink":"https://blog.ccsyue.com/2017/nginx实现https访问.html","excerpt":"","text":"申请证书(需要python和openssl支持)123456789101112131415#0.进入/etc/nginx/conf.d/目录cd /etc/nginx/conf.d#1.创建一个 Let's Encrypt账户私钥，以便让其识别你的身份openssl genrsa 4096 &gt; account.key#2.创建域名私钥openssl genrsa 4096 &gt; domain.key#3-1.单域名CSR用如下命令openssl req -new -sha256 -key domain.key -subj \"/CN=ccsyue.com\" &gt; domain.csr#3-2.多域名CSR用如下命令（一般都至少要为根域和WWW申请证书吧）openssl req -new -sha256 -key domain.key -subj \"/\" -reqexts SAN -config &lt;(cat /etc/pki/tls/openssl.cnf &lt;(printf \"[SAN]\\nsubjectAltName=DNS:ccsyue.com,DNS:c.ccsyue.com\")) &gt; domain.csr#4.创建验证目录/etc/nginx/conf.d/challenges/python acme_tiny.py --account-key account.key --csr domain.csr --acme-dir ./challenges/ &gt; signed.crt#5.用nginx得合并中间证书wget -O - https://letsencrypt.org/certs/lets-encrypt-x3-cross-signed.pem &gt; intermediate.pemcat signed.crt intermediate.pem &gt; chained.pem 2.配置nginx,注意在1.4首次验证域名时暂时去掉server{listen:443…},之后又加上，当然得nginx restart或reload。1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556server &#123; listen 80; server_name c.ccsyue.com ccsyue.com; location ^~ /.well-known/acme-challenge/ &#123; alias /etc/nginx/conf.d/challenges/; try_files $uri =404; &#125; location / &#123; rewrite ^/(.*)$ https://ccsyue.com/$1 permanent; &#125;&#125;server &#123; listen 443; server_name c.ccsyue ccsyue.com; # SSL ssl on; ssl_certificate /etc/nginx/conf.d/chained.pem; ssl_certificate_key /etc/nginx/conf.d/domain.key; ssl_session_timeout 1d; ssl_protocols TLSv1 TLSv1.1 TLSv1.2; ssl_prefer_server_ciphers on;ssl_ciphers EECDH+CHACHA20:EECDH+CHACHA20-draft:EECDH+AES128:RSA+AES128:EECDH+AES256:RSA+AES256:EECDH+3DES:RSA+3DES:!MD5;ssl_session_cache shared:SSL:50m;ssl_session_tickets on;ssl_stapling on;ssl_stapling_verify on;resolver 114.114.114.114 valid=300s;resolver_timeout 10s; # disable any limits to avoid HTTP 413 for large image uploads client_max_body_size 0; # required to avoid HTTP 411: see Issue #1486 (https://github.com/docker/docker/issues/1486) chunked_transfer_encoding on; location / &#123; # Do not allow connections from docker 1.5 and earlier # docker pre-1.6.0 did not properly set the user agent on ping, catch &quot;Go *&quot; user agents if ($http_user_agent ~ &quot;^(docker\\/1\\.(3|4|5(?!\\.[0-9]-dev))|Go ).*$&quot; ) &#123; return 404; &#125; # To add basic authentication to v2 use auth_basic setting plus add_header # auth_basic &quot;registry.localhost&quot;; # auth_basic_user_file /etc/nginx/conf.d/registry.password; # add_header &apos;Docker-Distribution-Api-Version&apos; &apos;registry/2.0&apos; always; proxy_pass http://HAPROXY; proxy_set_header Host $http_host; # required for docker client&apos;s sake proxy_set_header X-Real-IP $remote_addr; # pass on real client&apos;s IP proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for; proxy_set_header X-Forwarded-Proto $scheme; proxy_read_timeout 900; &#125; &#125; 3.定期执行renew_cert.sh1234567#!/bin/bashcd /root/profile/nginx/conf.d/python acme_tiny.py --account-key account.key --csr domain.csr --acme-dir ./challenges/ &gt; signed.crt || exitwget -O - https://letsencrypt.org/certs/lets-encrypt-x3-cross-signed.pem &gt; intermediate.pemcat signed.crt intermediate.pem &gt; chained.pemdocker restart 3e4430f588eb 10 0 1 * * /home/xxx/renew_cert.sh &gt;/dev/null 2&gt;&amp;1","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"Let's Encrypt","slug":"Let-s-Encrypt","permalink":"https://blog.ccsyue.com/tags/Let-s-Encrypt/"},{"name":"https","slug":"https","permalink":"https://blog.ccsyue.com/tags/https/"}]},{"title":"daocloud安装pyspider","slug":"daocloud安装pyspider","date":"2017-08-02T21:35:40.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/daocloud安装pyspider.html","link":"","permalink":"https://blog.ccsyue.com/2017/daocloud安装pyspider.html","excerpt":"","text":"12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273747576777879808182838485868788899091929394959697phantomjs: image: binux/pyspider:latest command: phantomjs cpu_shares: 512 environment: - EXCLUDE_PORTS=5000,23333,24444 expose: - &apos;25555&apos; mem_limit: 512m restart: alwaysphantomjs-lb: image: dockercloud/haproxy:latest links: - phantomjs restart: alwaysfetcher: image: binux/pyspider:latest links: - phantomjs-lb:phantomjs command: --message-queue &quot;redis://pyredis:6379/1&quot; --phantomjs-proxy &quot;phantomjs:80&quot; fetcher --xmlrpc cpu_shares: 512 environment: - EXCLUDE_PORTS=5000,25555,23333 external_links: - dao_redis_1:pyredis mem_limit: 128m restart: alwaysfetcher-lb: image: dockercloud/haproxy:latest links: - fetcher restart: alwaysprocessor: image: binux/pyspider:latest command: --projectdb &quot;mysql+projectdb://root:deffyc126@dao_pymysql_1/projectdb&quot; --message-queue &quot;redis://pyredis:6379/1&quot; cpu_shares: 512 mem_limit: 256m external_links: - dao_pymysql_1 - dao_redis_1:pyredis restart: alwaysresult-worker: image: binux/pyspider:latest command: --taskdb &quot;mysql+taskdb://root:deffyc126@dao_pymysql_1:3306/taskdb&quot; --projectdb &quot;mysql+projectdb://root:deffyc126@dao_pymysql_1:3306/projectdb&quot; --resultdb &quot;mysql+resultdb://root:deffyc126@dao_pymysql_1:3306/resultdb&quot; --message-queue &quot;redis://pyredis:6379/1&quot; cpu_shares: 512 mem_limit: 256m external_links: - dao_pymysql_1 - dao_redis_1:pyredis restart: alwaysscheduler: image: binux/pyspider:latest command: --taskdb &quot;mysql+taskdb://root:deffyc126@dao_pymysql_1/taskdb&quot; --resultdb &quot;mysql+resultdb://root:deffyc126@dao_pymysql_1/resultdb&quot; --projectdb &quot;mysql+projectdb://root:deffyc126@dao_pymysql_1/projectdb&quot; --message-queue &quot;redis://pyredis:6379/1&quot; scheduler --inqueue-limit 5000 --xmlrpc --delete-time 43200 external_links: - dao_pymysql_1 - dao_redis_1:pyrediswebui: image: binux/pyspider:latest command: --taskdb &quot;mysql+taskdb://root:deffyc126@pymysql/taskdb&quot; --projectdb &quot;mysql+projectdb://root:deffyc126@pymysql/projectdb&quot; --resultdb &quot;mysql+resultdb://root:deffyc126@pymysql/resultdb&quot; --message-queue &quot;redis://pyredis:6379/1&quot; webui --max-rate 0.2 --max-burst 3 --scheduler-rpc &quot;http://scheduler:23333/&quot; --fetcher-rpc &quot;http://fetcher/&quot; --username &quot;deffyc&quot; --password &quot;deffyc126&quot; --need-auth cpu_shares: 512 environment: - EXCLUDE_PORTS=24444,25555,23333 links: - fetcher-lb:fetcher - scheduler external_links: - dao_pymysql_1:pymysql - dao_redis_1:pyredis mem_limit: 256m restart: alwayswebui-lb: image: dockercloud/haproxy:latest links: - webui restart: alwaysnginx: image: daocloud.io/library/nginx:stable links: - webui-lb:HAPROXY ports: - 0.0.0.0:80:80 - 0.0.0.0:443:443 volumes: - /root/profile/nginx/nginx.conf:/etc/nginx/nginx.conf - /root/profile/nginx/conf.d/:/etc/nginx/conf.d/ restart: always docker-compose scale phantomjs=2 processor=2 webui=4","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"docker","slug":"docker","permalink":"https://blog.ccsyue.com/tags/docker/"},{"name":"pyspider","slug":"pyspider","permalink":"https://blog.ccsyue.com/tags/pyspider/"}]},{"title":"山西新闻联播公众号两学一做系列知识竞答","slug":"山西新闻联播公众号两学一做系列知识竞答","date":"2017-06-23T21:04:02.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/山西新闻联播公众号两学一做系列知识竞答.html","link":"","permalink":"https://blog.ccsyue.com/2017/山西新闻联播公众号两学一做系列知识竞答.html","excerpt":"","text":"1、党章规定，可以申请入党的年龄为年满（18岁）。2、修订后的《中国共产党廉洁自律准则》和《中国共产党纪律处分条例》自（2016年1月1日）起施行。3、党章规定，预备党员预备期满，党的支部应当及时讨论他能否转为正式党员。需要继续考察和教育的，可以延长预备期，但不能超过（一年）。4、加强和改进党的作风建设的核心问题是（保持党同人民群众的血肉联系）。5、建设中国特色社会主义的总依据是（社会主义初级阶段基本国情）。6、《中国共产党纪律处分条例》规定，违反有关规定程序发展党员的，对直接责任者和领导责任者，一般给予（警告或者严重警告处分）。7、《中国共产党纪律处分条例》规定，党员领导干部对违反政治纪律和政治规矩等错误思想和行为放任不管，搞无原则一团和气，造成不良影响的，一般给予（警告或者严重警告处分）。8、下列哪一项不是党的纪律处分工作应当坚持的原则（坦白从宽、抗拒从严）。9、《中国共产党廉洁自律准则》之《党员廉洁自律规范》指出，坚持吃苦在前，享受在后，甘于（奉献 ）。10、党章《总纲》指出，中国共产党人追求的共产主义最高理想，只有在社会主义社会（充分发展和高度发达）的基础上才能实现。11、《中国共产党纪律处分条例》规定，对严重违犯党纪的党组织的纪律处理措施是（改组、解散 ）。12、《中国共产党纪律处分条例》规定，一个违纪行为同时触犯本条例两个以上（含两个）条款的，依照（处分较重的条款）条款定性处理。13、《中共中央关于印发〈中国共产党廉洁自律准则〉的通知》指出，《廉洁自律准则》贯彻党的十八大和十八届三中、四中全会精神，坚持（依规治党 以德治党）与（）相结合。14、中共中央关于印发《中国共产党纪律处分条例》的通知指出，各级党委（党组）要担当和落实好全面（从严治党）的主体责任，以对党的事业和党员、干部高度负责的精神，切实抓好《条例》的学习宣传、贯彻落实。15、《中国共产党廉洁自律准则》之《党员领导干部廉洁自律规范》指出，廉洁（从政 ），自觉保持人民公仆本色。16、《中国共产党廉洁自律准则》之《党员领导干部廉洁自律规范》指出，廉洁（用权），自觉维护人民根本利益。17、《中国共产党廉洁自律准则》之《党员领导干部廉洁自律规范》指出，廉洁（修身），自觉提升思想道德境界。18、《中国共产党纪律处分条例》规定，在操办婚丧喜庆事宜中，借机敛财或者有其他侵犯国家、集体和人民利益行为的，依照相应条款规定（从重或者加重处分，直至开除党籍）。19、新形势下加强和规范党内政治生活，重点是（各级领导机关和领导干部），关键是高级干部特别是中央委员会、中央政治局、中央政治局常务委员会的组成人员。20、（党委（党组））应当加强对领导干部的日常管理监督，掌握其思想、工作、作风、生活状况。21、（党的纪律 ）是党的各级组织和全体党员必须遵守的行为规则，是维护党的团结统一、完成党的任务的保证。22、坚决维护 （党中央权威）、保证全党令行禁止，是党和国家前途命运所系，是全国各族人民根本利益所在。23、中国共产党领导人民发展社会主义民主政治，坚持（党的领导）、人民当家作主、依法治国有机统一，走中国特色社会主义政治发展道路。24、党内监督的重点对象是：（党的领导机关和领导干部特别是主要领导干部）25、《关于新形势下党内政治生活的若干准则》在（党的十八届六中全会）上通过。26、党章规定，党坚持标本兼治、综合治理、惩防并举、注重预防的方针，建立健全惩治和预防腐败体系，坚持不懈地反对腐败，加强（党风）建设和（廉政）建设。27、（党风问题）、党同人民群众联系问题是关系党生死存亡的问题。28、党章规定，党员必须坚持（党和人民的利益）高于一切，个人利益服从党和人民的利益，吃苦在前，享受在后，克己奉公，多做贡献。29、预备党员必须面向（党旗 ）进行入党宣誓。30、党支部的“三会一课”制度是指支部党员大会、支部委员会、党小组会、（党课）。31、（党章）是最根本的党内法规，是管党治党的总规矩。32、（党内民主）是党的生命，是党内政治生活积极健康的重要基础。33、我们要坚持（党要管党）、从严治党，发扬党的优良传统和作风。34、党的（基层组织）是党在社会基层组织中的战斗堡垒，是党的全部工作和战斗力的基础。35、党的支部委员会对申请入党的人，要注意征求党内外有关群众的意见，进行严格的审查，认为合格后直接提交（党支部大会）讨论。36、党按照（德才兼备、以德为先）的原则选拔干部，坚持五湖四海、任人唯贤。37、党章《总纲》指出，只有（改革开放），才能发展中国、发展社会主义、发展马克思主义。38、中共中央关于印发《中国共产党纪律处分条例》的通知指出，《条例》是对党章规定的具体化，划出了党组织和党员不可碰触的（底线）。39、省、自治区、直辖市党委应当推动党的市（地、州、盟）和县（市、区、旗）委员会建立（巡察）制度，使从严治党向基层延伸。40、党章《总纲》指出，党除了工人阶级和最广大人民群众的利益，没有自己（特殊）的利益。41、党章规定，党的中央委员会认为有必要，或者（三分之一）以上的省一级组织提出要求，全国代表大会可以提前举行。42、《中国共产党纪律处分条例》规定，党员受到开除党籍处分，（五年）内不得重新入党。43、《中国共产党纪律处分条例》规定，党员受到撤销党内职务处分，（二年）内不得在党内担任和向党外组织推荐担任与其原任职务相当或者高于其原任职务的职务。44、党章《总纲》指出，中国共产党在领导社会主义事业中，必须坚持以（经济建设）为中心，其他各项工作都服从和服务于这个中心。45、中国走和平发展道路、倡导合作共赢是有底线的，这就是坚决（维护国家核心利益）。46、党章强调，要不断提高党的创造力、凝聚力、战斗力，建设学习型、（服务型）、创新型的马克思主义执政党，使我们党始终走在时代前列，成为领导全国人民沿着中国特色社会主义道路不断前进的坚强核心。47、党章《总纲》指出，坚持（四项基本原则）是我们的立国之本。48、继续深化改革开放，要坚持把（改善人民生活）作为正确处理改革发展稳定关系的结合点，使改革始终得到人民拥护和支持。49、党必须按照总揽全局、（协调各方）的原则，在同级各种组织中发挥领导核心作用。50、党章规定，发展党员，必须经过党的支部，坚持（个别吸收）的原则。51、党章规定，党是根据自己的纲领和章程，按照（民主集中制）组织起来的统一整体。52、《中国共产党纪律处分条例》规定，党组织不履行全面从严治党主体责任或者履行全面从严治党主体责任不力，造成严重损害或者严重不良影响的，对直接责任者和领导责任者，情节严重的，给予（给予撤销党内职务或者留党察看处分）。53、妄议中央大政方针，破坏党的集中，属于违反（政治纪律）的行为。54、（政治纪律）是党最根本、最重要的纪律，遵守党的＿＿＿＿是遵守党的全部纪律的基础。55、《中国共产党廉洁自律准则》之《党员廉洁自律规范》指出，坚持公私分明，（先公后私），克己奉公。56、党章规定，党员必须发扬社会主义新风尚，带头实践社会主义荣辱观，提倡（共产主义道德），为了保护国家和人民的利益，在一切困难和危险的时刻挺身而出，英勇斗争，不怕牺牲。57、中共中央关于印发《中国共产党纪律处分条例》的通知指出，要把严守政治纪律和政治规矩永远排在（首要位置），通过严肃政治纪律和政治规矩带动其他纪律严起来。58、《中国共产党廉洁自律准则》之《党员领导干部廉洁自律规范》指出，廉洁（齐家），自觉带头树立良好家风。59、全面深化改革的总目标是坚持完善和发展中国特色社会主义制度、推进（国家治理体系和治理能力）现代化。60、发现领导干部有思想、作风、纪律等方面苗头性、倾向性问题的，有关党组织负责人应当及时对其（提醒）谈话。61、党章指出，党的上下级组织之间要互通情报、互相支持和（互相监督）。“62、《中共中央关于印发〈中国共产党廉洁自律准则〉的通知》指出，《廉洁自律准则》是党执政以来第一部坚持正面倡导、面向全体党员的规范全党廉洁自律工作的重要（基础性）法规，是对党章规定的（具体化）。”63、党章《总纲》指出，我国正处于并将长期处于社会主义初级阶段。这是在经济文化落后的中国建设社会主义现代化不可逾越的历史阶段，需要（上百年）的时间。64、为人民服务是党的根本宗旨，以人为本、（执政为民）是检验党一切执政活动的最高标准。65、全面提高党的建设科学化水平，全党要增强紧迫感和责任感，牢牢把握的主线是（加强党的执政能力建设、先进性和纯洁性建设）。66、（坚定理想信念 ），坚守共产党人的精神追求，始终是共产党人安身立命的根本。67、能不能坚守（艰苦奋斗）精神，是关系党和人民事业兴衰成败的大事，是反腐倡廉建设的精神支点。68、落实党风廉政建设责任制，党委负（主体）责任，纪委负监督责任，制定实施切实可行的责任追究制度。69、党章规定，要保证党的领导人的活动处于党和人民的（监督）之下，同时维护一切代表党和人民利益的领导人的（威信）。70、《中共中央关于印发〈中国共产党廉洁自律准则〉的通知》指出，《廉洁自律准则》紧扣廉洁自律主题，重申党的理想信念宗旨、优良传统作风，重在（立德）。71、中共中央关于印发《中国共产党纪律处分条例》的通知指出，《条例》围绕党纪戒尺要求，开列负面清单，重在（立规）。72、中共中央关于印发《中国共产党纪律处分条例》的通知指出，各级纪委（纪检组）要认真履行（监督执纪问责）职责，加大查处违反《条例》行为的力度，进一步探索建立不敢腐、不能腐、不想腐的有效机制。73、习近平同志在十八届中央政治局常委同中外记者见面时讲话中说，（人民对美好生活的向往）就是我们的奋斗目标。74、党的思想路线是一切从实际出发，理论联系实际，（实事求是 ），在实践中检验真理和发展真理。75、《中国共产党纪律处分条例》规定，对于受到解散处理的党组织中的党员，应当（逐个审查）。76、党的（组织）纪律是维护党的集中统一、保持党的战斗力的重要保障。77、党章规定的各项纪律都必须严格遵守和执行，而最首要、最核心的就是要严格遵守和执行党的（政治纪律 ）78、党章规定,中国共产党党员永远是劳动人民的普通一员。除了法律和政策规定范围内的个人利益和工作职权以外，所有共产党员都不得谋求任何（私利和特权）。79、党章规定，中国共产党党员永远是劳动人民的普通一员。除了法律和政策规定范围内的个人利益和工作职权以外，所有共产党员都不得谋求任何（私利和特权）。80、《中国共产党廉洁自律准则》之《党员廉洁自律规范》指出，坚持崇廉拒腐，（清白）做人，（干净）做事。81、不断提高党的领导水平和执政水平、提高（拒腐防变和抵御风险）能力，是党巩固执政地位、实现执政使命必须解决好的重大课题。82、《中国共产党纪律处分条例》规定，留党察看期间，确有悔改表现的，期满后恢复其党员权利；坚持不改或者又发现其他应当受到党纪处分的违纪行为的，应当（开除党籍 ）。83、宪法的生命和权威在于（实施）。84、党章《总纲》指出，我们党的最大政治优势是（密切联系群众），党执政后的最大危险是（脱离群众）。85、党员如果没有正当理由，连续（六个月）不参加党的组织生活，或不交纳党费，或不做党所分配的工作，就被认为是自行脱党。86、党的各级代表大会的代表和委员会的产生，要体现（选举人）意志。87、（人民民主）是社会主义的生命，是我们党始终高扬的光辉旗帜。88、协调推进“四个全面”的根本保证是（全面从严治党）。89、《中国共产党纪律处分条例》适用于（违犯党纪应当受到党纪追究的党组织和党员）。90、党章规定，党员必须密切联系群众，向群众宣传党的主张，遇事同群众商量，及时向党反映群众的意见和要求，维护（群众的正当利益）。91、党的基层委员会每届任期（三年至五年），总支部委员会、支部委员会每届任期（两年或三年）。92、党章规定，党员必须切实开展批评和自我批评，勇于揭露和纠正工作中的缺点、错误，坚决（同消极腐败现象作斗争）。93、在纪律审查中发现党的领导干部严重违纪涉嫌违法犯罪的，应当先 （先作出党纪处分决定，再移送行政机关、司法机关处理） 。94、党领导人民治理国家的基本方略是（依法治国，建设社会主义法治国家）。95、党章《总纲》指出，党的领导主要是（政治、思想和组织）的领导。96、2015年10月12日召开会议，（中共中央政治局 ）审议通过《中国共产党廉洁自律准则》、《中国共产党纪律处分条例》。97、党章《总纲》指出，中国共产党是中国工人阶级的先锋队，同时是（中国人民和中华民族的先锋队），是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民的根本利益。98、党章规定，中国共产党党员是（中国工人阶级）的有共产主义觉悟的先锋战士。99、中国特色社会主义是由道路、理论体系、制度三位一体构成的，其中（中国特色社会主义制度）是根本保障。100、要全面加强党的思想建设、组织建设、作风建设、反腐倡廉建设、制度建设，增强（自我净化）、自我完善、自我革新、自我提高能力。","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"故事：我是霸王龙","slug":"故事：我是霸王龙","date":"2017-05-31T10:10:59.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/故事：我是霸王龙.html","link":"","permalink":"https://blog.ccsyue.com/2017/故事：我是霸王龙.html","excerpt":"","text":"很久以前，在一个悬崖顶上住着翼龙爸爸和翼龙妈妈。有一天，翼龙妈妈生了一个蛋。一天晚上，那个蛋骨碌骨碌地转了起来。。。。。噼啪——可爱的翼龙宝宝出生了。爸爸妈妈高兴得不得了，他们很用心地抚养着宝宝。爸爸给宝宝喂很多好吃的东西：“多吃点吧，你要成为一只强壮的恐龙！”妈妈抱着宝宝哄他睡觉：“你要成为一只善良的恐龙！”爸爸教他怎么飞行：“你好好听着，拼命地张开翅膀，用力地踢打地面，乘着风就行啦！只要你飞得高，就算遇到粗暴的、可怕的霸王龙，也用不着害怕。”寒冷的下雨天里，妈妈用自己的翅膀护着宝宝：“不管谁遇到困难，你都要帮助他啊！”翼龙宝宝“扑棱扑棱”地一天天长大了，终于长得和爸爸一样大了。一天晚上，爸爸妈妈看着睡着的儿子说：“这孩子长这么大了，快要和我们分开了。”“他一个人能行吗？”“不要紧，这孩子已经长大了。”“可是，他还不太会飞呢。”“那就要靠他自己了。”听到爸爸这么说，妈妈忍不住“扑簌簌”流下了眼泪。然后，他俩一起飞上了天空。这是一个安安静静的夜晚。早晨，小翼龙醒过来：“哎呀，爸爸妈妈不见了！他们到哪儿去了呢？是不是去找吃的东西了。。。。。”可是，等呀等呀。。。。。爸爸妈妈还是没有回来。小翼龙大声地喊叫：“爸爸——妈妈——”他不停地叫啊叫啊。。。。。。小翼龙哭着哭着就睡着了。这个时候，从悬崖底下。。。。。“嘿嘿嘿嘿嘿嘿。。。。一头霸王龙瞪着眼睛爬了上来。快够着小翼龙啦！这个时候。。。。。。轰隆！火山喷发了！大地“咚咚咚”地摇晃起来……霸王龙从悬崖上骨碌骨碌。。。。。“咣当！”霸王龙摔到了地上。小翼龙走过去的时候，霸王龙正痛得“嗷嗷嗷”地叫呢！“啊。。。。。。”小翼龙想：怎么办呢？爸爸曾经说过：霸王龙是个粗暴、可怕的家伙呀！过了一会儿，霸王龙一动不动了。这个时候，小翼龙又想起妈妈曾经说过：：“不管谁遇到困难，你都要帮助他们呀！”“好吧”小翼龙把岩石一块一块地搬开。他把岩石全部搬开了，但霸王龙还是一动不动。哎呀，他伤得好厉害啊！”“要不要紧啊！”小翼龙轻轻地说。这个时候，“哎呀呀。。。。。身、身体动不了啦！眼、眼睛也睁不开啦！怎么了？怎么了？我什么都看不见啦！”霸王龙很伤心。“原来，他连眼睛也受伤了。”小翼龙正想着，霸王龙突然用很可怕的声音问：“谁？谁在那儿？”小翼龙吓了一跳，不由得说：“我、我是霸王龙。”“啊，和我一样的霸王龙？那你的声音怎么那么细？”“那、那、那不是因为大声说话对你的伤口不好吗？”小翼龙使出浑身力气，扯着嗓子吼叫着。小翼龙觉得受了伤的霸王龙好可怜，决定照顾他。下雨天，小翼龙用叶子盖住霸王龙，像妈妈曾经为他做的那样，温柔地、轻轻地。小翼龙还喂霸王龙红果子。“好吃吗？”“嗯。。。。。好吃。”其实，鱼更好吃，但我还不会飞到海边。。。。。。不，不，我是说，还不会跳到海边呢！霸王龙一声不响地听着。从这以后，小翼龙不断地把红果子衔回来喂霸王龙，就像爸爸曾经为他做的那样，喂好多好多。过了好几天。。。。。。一天晚上，当小翼龙抱着红果子回来时，看见霸王龙正瞪着眼睛，嘴里叼着鱼呢。啊，他站起来啦！眼睛也看得见啦！小翼龙吓了一大跳，红果子噼里啪啦掉了下来。霸王龙听到声音，回过头，叼着鱼”嘣嘣嘣“地走过来。这个时候，小翼龙想起爸爸曾经说过：“你好好听着，拼命地张开翅膀，用力地踢打地面，乘着风就行啦！”你飞得高，就算遇到可怕的霸王龙也用不着害怕。”小翼龙拼命地张开翅膀，“啊——”“乘着风就行啦！”小翼龙觉得风正托起自己的翅膀。”爸爸说得对，我在飞呢，飞得很高，我会飞啦！”乘着南风，小翼龙“扑棱扑棱”地越飞越高。“嗷——”霸王龙吼叫着。望着越来越远、越来越小的霸王龙，小翼龙想：霸王龙的伤好了，眼睛也能看的见了，太好啦！如果我真的是霸王龙，也可能和他成为朋友吧？再见，霸王龙!霸王龙不再追赶小翼龙了。他朝着星空小声地说：“我早就知道你是翼龙。。。。。我特地捉来了你最喜欢吃的鱼，想和你一起吃。。。。。然后，看着你的脸说声“谢谢”。真的，谢谢你啊！“霸王龙一直望着小翼龙消失的地方。。。。。。","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"廉洁运城微信公众号教育展馆试题","slug":"廉洁运城微信公众号教育展馆试题","date":"2017-05-24T17:52:19.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/廉洁运城微信公众号教育展馆试题.html","link":"","permalink":"https://blog.ccsyue.com/2017/廉洁运城微信公众号教育展馆试题.html","excerpt":"","text":"1、《中国共产党党内监督条例》规定，党内监督必须把纪律挺在前面，运用监督执纪“四种形态”，经常开展批评和自我批评、约谈函询，让“红红脸、出出汗”成为常态;（D.党纪轻处分、组织调整）成为违纪处理的大多数;党纪重处分、重大职务调整的成为少数;严重违纪涉嫌违法立案审查的成为极少数。A.组织处理 B.组织调整C.党纪轻处分 D.党纪轻处分、组织调整2、《中国共产党纪律处分条例》规定，在党内搞团团伙伙、结党营私、拉帮结派、培植私人势力或者通过搞利益交换、为自己营造声势等活动捞取政治资本的，给予（B.严重警告或者撤销党内职务）处分；情节严重的，给予留党察看或者开除党籍处分。A.警告或者严重警告 B.严重警告或者撤销党内职务C.严重警告 D.撤销党内职务3、《中国共产党纪律处分条例》规定，在社会保障、政策扶持、救灾救济款物分配等事项中优亲厚友、明显有失公平的，给予（C.警告或者严重警告）处分；情节严重的，给予撤销党内职务或者留党察看处分。 A.警告 B.严重警告 C.警告或者严重警告 D.撤销党内职务4、习近平总书记在十八届中央纪委第六次全体会议上的讲话中指出，各级干部特别是领导干部要善于从（A.政治）上看问题，站稳立场、把准方向，始终忠诚于党，始终牢记政治责任。A.政治 B.纪律 C.工作 D.大局5、《中国共产党党内监督条例》规定，有关国家机关发现党的领导干部违反党规党纪、需要党组织处理的，应当及时向（D.有关党组织）报告。A.同级纪委 B.组织部门C.同级党委 D.有关党组织6 《中国共产党廉洁自律准则》规定，党员应坚持公私分明，（B.先公后私），克己奉公。A.清白做人 B.先公后私C.艰苦朴素 D.甘于奉献7、《中国共产党廉洁自律准则》规定，党员应坚持（C.尚俭戒奢），艰苦朴素，勤俭节约。A.公私分明 B.崇廉拒腐C.尚俭戒奢 D.吃苦在前8、省委书记骆惠宁在全省领导干部会议上的讲话中指出，办好山西的事情，一定要坚定地以习近平总书记系列重要讲话精神为指引，牢牢把握正确方向，统筹落实（D.“五位一体”总体布局和“四个全面”战略布局），坚持省委近两年来的重大决策安排，努力把中国特色社会主义在山西坚持和拓展好。A.“四个全面”总体布局和“五位一体”战略布局B.“四个全面”总体布局和“五大发展”战略布局C.“六大发展”总体布局和“四个全面”战略布局D.“五位一体”总体布局和“四个全面”战略布局9、市委书记王宇燕在中国共产党运城市第四次代表大会上的报告中指出，各级领导班子特别是党员领导干部要自觉践行（C.“32字”工作导向），以“深化学习找差距，转变作风促发展”活动为抓手，进一步激发工作热情，以重如泰山的责任感、如履薄冰的压力感和时不我待的紧迫感，在位谋政，在职尽责，真正做到“为官一任、造福一方”。A.“20字”工作导向 B.“12字”工作方针C.“32字”工作导向 D.“16字”工作方针10、习近平总书记在十八届中央纪委第六次全体会议上的讲话中指出，要把（C.纪律建设）摆在更加突出位置，坚持纪严于法、纪在法前，健全完善制度，深入开展纪律教育，狠抓执纪监督，养成纪律自觉，用纪律管住全体党员。A.作风建设B.党风建设C.纪律建设D.监督执纪11、《中国共产党问责条例》规定，问责对象是各级党委（党组）、党的工作部门及其领导成员，各级纪委（纪检组）及其领导成员，重点是（C.主要负责人）。A.各级党委（党组）B.各级纪委（纪检组）C.主要负责人 D.直接责任人12、习近平总书记在第十八届中央纪律检查委员会第五次全体会议上的讲话中指出，全党必须牢记，反对腐败是党心民心所向。有（D.党心民心）作力量源泉，反腐败斗争必定胜利。A.人民群众B.纪检机关C.党员干部D.党心民心13、《中国共产党纪律处分条例》规定，在党内搞团团伙伙、结党营私、拉帮结派、培植私人势力或者通过搞利益交换、为自己营造声势等活动捞取政治资本的，给予（B.严重警告或者撤销党内职务）处分；情节严重的，给予留党察看或者开除党籍处分。A.警告或者严重警告B.严重警告或者撤销党内职务C.严重警告 D.撤销党内职务14、《关于新形势下党内政治生活的若干准则》规定，全党必须牢固树立政治意识、大局意识、核心意识、（C.看齐意识），自觉在思想上政治上行动上同党中央保持高度一致。A.组织意识B.规矩意识C.看齐意识D.纪律意识15、市委常委、市纪委书记李曾贵代表中共运城市纪委向市第四次党代会的工作报告中指出，用最严格的标准建设（A.忠诚干净）、让人民放心的纪检监察队伍，为全面构建良好政治生态、加快建设“三市一中心”提供坚强保障。A.忠诚干净B.忠诚于党C.干净担当D.纪律严明16、《中国共产党纪律处分条例》规定，不按要求报告或者不如实报告个人去向，情节较重的，给予（C.警告或者严重警告）处分。A.严重警告B.撤销党内职务C.警告或者严重警告D.留党察看17、《中国共产党纪律处分条例》规定，不顾群众意愿，盲目铺摊子、上项目，致使国家、集体或者群众财产和利益遭受较大损失的，对（D.直接责任者和领导责任者），给予警告或者严重警告处分；情节严重的，给予撤销党内职务或者留党察看处分。A.主体责任者B.直接责任者C.领导责任者D.直接责任者和领导责任者18、《中国共产党纪律处分条例》规定，对严重违犯党纪的党组织的纪律处理措施包括改组和（B.解散）。A.整顿B.解散C.撤销D.重组19、《党章》规定，中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的（C.领导核心）。A.领导者B.接班人C.领导核心D.领路人20、《中国共产党廉洁自律准则》规定，党员领导干部应（C.廉洁修身），自觉提升思想道德境界。A.廉洁从政B.廉洁用权C.廉洁修身D.廉洁齐家21、《中国共产党纪律处分条例》规定，生活奢靡、贪图享乐、追求低级趣味，造成不良影响的，给予（D.警告或者严重警告）处分；情节严重的，给予撤销党内职务处分。A.警告B.严重警告C.记过D.警告或者严重警告22、《中国共产党问责条例》规定，党的问责工作是由党组织按照职责权限，追究在党的建设和党的事业中失职失责党组织和党的领导干部的（D.以上都是）。A.主体责任B.监督责任C.领导责任D.以上都是23、《中国共产党纪律处分条例》规定，在社会保障、政策扶持、救灾救济款物分配等事项中优亲厚友、明显有失公平的，属于违反（B.群众纪律）的行为。A.廉洁纪律B.群众纪律C.工作纪律D.组织纪律24、“两学一做”是指：“学党章党规、学（D.系列讲话），做合格党员”学习教育。A.毛泽东思想B.邓小平理论C.科学发展观D.系列讲话25、《中国共产党廉洁自律准则》规定，“四个必须”是指中国共产党全体党员和各级党员领导干部必须坚定共产主义理想和中国特色社会主义信念，必须（C.坚持全心全意为人民服务根本宗旨），必须继承发扬党的优良传统和作风，必须自觉培养高尚道德情操，努力弘扬中华民族传统美德，廉洁自律，接受监督，永葆党的先进性和纯洁性A.坚持中国特色社会主义道路B.坚持四项基本原则C.坚持全心全意为人民服务根本宗旨D.坚持中国共产党的领导26、习近平总书记在十八届中央纪委第六次全体会议上的讲话中指出，要坚持高标准和守底线相结合，既要注重规范惩戒、严明纪律底线，更要引导人向善向上，坚守共产党人（B.精神追求），筑牢拒腐防变思想道德防线。A.价值追求B.精神追求C.理想信念D.政治品格27、《中国共产党问责条例》规定，对党的领导干部的问责方式包括：通报、诫勉、（D.组织调整或者组织处理）、纪律处分。A.批评教育B.组织调整C.组织处理D.组织调整或者组织处理28、《中国共产党党内监督条例》规定，各级党委应当支持和保证同级（D.以上都是）等对国家机关及公职人员依法进行监督，人民政协依章程进行民主监督，审计机关依法进行审计监督。A.人大B.政府C.监察机关、司法机关D.以上都是29、“四个全面”战略布局是指：全面建成小康社会、全面深化改革、全面依法治国、全面（C.从严治党）。A.依规治党B.稳定发展C.从严治党D.正风肃纪30、入党誓词的内容是：我志愿加入中国共产党，拥护党的纲领，遵守党的章程，履行党员义务，执行党的决定，严守党的纪律，保守党的秘密，（B.对党忠诚），积极工作，为共产主义奋斗终身，随时准备为党和人民牺牲一切，永不叛党。A.忠诚履职B.对党忠诚C.遵纪守法D.为党负责31、《中国共产党纪律处分条例》规定，李某违反有关规定组织、参加自发成立的老乡会、校友会、战友会；违反规定不报告、不如实报告个人有关事项。根据《中国共产党纪律处分条例》，李某的行为属于违反（B.组织纪律）的行为。A.政治纪律B.组织纪律C.廉洁纪律D.工作纪律32、王岐山在中国共产党第十八届中央纪律检查委员会第五次全体会议上的工作报告中指出，党风廉政建设和反腐败斗争永远在路上，我们面临的形势越复杂，肩负的任务越艰巨，就越要保持坚强政治（B.定力），有静气、不刮风，不搞运动、不是一阵子，踩着不变的步伐，把握节奏和力度，把党风廉政建设一步步引向深入。A.觉悟B.定力C.意识D.品格33、王某某利用职务影响为他人谋取利益，其配偶收受对方礼金、购物卡。根据《中国共产党纪律处分条例》，王某某的行为属于违反（C.廉洁纪律）的行为。A.政治纪律B.组织纪律C.廉洁纪律D.工作纪律34、《中国共产党党内监督条例》规定，建立健全党中央统一领导，党委(党组)全面监督，纪律检查机关（C.专责）监督，党的工作部门职能监督，党的基层组织日常监督，党员民主监督的党内监督体系。A.配合B.重点C.专责D.主要35、省委书记骆惠宁在全省领导干部会议上的讲话中指出，当下，关键是要按照全面从严治党的要求，持续推进党风廉政建设和反腐败斗争，着力构建良好政治生态，这一手要硬；关键是要自觉践行（B.新发展）理念，多策破解经济下行压力，着力推动经济稳步向好，这一手也要硬。A.六大发展B.新发展C.四个全面D.五位一体36、“四风”问题是指：形式主义、官僚主义、享乐主义和（D.奢靡之风）。A.奢靡主义B.自由主义C.奢侈浪费D.奢靡之风37、《中国共产党纪律处分条例》规定，对党员的纪律处分种类有（D.警告、严重警告、撤销党内职务、留党察看、开除党籍）。A.警告、严重警告、撤职、留党察看、开除党籍B.警告、降级、撤职、留党察看、开除党籍C.警告、记过、记大过、降级、撤职、开除D.警告、严重警告、撤销党内职务、留党察看、开除党籍38、中央八项规定是中共中央政治局关于改进（B.工作作风）密切联系群众的规定，强调要改进调查研究、精简会议活动、精简文件简报、规范出访活动、改进警卫工作、改进新闻报道、严格文稿发表、厉行勤俭节约。A.纪律作风B.工作作风C.群众作风D.党的作风39、《关于新形势下党内政治生活的若干准则》规定，坚持党的领导，首先是坚持（B.党中央）的集中统一领导。A.中央政治局B.党中央C.中央政治局常委D.中央主要负责人40、“四个自信”是指：道路自信、（C.理论自信）、制度自信、文化自信。A.发展自信B.政策自信C.理论自信D.信念自信41、《中国共产党纪律处分条例》规定，党员领导干部对违反政治纪律和政治规矩等错误思想和行为放任不管，搞无原则一团和气，根据《中国共产党纪律处分条例》，这种行为属于违反（A.政治纪律）的行为。A.政治纪律B.组织纪律C.廉洁纪律D.工作纪律42、习近平总书记在庆祝中国共产党成立95周年大会上的讲话中指出，各级领导干部要牢固树立正确权力观，保持高尚精神追求，敬畏人民、敬畏组织、敬畏（D.法纪），做到公正用权、依法用权、为民用权、廉洁用权，永葆共产党人拒腐蚀、永不沾的政治本色。A.权力B.纪律C.法律D.法纪43、习近平总书记在第十八届中央纪律检查委员会第三次全体会议上的讲话中指出，全党同志要深刻认识反腐败斗争的长期性、（C.复杂性）、艰巨性，以猛药去疴、重典治乱的决心，以刮骨疗毒、壮士断腕的勇气，坚决把党风廉政建设和反腐败斗争进行到底。A.困难性B.多变性C.复杂性D.顽固性44、省委书记骆惠宁在中国共产党山西省第十一次代表大会上的报告中指出，各级党组织要对本地区本单位的（B.政治生态）负责，切实增强管党治党意识和能力，加大领导和统筹力度，真管真严、敢管敢严、长管长严，建设廉洁政治，把全面从严治党各项任务落到实处。A.政治环境B.政治生态C.党的建设D.党风廉政建设45、省委书记骆惠宁在中国共产党山西省第十一次代表大会上的报告中指出，各级党组织要站在党的建设和党的事业发展高度，认真履行全面从严治党主体责任，党委书记要负好主责、首责、全责，班子成员自觉履行（C.“一岗双责”），纪委认真履行监督执纪问责，建立横向到边纵向到底、以上率下层层落实的主体责任体系。A.主体责任B.监督责任C.“一岗双责”D.两个责任46、《党章》规定，党组织必须严格执行和维护党的纪律，共产党员必须自觉接受（B.党的纪律）的约束。A.党章B.党的纪律C.党内法规D.党组织47、《中国共产党廉洁自律准则》规定，党员领导干部应廉洁从政，自觉（A.保持人民公仆本色）。A.保持人民公仆本色B.维护人民根本利益C.提升思想道德境界D.带头树立良好家风48、“四讲四有”是指：讲政治、有信念，（A.讲规矩、有纪律），讲道德、有品行，讲奉献、有作为A.讲规矩、有纪律B.讲团结、有纪律C.讲纪律、有规矩D.讲民主、有规矩49、《中国共产党党内监督条例》规定，党内监督的重点对象是党的领导机关和领导干部特别是（B.主要领导干部）A.党组织负责人B.主要领导干部C.领导班子成员D.高级干部50、习近平总书记在中央政治局常委会议审议巡视工作条例修订稿时的讲话中指出，依规治党，首先是把（D.纪律和规矩）立起来、严起来，执行起来。A.纪律B.政治纪律C.规矩D.纪律和规矩51、毛泽东在95周年……面临最大的威胁是（腐败）","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"中央、省、市纪委全会精神知识测试 2017年（一）","slug":"中央、省、市纪委全会精神知识测试 2017年（一）","date":"2017-05-12T10:09:34.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/中央、省、市纪委全会精神知识测试 2017年（一）.html","link":"","permalink":"https://blog.ccsyue.com/2017/中央、省、市纪委全会精神知识测试 2017年（一）.html","excerpt":"","text":"《十八届中央纪委七次全会公报》提出，以强有力问责督促各级党组织履行全面从严治党政治责任。推动各级党组织解决党内政治生活中存在的突出问题，抓住（ “关键少数” ），层层落实责任。严格执行问责条例，加大问责力度，激发担当精神。 习近平在十八届中央纪委七次全会上指出，强化（ 党内监督 ），重在日常、贵在有恒。党的各级组织要敢于较真碰硬，见物见人见细节，从点滴抓起，从具体问题管起，及时发现问题、纠正偏差。 王宇燕在市纪委四届二次全会上指出，要坚持重心下移、重点整治，深入开展扶贫领域专项整治，严肃查处群众身边的不正之风和腐败问题，推动全面从严治党向基层延伸；切实加强对市县机关（ 中层 ）干部违纪违法问题的监督检查，为全市创新驱动、转型升级，加快经济社会发展创造优良环境。 习近平在十八届中央纪委七次全会上强调，要坚持共产党人价值观，不断坚定和提高政治觉悟。（ 修身立德 ）是为政之基，从不敢、不能到不想，要靠铸牢理想信念这个共产党人的魂。 王宇燕在市纪委四届二次全会上指出，要坚持滴水穿石、锲而不舍，紧盯节点，层层设防，一寸不让，着力解决和纠正对中央、省委、市委决策部署（ 搞变通、打折扣 ）的深层次“四风”问题。 《市纪委四届二次全会决议》提出，坚持把严格管理干部和热情关心干部结合起来，坚决落实（ “三个区分开来” ）的要求，为敢于担当的干部担当、为敢于负责的干部负责。 《市纪委四届二次全会决议》提出，织密扎牢党内监督网，把任用干部和（ 监督干部 ）统一起来，通过谈心谈话、约谈督促、报告工作、述责述廉、考察考核、巡察监督、严肃问责等方式，强化责任、促进担当。 《省十一届纪委二次全会决议》提出，要层层落实管党治党政治责任，进一步增强谋划力、执行力、落实力，强化执纪监督，用好（ 问责利器 ），倒逼责任落实。 骆惠宁在省十一届纪委二次全会上指出，要坚持标本兼治，围绕构建不敢腐、不能腐、不想腐的机制，把思想建党和（ 制度治党 ）结合起来，推动全面从严治党向纵深发展。 习近平在十八届中央纪委七次全会上强调，党的十八大以来，我们在开展党风廉政建设和反腐败斗争中得到了一些重要启示，主要是：一是要（ 坚持高标准和守底线相统一 ）；二是要坚持抓惩治和抓责任相统一；三是要坚持查找问题和深化改革相统一；四是要坚持选人用人和严格管理相统一。这些重要启示和经验，要长期坚持。 王宇燕在市纪委四届二次全会上指出，要坚持（ 失责必问 ）、问责必严，切实抓好《问责条例》的贯彻执行，发挥震慑警示效应。 《十八届中央纪委七次全会公报》提出，把纠正“四风”往深里抓、实里做，紧盯老问题，关注新动向，坚决防止反弹回潮。对执纪审查对象存在“四风”问题的，要先于其他问题（ 查处和通报 ）。 骆惠宁在省十一届纪委二次全会上指出，要用严格的标准选对人用好人，把（ 政治标准 ）放在首位，不断优化干部队伍结构，严肃市县人大、政府、政协换届纪律，抓好后备干部队伍建设，坚持严管与厚爱相结合，让良好政治生态成为山西改革发展的“环境名片”。 《省十一届纪委二次全会决议》提出，各级党组织要保持党内政治生活的原则性和战斗性，严明政治纪律和政治规矩，强化党内监督，严把政治关、（ 廉洁关 ），营造风清气正的选人用人氛围。 骆惠宁在省十一届纪委二次全会上指出，各级党组织和广大党员干部要自觉对照校正自己的思想、作风、行为，严格按照党的组织原则和（ 党内政治生活准则 ）办事，主动接受党的纪律约束和各方面监督，逐步习惯在有约束的环境中工作生活。 习近平在十八届中央纪委七次全会上强调，党的高级干部要做严肃党内政治生活的表率，始终把握正确政治方向，坚持政治立场和政治原则，遵守政治纪律和政治规矩，坚守正道、弘扬正气，坚持原则、敢抓敢管。增强政治意识、大局意识、核心意识、看齐意识，最终要落脚在（ 看齐 ）上。 《市纪委四届二次全会决议》提出，要重点查处一批（ 中间环节 ）存在的办事拖拉、慵懒散慢，滥用职权、吃拿卡要等问题，切实优化发展环境、卸减发展负担。 习近平在十八届中央纪委七次全会上指出，深入推进全面从严治党，必须坚持( 标本兼治 )。管党治党从宽松软走向严紧硬，需要经历一个砥砺淬炼的过程，要严字当头、实字托底，步步深入、善作善成。 《十八届中央纪委七次全会公报》提出，纪检机关要履行党内监督（ 专责机关 ）职责，以党内政治生活准则和党内监督条例为尺子，加强对贯彻落实六中全会精神情况的监督检查，严明政治纪律和政治规矩，坚决维护党的团结统一。 骆惠宁在省十一届纪委二次全会上指出，要对照巡视工作条例的要求，进一步完善相关制度，提高精准发现问题的能力，督促整改落实。要深化（ 政治 ）巡视，坚决维护党的领导核心和党中央权威。","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"故事：肚子里有个火车站","slug":"肚子里有个火车站","date":"2017-04-25T21:00:40.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/肚子里有个火车站.html","link":"","permalink":"https://blog.ccsyue.com/2017/肚子里有个火车站.html","excerpt":"","text":"美味食物进嘴巴，牙齿把它咬成粒。颗粒来到肚子中，精灵把它变成泥。火车厢被装满了，一路飞驰不休息。肚子里的火车站，每天都在陪伴你！ 这个小姑娘叫朱莉娅。她刚刚从幼儿园出来，走在回家的路上。突然，朱莉娅听到了一阵“咕噜噜”的声音。 这个声音是从她的肚子里发出来的！ 朱莉娅不知道，她的肚子里有一个火车站！肚子精灵们就住在这里，他们的工作是把食物弄成泥。这会儿，小精灵们都懒洋洋地躺着，因为大家无事可做。火车也停在那里，整个肚子火车站里静悄悄。 突然，那奇怪的声音又响了起来。原来上一个小精灵睡着了。 他在梦中偶尔打起响亮的呼噜，这就是朱莉娅听到的“咕噜噜”的声音。 朱莉娅终于到家了，一顿美味的午餐正摆在桌子上。她开始狼吞虎咽地吃起来。很快，一大团面条通过食道掉进了肚子火车站里。小精灵们立刻醒了，从各自的洞穴里爬出来，准备开始工作。他们都是一些非常勤劳的小家伙。 可是这次的情况让他们吓了一跳！ 又粗又长的面条落下来，把他们缠住了； 整片的生菜叶飘下来，像床单一样把他们裹住了； 大肉块沉甸甸的，像石头一样四处乱滚…… 火车站里乱作一团，小精灵都生气地大叫起来。 “这个朱莉娅，根本就没有好好嚼嘛！” “总是什么都靠我们！” “这些食物太大了，我们怎么办啊？” 尽管生气，小精灵们还是开始工作了。不然还能怎么办？ 火车必须准时出发，但是要把这么一大堆食物弄碎，要花很多很多时间和力气，因此工作进展得很慢。食物越来越多，堆得像小山一样高。 这时，出事了！一大块东西不偏不倚地砸到了一个小精灵的脑袋上，他立刻晕了过去。在幻觉中，他成了一名导游，带着游客在肚子火车站里参观。小精灵告诉游客们：“如果所有食物都被嚼得很碎，那落下来的就会是小段面条、小片菜叶、小块苹果和小肉丁，即使它们掉在哪个小精灵的头上，也不会把他弄疼。” “我们会很快地把食物装进火车车厢，还会在里面加入很多液体，这些液体对消化非常重要。最后，我们会把液体和食物搅在一起，让它们变成泥。这个过程对我们来说特别有趣！” “一切都准备好，火车就可以出发了！小精灵司机会跳到火车头上，激动地等着门卫打开大门。这扇大门是通往小肠的入口。” 车站里空荡荡的，只剩下最后一列火车了，其他火车都装满泥出发了。没有了那么多火车，这座食物大山怎么被运走呢？ 小精灵们正在犯愁时，突然刮来一阵刺骨的寒风。接着，一堆雪泥状的东西从食管里呼呼地喷涌出来，它们是香草冰淇淋和巧克力奶昔！ 小精灵们开始举行抗议活动。他们大声喊着口号，气呼呼地砸墙，使劲跺脚。 这下朱莉娅可惨了，她的肚子开始疼起来！ 朱莉娅生病了，因为她吃得太多、太快了。 终于，在小精灵们快被冻僵的时候，冰雪开始融化了。 一阵温暖的雨从天而降。 原来，朱利娅正躺在床上喝热水，她的肚子上还放了一个热水袋。 过了很长时间，一列列火车才返回了肚子火车站，此时它们已经被卸空了。小精灵们把剩下的食物装进车厢，大山慢慢地消失了。小精灵们现在又可以休息、玩耍和美美地睡觉了。 朱莉娅感觉好多了，她的肚子不疼了，高兴地翻了许多跟头。肚子火车站里的小精灵们觉得好像坐上了过山车……他们已经分不清哪是上，哪是下了。","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"河津市僧楼镇侯家庄简介","slug":"河津市僧楼镇侯家庄简介","date":"2017-02-18T15:01:47.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/河津市僧楼镇侯家庄简介.html","link":"","permalink":"https://blog.ccsyue.com/2017/河津市僧楼镇侯家庄简介.html","excerpt":"","text":"河津市僧楼镇侯家庄村地处河津市北域吕梁山南五里之处，北与古镇店南午芹毗邻，东与小张村遥相互望，西因太涧与尹村一衣带水，南与僧楼李家堡接壤。清代属僧张里管辖，民国初归第三区（樊村），民国末属小张编村，村委会现由僧楼镇所辖，全村现有2500人，耕地1200亩。侯家庄，看之名符其实，即侯姓人家居住的村庄，村民90%以上姓侯。然而，追根溯源，该村侯姓家族在唐代中期以前实则姓卢。据侯氏家谱记载，唐宪宗元和四年（809年），成德（今河北一带）节度使王士真去世，其子王承宗擅自承袭节度使之位，并拒不奉诏，而且私下囚禁朝廷命官，随之又起兵反叛。宪宗为革除河北藩镇世袭节度使的弊病并征治逆臣，诏令削除王承宗的官职爵位，并派兵征讨。秘书监卢虔之子昭义节度使卢从史，起先请求带领本部兵马平叛，后来却私下交结王承宗，并拖延不出兵。宪宗用宰相裴洎计，敕令左神策军中尉吐突承璀将卢从史诱捕，押至京城后贬官欢州（今越南北部），随后又流放并赐死于康州（今广东南部）并流放其子。 侯氏族祖原为卢虔近族，从史犯案，族人恐株连灭族，遂改姓为侯。之后定居于此，起村名曰“侯家庄”。 从此安居乐业，繁衍生息， 数代之后至元朝末年，仲良一支迁于孙彪里（芦庄），后又迁于西窑头、何家庄、樊家庄等村长期定居。仲行一支迁于黄村至今。唯仲荣一支植根守土，在侯家庄永久居住。 另外，笔者曾做过广泛调查，从而得知，如今河津境内诸如义唐、东庄、伏伯、连伯、峻岭等等许多村庄现居侯姓村民，根据祖辈代代传说，基本都是由这三支衍传而来，归根结蒂其族祖都在侯家庄。即使西侯家庄现居住的少数侯姓家族，是否与我村侯姓有血脉渊源，暂无据可考，但就该村侯姓亦有中唐时期由卢改姓为侯的传说而言，很有可能其根祖也在我们村（东侯家庄）。如果说该村侯姓是否由我村迁出尚有待深稽的话，那么家谱所记，陕西宜川台水村、韩城桥南村、万荣皇甫村、乡宁瓜峪背阴山之侯姓，根系侯家庄就无需存疑了。侯家庄村民绝大多数为祖居侯姓之外，尚有薛、高、张等老户，其中为薛姓较多，目前计有50户近200人。据传，于侯家庄村东，南午芹与贺家巷之间古有薛村，因洪武年间，山洪暴涨，（小张村尼庵庙碑文有记）毁其村庄，薛姓村民拖家携口就近迁入南午芹东头（现忠信村）和侯家庄，根据六、七十年代在村东地打井掘出炉灶和院基之类，可以证明，确有其村。真有其事，而高、张等户，于何年何月迁入，便无从考证了。至于蒋、裴、徐、王、赵、刘、吕等姓均为解放前后迁入，那便人所共知了。由于侯姓村民历代崇德向善，热情包容，所以各姓村民无论人户多寡，均平等相处，共娱和乐。侯家庄村交通便利，地理优越，北有稷西公路东西横贯，东有东张公路南北纵跨，西有新修太涧大道直指瓜峪口。全村所有耕地自古以来均属瓜峪灌区，清洪两灌，得天独厚，加之村东之地在60年代以前地下水源十分丰富，人们就地掘井，汲水灌溉，庄稼旱涝保收。故此世代以来，村民大多以农耕为主。侯家庄村历史悠久，村民自古儒、道、释三教并崇，文化遗址较多。村中有三官（天、地、人）庙（庙址在现学校），观音庙（庙址在现村东井房），百王庙（庙址在现广杰门前），祖师庙（庙址在现小恩门前），老爷(关公）庙（庙址在现永福门前），土地庙（庙址在麻地现作栋猪场)，村娘娘庙(庙址在现村舞台背后)，玉皇庙(庙址在现东张路三朱门前路东)。这些庙宇，有些毁于抗战时期，有些在解放初或文革中被拆除。尤其值得一提的是，村西北有一座寺院（寺址在现寺台地科子门前路西），因年代久远，早已被年长日久的洪水淤泥淹没于地下。据九十多岁的老年人说，他们幼小时，该寺院尚且露厦顶于地面，孩子们常从其檐下的小窗口爬进去玩耍，赶到上世纪中期，寺院遗迹就全然从地面消失，不过七十年代大搞北水南调在该处挖渠还从地下挖出了不少筒瓦。这样，单从这座寺院来说，侯家庄历史的久远便可见一斑了。","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"宗族起源","slug":"宗族起源","permalink":"https://blog.ccsyue.com/tags/宗族起源/"}]},{"title":"采集框架pyspider","slug":"采集框架pyspider","date":"2017-02-14T15:44:29.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/采集框架pyspider.html","link":"","permalink":"https://blog.ccsyue.com/2017/采集框架pyspider.html","excerpt":"","text":"英文文档：http://docs.pyspider.org/en/latest/中文文档：http://www.pyspider.cn/项目：https://github.com/binux/pyspiderdemo：http://demo.pyspider.org/个人博客：https://binux.blog/","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"pyspider","slug":"pyspider","permalink":"https://blog.ccsyue.com/tags/pyspider/"}]},{"title":"使用docloud搭建c9 ide","slug":"使用docloud搭建c9 ide","date":"2017-01-26T21:35:43.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/使用docloud搭建c9 ide.html","link":"","permalink":"https://blog.ccsyue.com/2017/使用docloud搭建c9 ide.html","excerpt":"","text":"GFW 这道墙让meteor安装变成了一件头疼的事情。如果你有一个可用来安装docker的linux服务器。不如试试docloud来搭建一个WEB IDECoding webide 的社区版docker，没弄成功。。。。 daocloud 设置 使用镜像：index.docker.io/deffyc/c9:v0.1 ，搜索deffyc/c9. 基础项 容器-&gt;主机 描述 端口 3000-&gt;3000,8080-&gt;80 3000端口用来跑meteor应用，8080端口来启动c9（80端口得用sudo，这样c9中的终端就是root，不利于meteor开发） volumn /home/c9/workspace-&gt;/home/rootadmin/workspace docker默认会创建用户：c9 ，密码：rules，而/home/rootadmin/workspace是宿主机的工作目录 环境变量： $user-&gt;c9,$pass-&gt;rules,$LC_ALL-&gt;C 去本地化 docker设置 访问宿主机域名即可访问webide，使用环境变量$user,$pass登录。之后： source /home/c9/.bashrc 生效2.接下来生成SSH keys，添加到github或coding或码云中。3.开启编辑之旅吧。记得github中的c9/core 安装于/home/c9/c9sdk目录下端口的一些探索360网站卫士和百度匀加速似乎是不支持非80端口访问宿主机3000端口的。而 dnspod 目前测试来看是支持http://域名:端口访问的。因docker proxy 占用了3000端口，nginx反代似乎不能用了，改环境变量里的8080-&gt;8080，用nginx反代即可，贴出配置供参考。 nginx websocket反代注意：nginx websocket document 123456789101112131415161718192021222324252627282930313233httpmap $http_upgrade $connection_upgrade &#123; default upgrade; &apos;&apos; close;&#125; upstream c9 &#123; server 172.17.0.2:8080;&#125;server &#123; listen 80; server_name c.ccsyue.com; location / &#123; proxy_pass http://c9; proxy_http_version 1.1; proxy_set_header Upgrade $http_upgrade; proxy_set_header Connection $connection_upgrade; &#125; upstream meteor &#123; server 127.0.0.1:3000;&#125;server &#123; listen 80; server_name m.ccsyue.com; location / &#123; proxy_pass http://meteor; proxy_http_version 1.1; proxy_set_header Upgrade $http_upgrade; proxy_set_header Connection $connection_upgrade; &#125;&#125;&#125;","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"webide","slug":"webide","permalink":"https://blog.ccsyue.com/tags/webide/"}]},{"title":"meteor安装","slug":"meteor安装","date":"2017-01-25T02:40:07.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/meteor安装.html","link":"","permalink":"https://blog.ccsyue.com/2017/meteor安装.html","excerpt":"","text":"1. 安装若123456789//ps:1.4.2 linux：http://blogstatic.ccsyue.com/meteor.install.sh | shcurl https://install.meteor.com/ | sh//分两步curl https://install.meteor.com/ &gt; meteor.install.sh//修改135行左右软件包地址为：TARBALL_URL=&quot;https://d3sqy0vbqsdhku.cloudfront.net/packages-bootstrap/$&#123;RELEASE&#125;/meteor-bootstrap-$&#123;PLATFORM&#125;.tar.gz&quot;//ps:最新版已下载至 http://blogstatic.ccsyue.com/packages-bootstrap/1.4.2.3/meteor-bootstrap-os.linux.x86_64.tar.gzhttp://blogstatic.ccsyue.com/packages-bootstrap/$&#123;RELEASE&#125;/meteor-bootstrap-$&#123;PLATFORM&#125;.tar.gz 2. npm镜像替换1meteor npm config set registry http://registry.npm.taobao.org/ 3. IDE 安装https://code.visualstudio.com/https://atom.io/c9 4. meteor不能在root下运行无法欺骗meteor：修改/etc/passwd,/etc/shadow下的第一个root字符串为自定义用户名adduser 用户名若添加了用户名记得修改 /etc/sudoers或者 ：usermod -aG sudo 用户名","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"meteor","slug":"meteor","permalink":"https://blog.ccsyue.com/tags/meteor/"}]},{"title":"故事：退休的鞋子","slug":"退休的鞋子","date":"2017-01-09T12:29:02.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2017/退休的鞋子.html","link":"","permalink":"https://blog.ccsyue.com/2017/退休的鞋子.html","excerpt":"","text":"人们总是把穿旧了的鞋子当作垃圾扔掉。鞋子们可从来都不这么想。它们说：“我们只是从人们那儿退休了。对一只鞋子来说，总是要等到退休以后，真正美好的生活才刚刚开始。” 旧鞋子们被送到了郊外的垃圾站。 垃圾站当然不是个好地方，但旧鞋子们的新生活都是从这儿开始的。 一群老鼠在垃圾站里找到了一只旧皮靴。老鼠们如获至宝，马上派一大队人马，把皮靴拖进了田野里。 老鼠们正在跟农民的看家狗打仗。狗仗着自己个头大，经常欺侮小老鼠。现在，聪明的小老鼠们将皮靴改装成了一辆野战坦克。皮靴上原先系鞋带的那两排小洞被很好地利用起来，当作射击孔。老鼠们都躲在皮靴里，皮靴藏在树后面。看见狗来了，老鼠们枪炮齐发，无数粒沙子一齐射向它。不一会儿，狗就被打得汪汪叫着，夹起尾巴，逃回家去了。 蚂蚁们找到一只人造革的小童鞋，高兴万分。它们一直想要一艘小船，能盛得下一个蚂蚁大家庭，能让它们全家一起去远航。现在，小船有了，远航可以开始了。 当然，最受欢迎的，还是妈妈们的高跟鞋。你猜猜看，田野里、森林里的小家伙们用高跟鞋做什么呢?它们用来建游乐场，做滑梯!你没想到吧? 它们把小木棍做的梯子搭在高高的鞋跟上，瓢虫呀，蚂蚁呀，小田鼠呀，一个个轮流沿着梯子爬上去，然后，哧溜!哧溜!从鞋跟滑到鞋尖，好玩极了! …… 这就是鞋子们退休以后的故事。星期天跟爸爸妈妈到郊外去玩时，你留心看看土坎下面、水沟边上和森林里有没有旧鞋子。如果有，你仔细地瞧一瞧，准能瞧到点儿什么有趣的事。","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"教师评价数据收集","slug":"教师评价数据收集","date":"2016-12-25T21:00:53.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/教师评价数据收集.html","link":"","permalink":"https://blog.ccsyue.com/2016/教师评价数据收集.html","excerpt":"","text":"工作上需要一个评教收集工具，未用框架，结构简陋，请勿效仿。局域网下使用，机器落后（IE6凑合运行），匿名评教，ip验证。请在web根目录下新建目录cache/tongjiset，并将下列文件平行放置。conn.php放置数据库配置信息。源码如下： conn.php123456789101112&lt;?php $conn=mysqli_connect(\"192.168.3.6\",\"username\",\"password\",\"database\"); if (mysqli_connect_errno()) &#123; echo \"连接失败: \" . mysqli_connect_error(); &#125; @session_start();//启动session会话 mysqli_query($conn,\"SET NAMES 'utf8'\");//设置字符集和页面代码统一 require_once(\"function.php\");//加载函数库 //require_once(\"config.php\");//加载配置信息?&gt; function.php12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061&lt;?php/** 此函数不能再iis下工作，但是效率比较高* @return string user IP address*/function getUserHostAddressNoIIS() &#123; switch (true) &#123; case isset($_SERVER[\"HTTP_X_FORWARDED_FOR\"]): $ip = $_SERVER[\"HTTP_X_FORWARDED_FOR\"]; break; case isset($_SERVER[\"HTTP_CLIENT_IP\"]): $ip = $_SERVER[\"HTTP_CLIENT_IP\"]; break; default: $ip = $_SERVER[\"REMOTE_ADDR\"] ? $_SERVER[\"REMOTE_ADDR\"] : '127.0.0.1'; &#125; if (strpos($ip, ', ') &gt; 0) &#123; $ips = explode(', ', $ip); $ip = $ips[0]; &#125; return $ip;&#125;function jifenTest($fenshu,$str,&amp;$flag) &#123; if(empty($fenshu) || !is_numeric($fenshu) || $fenshu&gt;100 || $fenshu&lt;0)&#123; mysqli_close($conn); echo (\"&lt;script language='javascript' type='text/javascript'&gt;alert('\".$str.\"必须大于0小于等于100');&lt;/script&gt;\"); $flag = false; &#125;&#125;function selectTest($select,$str,&amp;$flag) &#123; if(empty($select) || strlen($select)&lt;2)&#123; mysqli_close($conn); echo (\"&lt;script language='javascript' type='text/javascript'&gt;alert('\".$str.\"必须选择');&lt;/script&gt;\"); $flag = false; &#125;&#125;function buTD(&amp;$i,$rowNum)&#123; $nullTdNo=ceil($i/$rowNum)*$rowNum-$i; for($j=0;$j&lt;$nullTdNo;$j++)&#123; echo \"&lt;td&gt;&amp;nbsp;&lt;/td&gt;\"; &#125; $nowI=$i+$nullTdNo; $i=$nowI; $trFlag=$i%$rowNum; echo $trFlag==($rowNum-1)?\"&lt;/tr&gt;\":\"\"; echo \"&lt;/table&gt;\";&#125;//当前时间-30分钟function getlastTime()&#123;return date(\"Y-m-d H:i:s\",strtotime(\"-30 minute\"));&#125;function redirect($url)&#123;header('Location: '.$url);&#125;?&gt; index.php12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273&lt;?phperror_reporting(E_ALL &amp; ~E_NOTICE);require_once('conn.php');?&gt;&lt;html&gt;&lt;head&gt;&lt;title&gt;选择班级&lt;/title&gt;&lt;script languag=\"javascritp\"&gt;function choose(classno)&#123; if(confirm(\"电脑在30分钟内只能填写一份教师评价表，你选择了 \"+ classno + \"班 是否继续？\"))&#123; form1.action=\"tc.php\"; form1.classno.value=classno; form1.submit(); &#125;&#125;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;?php $rowNum=5; $filename=\"cache/static_index.html\"; $status=filemtime($filename)+30&gt;time();//判断文件创建及修改时间距当前时间是否超过30秒 if(file_exists($filename)&amp;&amp;$status)&#123; $str=file_get_contents($filename); echo $str; &#125;else&#123; $sql_classz=\"select gradeno,classno from classz\"; $query = mysqli_query($conn,$sql_classz); if(mysqli_num_rows($query)&lt;=0)&#123; mysqli_free_result($query); mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('班级不存在!');history.back(1);&lt;/script&gt;\"); &#125;else&#123; ob_start(); $i=0; $lastGradeno=\"\"; while($row=mysqli_fetch_array($query))&#123; $trFlag=$i%$rowNum; if($row[\"gradeno\"]!=$lastGradeno)&#123; if($i!=0)&#123; buTD($i,$rowNum); &#125;?&gt; &lt;h2&gt;&lt;?php echo $row[\"gradeno\"] ?&gt;&lt;/h2&gt; &lt;table width=\"100%\" border=\"1\" align=\"center\" cellpadding=\"5\" cellspacing=\"1\"&gt;&lt;?php &#125; echo $trFlag==0?\"&lt;tr&gt;\":\"\"; echo \"&lt;td&gt;&lt;a href=\\\"javascript:choose('\".$row[\"classno\"].\"')\\\"&gt;\".$row[\"classno\"].\"班&lt;/a&gt;&lt;/td&gt;\"; echo $trFlag==($rowNum-1)?\"&lt;/tr&gt;\":\"\"; $lastGradeno=$row[\"gradeno\"]; $i++; &#125; buTD($i,$rowNum); $content= ob_get_contents();//从缓存中获取内容 ob_end_clean();//关闭缓存并清空 file_put_contents($filename, $content); echo $content; &#125; &#125;?&gt;&lt;form action=\"\" method=\"post\" name=\"form1\"&gt;&lt;input name=\"classno\" value=\"\" type=\"hidden\"/&gt;&lt;/from&gt;&lt;/body&gt;&lt;/html&gt;&lt;?php mysqli_close($conn);?&gt; tc.php123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139140141142143144145146147148149150151152153154155156157158159160161162163164165166167168169170171172173174175176177178179180181182183184185186187188189190191192193194195196197198199200201202203204205206207208209210211212213214215216217218219220221222223224225226227228229230231232233234235236237238239240241242243244245246247248249250251252253254255256257258259260261262263264265266267268269270271272273274275276277278279280281282283284285286287288289290291292293294295296297298299300301302303304305306307308309310311312313314315316317318319320321322323324325326327328329330331332333334335336337338339340341342343344345346347348&lt;?phperror_reporting(E_ALL &amp; ~E_NOTICE);require_once('conn.php');?&gt;&lt;html&gt;&lt;head&gt;&lt;title&gt;学生评教&lt;/title&gt;&lt;style&gt;.jifen &#123;width:40px;&#125;.other &#123;width:60px;&#125;&lt;/style&gt;&lt;script&gt;function check()&#123;return confirm(\"确定要提交吗？\");&#125;&lt;/script&gt;&lt;/head&gt;&lt;?php $ip =getUserHostAddressNoIIS(); //客户端是否输入classno $classno=trim($_POST[\"classno\"]); if(empty($classno) || !is_numeric($classno))&#123; mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('班级不存在!');window.location.href=\\\"index.php\\\";&lt;/script&gt;\"); &#125; //数据库是否存在classno $sql_pingjiao=\"select * from classz where classno='\".$classno.\"' and editflag=1\"; $query = mysqli_query($conn,$sql_pingjiao); if(mysqli_num_rows($query)&lt;=0)&#123; mysqli_free_result($query); mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('所选班级不能填报!');window.location.href=\\\"index.php\\\";&lt;/script&gt;\"); &#125;else if ($row=mysqli_fetch_array($query))&#123; $classno=$row[\"classno\"]; $banzhuren=$row[\"banzhuren\"]; $yuwen=$row[\"yuwen\"]; $shuxue=$row[\"shuxue\"]; $waiyu=$row[\"waiyu\"]; $wuli=$row[\"wuli\"]; $huaxue=$row[\"huaxue\"]; $shengwu=$row[\"shengwu\"]; $zhengzhi=$row[\"zhengzhi\"]; $lishi=$row[\"lishi\"]; $dili=$row[\"dili\"]; $tiyu=$row[\"tiyu\"]; $gradeno=$row[\"gradeno\"]; &#125; $action = isset($_GET[\"act\"]) ? $_GET[\"act\"] : \"\"; if($action==\"pingjiao\")&#123; $pingjiao_id=$_POST[\"pingjiao_id\"]; $classno_name=$_POST[\"classno_name\"]; $banzhuren_name=$_POST[\"banzhuren_name\"]; $yuwen_name=$_POST[\"yuwen_name\"]; $shuxue_name=$_POST[\"shuxue_name\"]; $waiyu_name=$_POST[\"waiyu_name\"]; $wuli_name=$_POST[\"wuli_name\"]; $huaxue_name=$_POST[\"huaxue_name\"]; $shengwu_name=$_POST[\"shengwu_name\"]; $zhengzhi_name=$_POST[\"zhengzhi_name\"]; $lishi_name=$_POST[\"lishi_name\"]; $dili_name=$_POST[\"dili_name\"]; $tiyu_name=$_POST[\"tiyu_name\"]; $qita_name=$_POST[\"qita_name\"]; $youmo_name=$_POST[\"youmo_name\"]; $aixin_name=$_POST[\"aixin_name\"]; $qianneng_name=$_POST[\"qianneng_name\"]; $xihuan_name=$_POST[\"xihuan_name\"]; $jianyi_name=$_POST[\"jianyi_name\"]; $flag=true; jifenTest($yuwen_name,$yuwen.\"教师得分\",$flag); jifenTest($shuxue_name,$shuxue.\"教师得分\",$flag); jifenTest($waiyu_name,$waiyu.\"教师得分\",$flag); jifenTest($wuli_name,$wuli.\"教师得分\",$flag); jifenTest($huaxue_name,$huaxue.\"教师得分\",$flag); jifenTest($shengwu_name,$shengwu.\"教师得分\",$flag); jifenTest($zhengzhi_name,$zhengzhi.\"教师得分\",$flag); jifenTest($lishi_name,$lishi.\"教师得分\",$flag); jifenTest($dili_name,$dili.\"教师得分\",$flag); selectTest($youmo_name,\"教学中最具幽默感的教师 必须选择\",$flag); selectTest($aixin_name,\"最具爱心的教师 必须选择\",$flag); selectTest($qianneng_name,\"最能激发学生潜能的教师 必须选择\",$flag); selectTest($xihuan_name,\"你最喜欢的教师 必须选择\",$flag); selectTest($banzhuren_name,\"对班级工作的整体评价 必须选择\",$flag); if($flag)&#123; $pingjiao_update=\"update `pingjiao` set \" .\"banzhuren='\".$banzhuren_name.\"',\" .\"yuwen=\".$yuwen_name.\",\" .\"shuxue=\".$shuxue_name.\",\" .\"waiyu=\".$waiyu_name.\",\" .\"wuli=\".$wuli_name.\",\" .\"huaxue=\".$huaxue_name.\",\" .\"shengwu=\".$shengwu_name.\",\" .\"zhengzhi=\".$zhengzhi_name.\",\" .\"lishi=\".$lishi_name.\",\" .\"dili=\".$dili_name.\",\" .(empty($tiyu) || !is_numeric($tiyu)?\"\":\"tiyu=\".$tiyu_name.\",\") .(empty($qita) || !is_numeric($qita)?\"\":\"qita=\".$qita_name.\",\") .\"youmo='\".$youmo_name.\"',\" .\"aixin='\".$aixin_name.\"',\" .\"qianneng='\".$qianneng_name.\"',\" .\"xihuan='\".$xihuan_name.\"',\" .\"endtime='\".date(\"Y-m-d H:i:s\").\"',\" .\"jianyi='\".$jianyi_name.\"' where id=\".$pingjiao_id; mysqli_query($conn,$pingjiao_update); // 提交事务 mysqli_commit($conn); echo(\"&lt;script language='javascript' type='text/javascript'&gt;alert('评价成功!');&lt;/script&gt;\"); &#125; &#125;else&#123; $sql_pingjiao=\"select * from pingjiao where classno='\".$classno.\"' and ip='\".$ip.\"'\"; $query = mysqli_query($conn,$sql_pingjiao); if(mysqli_num_rows($query)&lt;=0)&#123; mysqli_free_result($query); $sql_pingjiao=\"select * from pingjiao where createtime&gt;'\".getlastTime().\"' and ip='\".$ip.\"'\"; $query = mysqli_query($conn,$sql_pingjiao); if(mysqli_num_rows($query)&lt;=0)&#123; //mysqli_free_result($query); $pingjiao_create=\"INSERT INTO `pingjiao` (`gradeno`,`classno`,`ip`) VALUES ('\".$gradeno.\"','\".$classno.\"','\".$ip.\"')\"; $ins = mysqli_query($conn,$pingjiao_create); // 提交事务 $pingjiao_id=mysqli_insert_id($conn); mysqli_commit($conn); mysqli_close($conn); echo(\"&lt;script language='javascript' type='text/javascript'&gt;alert('表格编号：\".$pingjiao_id.\",请认真填写表格。');&lt;/script&gt;\"); &#125;else&#123; mysqli_free_result($query); mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('你在已经填写了一张表格！');history.back(1);&lt;/script&gt;\"); &#125; &#125;else if ($row=mysqli_fetch_array($query))&#123; if(getlastTime()&lt;$row[\"createtime\"])&#123; $pingjiao_id=$row[\"id\"]; $classno_name=$row[\"classno\"]; $banzhuren_name=$row[\"banzhuren\"]; $yuwen_name=$row[\"yuwen\"]; $shuxue_name=$row[\"shuxue\"]; $waiyu_name=$row[\"waiyu\"]; $wuli_name=$row[\"wuli\"]; $huaxue_name=$row[\"huaxue\"]; $shengwu_name=$row[\"shengwu\"]; $zhengzhi_name=$row[\"zhengzhi\"]; $lishi_name=$row[\"lishi\"]; $dili_name=$row[\"dili\"]; $tiyu_name=$row[\"tiyu\"]; $qita_name=$row[\"qita\"]; $youmo_name=$row[\"youmo\"]; $aixin_name=$row[\"aixin\"]; $qianneng_name=$row[\"qianneng\"]; $xihuan_name=$row[\"xihuan\"]; $jianyi_name=$row[\"jianyi\"]; echo(\"&lt;script language='javascript' type='text/javascript'&gt;alert('表格编号：\".$pingjiao_id.\",请尽快修改。');&lt;/script&gt;\"); &#125;else&#123; mysqli_free_result($query); mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('填表超过三十分钟，无法修改!');history.back(1);&lt;/script&gt;\"); &#125; &#125; &#125;?&gt;&lt;body&gt;&lt;form action=\"?act=pingjiao\" method=\"post\" onsubmit=\"check()\"&gt;&lt;input name=\"pingjiao_id\" type=\"hidden\" value=\"&lt;?php echo $pingjiao_id ?&gt;\"/&gt;&lt;input name=\"classno\" type=\"hidden\" value=\"&lt;?php echo $classno ?&gt;\" /&gt;&lt;h1 style=\"text-align:center;\"&gt;河津市第二中学学生评教表(&lt;?php echo $classno ?&gt;班)&lt;/h1&gt;各位同学：&lt;br/&gt;&lt;p&gt;评教作为学校的一项常规工作，既是对各位老师一学期的评价，也关系到每一位学生的成长和学校的发展。请同学们比较各位老师的工作，仔细阅读各项计分规则，本着客观公正、实事求是的原则为每一位老师打分，并认真填写问卷调查。感谢你的负责和支持。 &lt;/p&gt;&lt;p&gt;&lt;h2&gt;一、评价标准&lt;/h2&gt;&lt;/p&gt;&lt;table width=\"100%\" border=\"1\" align=\"center\" cellpadding=\"5\" cellspacing=\"1\"&gt;&lt;tr&gt;&lt;td colspan=\"3\"&gt;职业道德 40分&lt;/td&gt;&lt;td colspan=\"3\"&gt;教育教学 60分&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;教师形象(10分)&lt;/td&gt;&lt;td&gt;依法执教(15分)&lt;/td&gt;&lt;td&gt;教师素养(15分)&lt;/td&gt;&lt;td&gt;教学态度(20分)&lt;/td&gt;&lt;td&gt;教学方法(20分)&lt;/td&gt;&lt;td&gt;教学效果(20分)&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;注重形象和人格魅力，严以律己，为人师表；与时俱进、博学多思；追求真善美。&lt;/td&gt;&lt;td&gt;不体罚、辱骂学生，不强行组织学生征订资料，不乱收费，不以教谋私。&lt;/td&gt;&lt;td&gt;诚信民主，尊重、热爱、宽容学生，热情为学生服务，师生关系和谐，情谊浓厚，关注学生全面发展，尊重家长。&lt;/td&gt;&lt;td&gt;乐于奉献，有责任感；不迟到、不旷课；作业批改认真及时，回答学生提问耐心细致。&lt;/td&gt;&lt;td&gt;认真备课；教学严谨有序，课堂充满激情与活力；注重学生能力和素质的培养；具有自己的教学模式和风格。&lt;/td&gt;&lt;td&gt;学生对学习自信，学习效果良好，学习成绩提高，学习方式科学，自主学习能力不断提高。&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;p&gt;&lt;h2&gt;二、教师评价&lt;/h2&gt;&lt;/p&gt;&lt;table width=\"100%\" border=\"1\" align=\"center\" cellpadding=\"5\" cellspacing=\"1\"&gt;&lt;tr&gt;&lt;td&gt;科目&lt;/td&gt;&lt;td&gt;语文&lt;/td&gt;&lt;td&gt;数学&lt;/td&gt;&lt;td&gt;外语&lt;/td&gt;&lt;td&gt;物理&lt;/td&gt;&lt;td&gt;化学&lt;/td&gt;&lt;td&gt;生物&lt;/td&gt;&lt;td&gt;政治&lt;/td&gt;&lt;td&gt;历史&lt;/td&gt;&lt;td&gt;地理&lt;/td&gt;&lt;td&gt;体育&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;姓名&lt;/td&gt;&lt;td&gt;&lt;?php echo $yuwen ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $shuxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $waiyu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $wuli ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $huaxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $shengwu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $zhengzhi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $lishi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $dili ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php echo $tiyu ?&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;计分 &lt;/td&gt;&lt;td&gt;&lt;input name=\"yuwen_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $yuwen_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"shuxue_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $shuxue_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"waiyu_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $waiyu_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"wuli_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $wuli_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"huaxue_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $huaxue_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"shengwu_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $shengwu_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"zhengzhi_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $zhengzhi_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"lishi_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $lishi_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"dili_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $dili_name ?&gt;\"/&gt;&lt;/td&gt;&lt;td&gt;&lt;?php if(strlen($tiyu)&gt;=2)&#123;?&gt;&lt;input name=\"tiyu_name\" class=\"jifen\" type=\"text\" value=\"&lt;?php echo $tiyu_name ?&gt;\"/&gt;&lt;?php&#125;?&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;p&gt;&lt;h2&gt;三、问卷调查&lt;/h2&gt;&lt;/p&gt;&lt;p&gt;&lt;h3&gt;1、问卷调查&lt;/h3&gt;&lt;/p&gt;&lt;table width=\"100%\" border=\"1\" align=\"center\" cellpadding=\"5\" cellspacing=\"1\"&gt;&lt;tr&gt;&lt;td&gt;教学中最具幽默感的教师：&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $yuwen ?&gt;\" &lt;?php if($youmo_name==$yuwen) echo(\"checked\");?&gt;/&gt;&lt;?php echo $yuwen ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $shuxue ?&gt;\" &lt;?php if($youmo_name==$shuxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shuxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $waiyu ?&gt;\" &lt;?php if($youmo_name==$waiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $waiyu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $wuli ?&gt;\" &lt;?php if($youmo_name==$wuli) echo(\"checked\");?&gt;/&gt;&lt;?php echo $wuli ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $huaxue ?&gt;\" &lt;?php if($youmo_name==$huaxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $huaxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $shengwu ?&gt;\" &lt;?php if($youmo_name==$shengwu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shengwu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $zhengzhi ?&gt;\" &lt;?php if($youmo_name==$zhengzhi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $zhengzhi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $lishi ?&gt;\" &lt;?php if($youmo_name==$lishi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $lishi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $dili ?&gt;\" &lt;?php if($youmo_name==$dili) echo(\"checked\");?&gt;/&gt;&lt;?php echo $dili ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php if(strlen($tiyu)&gt;=2)&#123;?&gt;&lt;input name=\"youmo_name\" type=\"radio\" value=\"&lt;?php echo $tiyu ?&gt;\" &lt;?php if($youmo_name==$tiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $tiyu ?&gt;&lt;?php&#125;?&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;最具爱心的教师：&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $yuwen ?&gt;\" &lt;?php if($aixin_name==$yuwen) echo(\"checked\");?&gt;/&gt;&lt;?php echo $yuwen ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $shuxue ?&gt;\" &lt;?php if($aixin_name==$shuxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shuxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $waiyu ?&gt;\" &lt;?php if($aixin_name==$waiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $waiyu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $wuli ?&gt;\" &lt;?php if($aixin_name==$wuli) echo(\"checked\");?&gt;/&gt;&lt;?php echo $wuli ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $huaxue ?&gt;\" &lt;?php if($aixin_name==$huaxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $huaxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $shengwu ?&gt;\" &lt;?php if($aixin_name==$shengwu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shengwu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $zhengzhi ?&gt;\" &lt;?php if($aixin_name==$zhengzhi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $zhengzhi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $lishi ?&gt;\" &lt;?php if($aixin_name==$lishi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $lishi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $dili ?&gt;\" &lt;?php if($aixin_name==$dili) echo(\"checked\");?&gt;/&gt;&lt;?php echo $dili ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php if(strlen($tiyu)&gt;=2)&#123;?&gt;&lt;input name=\"aixin_name\" type=\"radio\" value=\"&lt;?php echo $tiyu ?&gt;\" &lt;?php if($aixin_name==$tiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $tiyu ?&gt;&lt;?php&#125;?&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;最能激发学生潜能的教师：&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $yuwen ?&gt;\" &lt;?php if($qianneng_name==$yuwen) echo(\"checked\");?&gt;/&gt;&lt;?php echo $yuwen ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $shuxue ?&gt;\" &lt;?php if($qianneng_name==$shuxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shuxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $waiyu ?&gt;\" &lt;?php if($qianneng_name==$waiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $waiyu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $wuli ?&gt;\" &lt;?php if($qianneng_name==$wuli) echo(\"checked\");?&gt;/&gt;&lt;?php echo $wuli ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $huaxue ?&gt;\" &lt;?php if($qianneng_name==$huaxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $huaxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $shengwu ?&gt;\" &lt;?php if($qianneng_name==$shengwu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shengwu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $zhengzhi ?&gt;\" &lt;?php if($qianneng_name==$zhengzhi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $zhengzhi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $lishi ?&gt;\" &lt;?php if($qianneng_name==$lishi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $lishi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $dili ?&gt;\" &lt;?php if($qianneng_name==$dili) echo(\"checked\");?&gt;/&gt;&lt;?php echo $dili ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php if(strlen($tiyu)&gt;=2)&#123;?&gt;&lt;input name=\"qianneng_name\" type=\"radio\" value=\"&lt;?php echo $tiyu ?&gt;\" &lt;?php if($qianneng_name==$tiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $tiyu ?&gt;&lt;?php&#125;?&gt;&lt;/td&gt;&lt;/tr&gt;&lt;tr&gt;&lt;td&gt;你最喜欢的教师：&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $yuwen ?&gt;\" &lt;?php if($xihuan_name==$yuwen) echo(\"checked\");?&gt;/&gt;&lt;?php echo $yuwen ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $shuxue ?&gt;\" &lt;?php if($xihuan_name==$shuxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shuxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $waiyu ?&gt;\" &lt;?php if($xihuan_name==$waiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $waiyu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $wuli ?&gt;\" &lt;?php if($xihuan_name==$wuli) echo(\"checked\");?&gt;/&gt;&lt;?php echo $wuli ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $huaxue ?&gt;\" &lt;?php if($xihuan_name==$huaxue) echo(\"checked\");?&gt;/&gt;&lt;?php echo $huaxue ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $shengwu ?&gt;\" &lt;?php if($xihuan_name==$shengwu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $shengwu ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $zhengzhi ?&gt;\" &lt;?php if($xihuan_name==$zhengzhi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $zhengzhi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $lishi ?&gt;\" &lt;?php if($xihuan_name==$lishi) echo(\"checked\");?&gt;/&gt;&lt;?php echo $lishi ?&gt;&lt;/td&gt;&lt;td&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $dili ?&gt;\" &lt;?php if($xihuan_name==$dili) echo(\"checked\");?&gt;/&gt;&lt;?php echo $dili ?&gt;&lt;/td&gt;&lt;td&gt;&lt;?php if(strlen($tiyu)&gt;=2)&#123;?&gt;&lt;input name=\"xihuan_name\" type=\"radio\" value=\"&lt;?php echo $tiyu ?&gt;\" &lt;?php if($xihuan_name==$tiyu) echo(\"checked\");?&gt;/&gt;&lt;?php echo $tiyu ?&gt;&lt;?php&#125;?&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;p&gt;&lt;h3&gt;2、对班级工作的整体评价:&lt;/h3&gt; &lt;lable&gt;&lt;input name=\"banzhuren_name\" type=\"radio\" value=\"优秀\" &lt;?php if($banzhuren_name==\"优秀\") echo(\"checked\");?&gt;/&gt;优秀&lt;/lable&gt;&lt;lable&gt;&lt;input name=\"banzhuren_name\" type=\"radio\" value=\"良好\" &lt;?php if($banzhuren_name==\"良好\") echo(\"checked\");?&gt;/&gt;良好&lt;/lable&gt;&lt;lable&gt;&lt;input name=\"banzhuren_name\" type=\"radio\" value=\"一般\" &lt;?php if($banzhuren_name==\"一般\") echo(\"checked\");?&gt;/&gt;一般&lt;/lable&gt;&lt;lable&gt;&lt;input name=\"banzhuren_name\" type=\"radio\" value=\"较差\" &lt;?php if($banzhuren_name==\"较差\") echo(\"checked\");?&gt;/&gt;较差&lt;/lable&gt;&lt;/p&gt;&lt;p&gt;&lt;h3&gt;3、请写下您对代课教师、班级工作的建议和要求：&lt;/h3&gt;&lt;/p&gt;&lt;textarea name=\"jianyi_name\" rows=\"10\" cols=\"50\"&gt;&lt;?php echo $jianyi_name ?&gt;&lt;/textarea&gt;&lt;span align=\"center\"&gt;&lt;input type=\"submit\" value=\"提交\"/&gt;&lt;/span&gt;&lt;/form&gt;&lt;/body&gt;&lt;/html&gt;&lt;?php mysqli_close($conn);?&gt; tongji.php1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192&lt;?phperror_reporting(E_ALL &amp; ~E_NOTICE);require_once('conn.php');?&gt;&lt;html&gt;&lt;head&gt;&lt;title&gt;选择班级&lt;/title&gt;&lt;script languag=\"javascritp\"&gt;function choose(classno)&#123;form1.classno.value=classno;form1.action=\"tongjiset.php\";form1.submit();&#125;function updateFlag(classno,editflag)&#123;form1.classno.value=classno;form1.editflag.value=editflag;form1.action=\"tongji.php?act=updateFlag\";form1.submit();&#125;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;?php $action = isset($_GET[\"act\"]) ? $_GET[\"act\"] : \"\"; if($action==\"updateFlag\")&#123; $whereStr=\"\"; $classno=trim($_POST[\"classno\"]); $editflag=trim($_POST[\"editflag\"]); if (!is_numeric($editflag))&#123; die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('参数错误!');history.back(1);&lt;/script&gt;\"); &#125;else if(is_numeric($classno) &amp;&amp; $classno !=-1)&#123; $whereStr=\" where classno='\".$classno.\"'\"; &#125;else if(!is_numeric($classno))&#123; $whereStr=\" where gradeno='\".$classno.\"'\"; &#125; $sql=\"update `classz` set editflag=\".$editflag.$whereStr; mysqli_query($conn,$sql); redirect(\"tongji.php\"); &#125; $rowNum=5; $sql_classz=\"select gradeno,classno,editflag from classz\"; $query = mysqli_query($conn,$sql_classz); if(mysqli_num_rows($query)&lt;=0)&#123; die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('班级不存在!');history.back(1);&lt;/script&gt;\"); &#125;else&#123;?&gt; &lt;h1 style=\"text-align:center;\"&gt;&lt;a href=\"javascript:choose('-1')\"&gt;全部班级&lt;/a&gt;(&lt;a href=\"javascript:updateFlag('-1',1)\"&gt;全部打开&lt;/a&gt;)(&lt;a href=\"javascript:updateFlag('-1',0)\"&gt;全部关闭&lt;/a&gt;)&lt;/h1&gt;&lt;?php $i=0; $lastGradeno=\"\"; while($row=mysqli_fetch_array($query))&#123; $trFlag=$i%$rowNum; if($row[\"gradeno\"]!=$lastGradeno)&#123; if($i!=0)&#123; buTD($i,$rowNum); &#125;?&gt; &lt;h2&gt;&lt;a href=\"javascript:choose('&lt;?php echo $row[\"gradeno\"] ?&gt;')\"&gt;&lt;?php echo $row[\"gradeno\"] ?&gt;&lt;/a&gt;|(&lt;a href=\"javascript:updateFlag('&lt;?php echo $row[\"gradeno\"] ?&gt;',1)\"&gt;全部打开&lt;/a&gt;)(&lt;a href=\"javascript:updateFlag('&lt;?php echo $row[\"gradeno\"] ?&gt;',0)\"&gt;全部关闭&lt;/a&gt;)&lt;/h2&gt; &lt;table width=\"100%\" border=\"1\" align=\"center\" cellpadding=\"5\" cellspacing=\"1\"&gt;&lt;?php &#125; echo $trFlag==0?\"&lt;tr&gt;\":\"\"; echo \"&lt;td&gt;&lt;a href=\\\"javascript:choose('\".$row[\"classno\"].\"')\\\"&gt;\".$row[\"classno\"].\"班&lt;/a&gt;|&lt;a style=\\\"color:\".($row[\"editflag\"]==0?\"red\":\"green\").\";\\\" href=\\\"javascript:updateFlag('\".$row[\"classno\"].\"',\".($row[\"editflag\"]==0?\"1\":\"0\").\")\\\"&gt;\".($row[\"editflag\"]==0?\"已关闭（点击打开）\":\"已打开（点击关闭）\").\"&lt;/a&gt;&lt;/td&gt;\"; echo $trFlag==($rowNum-1)?\"&lt;/tr&gt;\":\"\"; $lastGradeno=$row[\"gradeno\"]; $i++; &#125; buTD($i,$rowNum); &#125;?&gt;&lt;form action=\"\" method=\"post\" name=\"form1\"&gt;&lt;input name=\"classno\" value=\"\" type=\"hidden\"/&gt;&lt;input name=\"editflag\" value=\"\" type=\"hidden\"/&gt;&lt;/from&gt;&lt;/body&gt;&lt;/html&gt;&lt;?php mysqli_free_result($query);mysqli_close($conn);?&gt; tongjiset.php123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118119120121122123124125126127128129130131132133134135136137138139&lt;?phperror_reporting(E_ALL &amp; ~E_NOTICE);require_once('conn.php');?&gt;&lt;html&gt;&lt;head&gt;&lt;title&gt;学生评教&lt;/title&gt;&lt;style&gt;.jifen &#123;width:40px;&#125;.other &#123;width:60px;&#125;&lt;/style&gt;&lt;/head&gt;&lt;body&gt;&lt;?php $classno=trim($_POST[\"classno\"]); $filename=\"cache/tongjiset/static_classno_\".$classno.\".html\"; $status=filemtime($filename)+30&gt;time();//判断文件创建及修改时间距当前时间是否超过30秒 if(file_exists($filename)&amp;&amp;$status)&#123; $str=file_get_contents($filename); echo $str; &#125;else&#123; ob_start(); $whereStr=\" where endtime is not null\"; //客户端是否输入classno if(empty($classno))&#123; mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('班级不存在!');history.back(1);&lt;/script&gt;\"); &#125;else if(is_numeric($classno) &amp;&amp; $classno !=-1)&#123; //数据库是否存在classno $sql_pingjiao=\"select * from classz where classno='\".$classno.\"'\"; $query = mysqli_query($conn,$sql_pingjiao); if(mysqli_num_rows($query)&lt;=0)&#123; mysqli_free_result($query); mysqli_close($conn); die(\"&lt;script language='javascript' type='text/javascript'&gt;alert('班级不存在!');history.back(1);&lt;/script&gt;\"); &#125;else if ($row=mysqli_fetch_array($query))&#123; mysql_free_result($query); $classno=$row[\"classno\"]; $banzhuren=$row[\"banzhuren\"]; $yuwen=$row[\"yuwen\"]; $shuxue=$row[\"shuxue\"]; $waiyu=$row[\"waiyu\"]; $wuli=$row[\"wuli\"]; $huaxue=$row[\"huaxue\"]; $shengwu=$row[\"shengwu\"]; $zhengzhi=$row[\"zhengzhi\"]; $lishi=$row[\"lishi\"]; $dili=$row[\"dili\"]; $tiyu=$row[\"tiyu\"]; &#125; $whereStr=\" where classno='\".$classno.\"'\"; &#125;else if(!is_numeric($classno))&#123; $whereStr=\" where gradeno='\".$classno.\"'\"; &#125; ?&gt;&lt;h1 style=\"text-align:center;\"&gt;河津市第二中学学生评教统计(&lt;?php echo $classno==-1?\"全部\":$classno ?&gt;班)&lt;/h1&gt;&lt;table width=\"100%\" border=\"1\" align=\"center\" cellpadding=\"5\" cellspacing=\"1\"&gt;&lt;tr&gt;&lt;th&gt;编号&lt;/th&gt;&lt;th&gt;IP&lt;/th&gt;&lt;th&gt;填表开始&lt;br/&gt;时间&lt;/th&gt;&lt;th&gt;填表结束&lt;br/&gt;时间&lt;/th&gt;&lt;th&gt;语文&lt;?php echo $yuwen ?&gt;&lt;/th&gt;&lt;th&gt;数学&lt;?php echo $shuxue ?&gt;&lt;/th&gt;&lt;th&gt;外语&lt;?php echo $waiyu ?&gt;&lt;/th&gt;&lt;th&gt;物理&lt;?php echo $wuli ?&gt;&lt;/th&gt;&lt;th&gt;化学&lt;?php echo $huaxue ?&gt;&lt;/th&gt;&lt;th&gt;生物&lt;?php echo $shengwu ?&gt;&lt;/th&gt;&lt;th&gt;政治&lt;?php echo $zhengzhi ?&gt;&lt;/th&gt;&lt;th&gt;历史&lt;?php echo $lishi ?&gt;&lt;/th&gt;&lt;th&gt;地理&lt;?php echo $dili ?&gt;&lt;/th&gt;&lt;th&gt;体育&lt;?php echo $tiyu ?&gt;&lt;/th&gt;&lt;th&gt;最具幽默&lt;br/&gt;感的教师&lt;/th&gt;&lt;th&gt;最具爱心&lt;br/&gt;的教师&lt;/th&gt;&lt;th&gt;最能激发&lt;br/&gt;学生潜能&lt;/th&gt;&lt;th&gt;最喜欢&lt;br/&gt;的教师&lt;/th&gt;&lt;th&gt;班级工作&lt;br/&gt;整体评价&lt;/th&gt;&lt;th&gt;建议和要求&lt;/th&gt;&lt;/tr&gt;&lt;?php $qry = mysqli_query($conn,\"select * from pingjiao\" .$whereStr); $recordcount = max(mysqli_num_rows($qry),0); while($qrow=mysqli_fetch_array($qry)) &#123; ?&gt; &lt;tr&gt; &lt;td&gt;&lt;?php echo $qrow[\"id\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"ip\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"createtime\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"endtime\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"yuwen\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"shuxue\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"waiyu\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"wuli\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"huaxue\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"shengwu\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"zhengzhi\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"lishi\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"dili\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"tiyu\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"youmo\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"aixin\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"qianneng\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"xihuan\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"banzhuren\"] ?&gt;&lt;/td&gt; &lt;td&gt;&lt;?php echo $qrow[\"jianyi\"] ?&gt;&lt;/td&gt; &lt;/tr&gt; &lt;?php &#125; mysqli_free_result($qry); ?&gt;&lt;/table&gt;&lt;?php $content= ob_get_contents();//从缓存中获取内容 ob_end_clean();//关闭缓存并清空 file_put_contents($filename, $content); echo $content; &#125; ?&gt;&lt;/body&gt;&lt;/html&gt;&lt;?php mysqli_close($conn);?&gt; create.sql123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869CREATE TABLE `classz` ( `id` BIGINT(20) NOT NULL AUTO_INCREMENT COMMENT '编号', `gradeno` VARCHAR(45) NOT NULL COMMENT '年级', `level` VARCHAR(45) NULL DEFAULT NULL COMMENT '层次', `classno` VARCHAR(45) NOT NULL COMMENT '班级', `banzhuren` VARCHAR(45) NOT NULL COMMENT '班主任', `yuwen` VARCHAR(45) NOT NULL COMMENT '语文', `shuxue` VARCHAR(45) NOT NULL COMMENT '数学', `waiyu` VARCHAR(45) NOT NULL COMMENT '外语', `wuli` VARCHAR(45) NOT NULL COMMENT '物理', `huaxue` VARCHAR(45) NOT NULL COMMENT '化学', `shengwu` VARCHAR(45) NOT NULL COMMENT '生物', `zhengzhi` VARCHAR(45) NOT NULL COMMENT '政治', `lishi` VARCHAR(45) NOT NULL COMMENT '历史', `dili` VARCHAR(45) NOT NULL COMMENT '地理', `yinyue` VARCHAR(45) NULL DEFAULT NULL COMMENT '音乐', `tiyu` VARCHAR(45) NULL DEFAULT NULL COMMENT '体育', `meishu` VARCHAR(45) NULL DEFAULT NULL COMMENT '美术', `xinxi` VARCHAR(45) NULL DEFAULT NULL COMMENT '信息', `tongyong` VARCHAR(45) NULL DEFAULT NULL COMMENT '通用', `qita` VARCHAR(45) NULL DEFAULT NULL COMMENT '其他', `editflag` TINYINT(1) UNSIGNED ZEROFILL NULL DEFAULT '0', PRIMARY KEY (`id`), INDEX `Index 2` (`classno`))COMMENT='班级'COLLATE='utf8_general_ci'ENGINE=MyISAMROW_FORMAT=COMPACTAUTO_INCREMENT=58;CREATE TABLE `pingjiao` ( `id` BIGINT(20) NOT NULL AUTO_INCREMENT COMMENT '编号', `classno` VARCHAR(45) NOT NULL COMMENT '班级', `gradeno` VARCHAR(45) NULL DEFAULT NULL, `banzhuren` VARCHAR(45) NULL DEFAULT NULL COMMENT '班主任', `yuwen` TINYINT(4) NULL DEFAULT NULL COMMENT '语文', `shuxue` TINYINT(4) NULL DEFAULT NULL COMMENT '数学', `wuli` TINYINT(4) NULL DEFAULT NULL COMMENT '物理', `waiyu` TINYINT(4) NULL DEFAULT NULL COMMENT '外语', `huaxue` TINYINT(4) NULL DEFAULT NULL COMMENT '化学', `shengwu` TINYINT(4) NULL DEFAULT NULL COMMENT '生物', `lishi` TINYINT(4) NULL DEFAULT NULL COMMENT '历史', `dili` TINYINT(4) NULL DEFAULT NULL COMMENT '地理', `zhengzhi` TINYINT(4) NULL DEFAULT NULL COMMENT '政治', `yinyue` TINYINT(4) NULL DEFAULT NULL COMMENT '音乐', `tiyu` TINYINT(4) NULL DEFAULT NULL COMMENT '体育', `meishu` TINYINT(4) NULL DEFAULT NULL COMMENT '美术', `xinxi` TINYINT(4) NULL DEFAULT NULL COMMENT '信息', `tongyong` TINYINT(4) NULL DEFAULT NULL COMMENT '通用', `qita` TINYINT(4) NULL DEFAULT NULL COMMENT '其他', `youmo` VARCHAR(50) NULL DEFAULT NULL COMMENT '最具幽默感的教师', `aixin` VARCHAR(50) NULL DEFAULT NULL COMMENT '最具爱心的教师', `qianneng` VARCHAR(50) NULL DEFAULT NULL COMMENT '最能激发学生潜能的教师', `xihuan` VARCHAR(50) NULL DEFAULT NULL COMMENT '你最喜欢的教师', `jianyi` TEXT NULL COMMENT '意见或建议', `ip` VARCHAR(45) NOT NULL COMMENT 'ip地址', `createtime` DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '表单创建时间', `endtime` DATETIME NULL DEFAULT NULL COMMENT '表单完成时间', PRIMARY KEY (`id`), INDEX `Index 2` (`classno`), INDEX `Index 3` (`ip`))COMMENT='评教'COLLATE='utf8_general_ci'ENGINE=MyISAMROW_FORMAT=COMPACTAUTO_INCREMENT=14;","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"php","slug":"php","permalink":"https://blog.ccsyue.com/tags/php/"}]},{"title":"考察内容","slug":"考察内容","date":"2016-12-23T12:57:08.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/考察内容.html","link":"","permalink":"https://blog.ccsyue.com/2016/考察内容.html","excerpt":"","text":"1、中国共产党党旗、党徽内容是什么，象征着什么？答：中国共产党党旗底色为红色，旗面左上角为黄色的锤子、镰刀。党徽由工人和农民的劳动工具锤子和镰刀组成。党旗和党徽的图案象征着中国共产党是中国工人阶级的先锋队，代表着工人阶级和广大人民群众的根本利益。 2、中国共产党成立于何年何月？答：1921年7月23日（中国共产党第一次全国代表大会在上海望志路106号开幕，闭幕日期是8月1日或2日，从此，中国共产党正式成立。毛泽东同志于1938年5月在作《论持久战》演说时最早提出）。1941年6月30日，中共中央正式定“七一”为党的生日。 3、党的性质是什么？答：中国共产党是中国工人阶级的先锋队，同时是中国人民和中华民族的先锋队，是中国特色社会主义事业的领导核心，代表中国先进生产力的发展要求，代表中国先进文化的前进方向，代表中国最广大人民群众的根本利益，党的最高理想和最终目标是实现共产主义。 4、党的指导思想是什么？答：中国共产党以马列主义、毛泽东思想、邓小平理论和“三个代表”重要思想，以及科学发展观作为自己的行动指南。 5、党的思想路线和核心是什么？党的思想路线是：一切从实际出发，理论联系实际，实事求是，在实践中检验和发展真理。核心是：实事求是。 6、党的根本宗旨是什么？答：全心全意为人民服务。 7、党的根本组织原则是什么？其基本内涵是什么？答：民主集中制是党的根本组织原则，也是群众路线在党的生活中的运用。民主集中制是民主基础上的集中和集中指导下的民主相结合。 8、党的四项基本原则是什么？答：坚持社会主义道路，坚持人民民主专政，坚持中国共产党的领导，坚持马列主义、毛泽东思想。 9、党的纪律处分有哪几种？答：警告、严重警告、撤销党内职务、留党察看、开除党籍。 10、入党誓词是什么？答：我志愿加入中国共产党，拥护党的纲领，遵守党的章程，履行党员义务，执行党的决定，严守党的纪律，保守党的秘密，对党忠诚，积极工作，为共产主义奋斗终身，随时准备为党和人民牺牲一切，永不叛党。 11、入党时间和党龄如何计算？答：入党时间从被接收为预备党员之日算起。党龄从预备期满转为正式党员之日算起。 12、新入党的党员从何时开始交党费？答:从本支部接收其为预备党员的那个月开始交党费。 13、党费缴纳的标准、时间是怎么规定的?答：按月领取工资的党员，每月按规定比例缴纳党费。缴纳党费的比例是：每月工资收入（税后）在3000元以下（含3000元）者，缴纳月工资收入的0.5%；3000元以上至5000元（含5000元）者，缴纳1%；5000元以上至10000元（含10000元）者，缴纳1.5%；10000元以上者缴纳2%。 14、党的建设必须坚持的四项基本要求是什么？答：坚持党的基本路线；坚持解放思想、实事求是、与时俱进；坚持全心全意为人民服务；坚持民主集中制。 15、党的群众路线基本内容是什么？答：群众路线就是一切为了群众，一切依靠群众，从群众中来，到群众中去。 16、党的十八大提出的“四个全面”具体是指什么？答：全面建成小康社会，全面深化改革，全面推进依法治国，全面从严治党。 17、“三严三实”内容是什么？答：严以修身、严以用权、严以律己，谋事要实、创业要实、做人要实。 18、习近平总书记提出的好干部的“五个标准”是什么？答：信念坚定、为民服务、勤政务实、敢于担当、清正廉洁。 19、焦裕禄精神怎么概括？答：亲民爱民、艰苦奋斗、科学务实、迎难而上、无私奉献。 20、“六权治本”的具体内容是什么？答：依法确定权力、科学配置权力、制度约束权力、阳光行使权力、合力监督权力、严惩滥用权力。 21、运城市委书记王宇燕代表市委提出的“32字工作导向”是什么？答：拼在基层，敬业担当；干在实处，贴近民心；领导带头，以上率下；凝心聚力，攻坚克难。 22、三创两提升的具体内容是什么？答：创新机制激活力、创造品牌促转型、创优环境快发展、提升社会管理、提升党建水平。 23、河津市委新提出的五大战略指的是什么？答：工业强市战略；人本立市战略；开放活市战略；生态靓市战略；文化兴市战略。 24、运城市第四次党代会的主要任务是什么？答：建设新型工业大市；建设现代农业强市；建设文化旅游名市；建设晋陕豫黄河金三角区域性中心城市。 25、山西省委书记骆惠宁“一个指引，两手硬”指的是什么？答:一个指引是：以习近平系列讲话为指引。两手硬，一是持续推进党风廉政建设和反腐败斗争，着力构建良好政治生态；二是自觉践行新发展理念，多策破解经济下行压力，着力推进经济稳步向好。 26、党的十八届六中全会提出，开展党内政治生活的首要任务是什么？答：坚定理想信念是开展党内政治生活的首要任务。 27、党的十八届六中全会提出，坚持党的领导，首先是坚持什么？答：坚持党的领导，首先是坚持党中央的集中统一领导。 28、党的民主集中制“四个服从”基本原则的内容是什么？答：党员个人服从党的组织，少数服从多数，下级组织服从上级组织，全党各个组织和全体党员服从党的全国代表大会和中央委员会。 29、合格党员的标准是什么？答：合格党员的标准是“四讲四有”，即讲政治、有信念，讲规矩、有纪律，讲道德、有品行，讲奉献、有作为。 30、“三会一课”指什么？答：定期召开支部党员大会、支部委员会、党小组会，按时上好党课。","categories":[{"name":"政治","slug":"政治","permalink":"https://blog.ccsyue.com/categories/政治/"}],"tags":[{"name":"中共党员","slug":"中共党员","permalink":"https://blog.ccsyue.com/tags/中共党员/"}]},{"title":"百花苑","slug":"百花苑","date":"2016-12-19T01:02:33.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/百花苑.html","link":"","permalink":"https://blog.ccsyue.com/2016/百花苑.html","excerpt":"","text":"百花苑文摘1-13期","categories":[{"name":"文学","slug":"文学","permalink":"https://blog.ccsyue.com/categories/文学/"}],"tags":[{"name":"文摘","slug":"文摘","permalink":"https://blog.ccsyue.com/tags/文摘/"}]},{"title":"我的歌单","slug":"我的收藏","date":"2016-12-18T23:46:08.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/我的收藏.html","link":"","permalink":"https://blog.ccsyue.com/2016/我的收藏.html","excerpt":"","text":"","categories":[{"name":"歌曲","slug":"歌曲","permalink":"https://blog.ccsyue.com/categories/歌曲/"}],"tags":[{"name":"影视金曲","slug":"影视金曲","permalink":"https://blog.ccsyue.com/tags/影视金曲/"}]},{"title":"鑫鑫歌单","slug":"鑫鑫歌单","date":"2016-12-18T23:43:06.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/鑫鑫歌单.html","link":"","permalink":"https://blog.ccsyue.com/2016/鑫鑫歌单.html","excerpt":"","text":"公共音乐 少年中国强 彩云之南 和快乐在一起 三字经 小马过河","categories":[{"name":"歌曲","slug":"歌曲","permalink":"https://blog.ccsyue.com/categories/歌曲/"}],"tags":[{"name":"鑫鑫","slug":"鑫鑫","permalink":"https://blog.ccsyue.com/tags/鑫鑫/"}]},{"title":"搭建免费在线导航2","slug":"搭建免费在线导航2","date":"2016-12-17T00:34:32.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/搭建免费在线导航2.html","link":"","permalink":"https://blog.ccsyue.com/2016/搭建免费在线导航2.html","excerpt":"","text":"已使用自动化运维工具https://travis-ci.org/将所有的页面生成在源码分支src上的html目录下，并把html发布到master分支上。","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"git","slug":"git","permalink":"https://blog.ccsyue.com/tags/git/"}]},{"title":"git快速上传下载","slug":"git快速上传下载","date":"2016-12-17T00:08:29.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/git快速上传下载.html","link":"","permalink":"https://blog.ccsyue.com/2016/git快速上传下载.html","excerpt":"","text":"前提 必须生成密钥（私钥、公钥），并将公钥C:\\Users\\Administrator.ssh下的id_rsa.pub文本粘贴到git服务器(码云、github)上。 ssh-keygen -t rsa -C “youremail@example.com“ windows下ssh-keygen地址：C:\\Program Files\\Git\\usr\\bin 下载git clone git@git.oschina.net:jiehou/baihuayuan.gitgit pull baihuayuan src:master 上传 (强推） 新建远程仓库 git@git.oschina.net:jiehou/baihuayuan.git 给本地仓库初始化 git init 对应本地仓库到远程仓库 git remote add baihuayuan git@git.oschina.net:jiehou/baihuayuan.git 将本地仓库文件添加、提交。git add * ;git commit -m “upload all” 强推：git push -u baihuayuan master:src -f 12345678mkdir jiehoucd jiehougit initecho &quot;# net:jiehou&quot; &gt;&gt; README.mdgit add README.mdgit commit -m &quot;first commit&quot;git remote add origin git@git.oschina.net:jiehou/baihuayuan.gitgit push -u origin master","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"git","slug":"git","permalink":"https://blog.ccsyue.com/tags/git/"}]},{"title":"word通配符攻略","slug":"word通配符攻略","date":"2016-12-17T00:06:11.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/word通配符攻略.html","link":"","permalink":"https://blog.ccsyue.com/2016/word通配符攻略.html","excerpt":"","text":"Word查找栏代码·通配符一览表 序号 清除使用通配符复选框 勾选使用通配符复选框 特殊字符 代码 特殊字符 代码or通配符 1 任意单个字符 ^? 任意单个字符 ? 2 任意数字 ^# 任意数字（单个） [0-9] 3 任意英文字母 ^$ 任意英文字母 [a-zA-Z] 4 段落标记 ^p 段落标记 ^13 5 手动换行符 ^l 手动换行符 ^lor^11 6 图形 ^gor^1 图形 ^g 7 1/4长划线 ^+ 1/4长划线 ^q 8 长划线 ^j 长划线 ^+ 9 短划线 ^q 短划线 ^= 10 制表符 ^t 制表符 ^t 11 脱字号 ^ 脱字号 ^^ 12 分栏符 ^v 分栏符 ^nor^14 13 分节符 ^b 分节符/分页符 ^m 14 省略号 ^n 省略号 ^i 15 全角省略号 ^i 全角省略号 ^j 16 无宽非分隔符 ^z 无宽非分隔符 ^z 17 无宽可选分隔符 ^x 无宽可选分隔符 ^x 18 不间断空格 ^s 不间断空格 ^s 19 不间断连字符 ^~ 不间断连字符 ^~ 20 ¶段落符号 ^% 表达式 ( ) 21 §分节符 ^ 单词结尾 &lt; 22 脚注标记 ^for^2 单词开头 &gt; 23 可选连字符 ^- 任意字符串 * 24 空白区域 ^w 指定范围外任意单个字符 [!x-z] 25 手动分页符 ^m 指定范围内任意单个字符 [ - ] 26 尾注标记 ^e 1个以上前一字符或表达式 @ 27 域 ^d n 个前一字符或表达式 { n } 28 Unicode 字符 ^Unnnn n个以上前一字符或表达式 { n, } 29 全角空格 ^u8195 n 到 m 个前一字符或表达式 { n,m } 30 半角空格 ^32or^u8194 所有小写英文字母 [a-z] 31 批注 ^aor^5 所有大写英文字母 [A-Z] 32 所有西文字符 [^1-^127] 33 所有中文汉字和中文标点 [!^1-^127] 34 所有中文汉字（CJK统一字符） [一-龥]or[一-﨩] 35 所有中文标点 [!一-龥^1-^127] 36 所有非数字字符 [!0-9] 注：要查找已被定义为通配符的字符，该字符前键入反斜杠\\。查找？、、（、）、[、]等的代码分别是\\？、\\、(、)、[、] Word替换栏代码·通配符一览表 序号 清除使用通配符复选框 勾选使用通配符复选框 特殊字符 代码 特殊字符 代码or通配符 0 要查找的表达式 \\n \\ 1 段落标记↵ ^p 段落标记↵ ^p 2 手动换行符↓ ^l 手动换行符↓ ^l 3 查找的内容 ^&amp; 查找的内容 ^&amp; 4 剪贴板内容 ^c 剪贴板内容 ^c 5 省略号 ^i 省略号 ^i 6 全角省略号 ^j 全角省略号 ^j 7 制表符 ^t 制表符 ^t 8 长划线 ^+ 长划线 ^+ 9 1/4长划线(—) ^q 1/4长划线(—) ^q 10 短划线(–) ^= 短划线(–) ^= 11 脱字号 ^^ 脱字号 ^^ 12 手动分页符 ^mor^12 手动分页符/分节符 ^m 13 可选连字符（_） ^- 可选连字符（_） ^- 14 不间断连字符（-） ^~ 不间断连字符（-） ^~ 15 不间断空格 ^s 不间断空格 ^s 16 无宽非分隔符 ^z 无宽非分隔符 ^z 17 无宽可选分隔符 ^x 无宽可选分隔符 ^x 18 分栏符 ^n 分栏符 ^n 19 §分节符 ^% §分节符 ^% 20 ¶段落符号 ^v ¶段落符号 ^v Word通配符用法详解 任意单个字符：“?”可以代表任意单个字符，输入几个“?”就代表几个未知字符。如：输入“? 国”就可以找到诸如“中国 ”. “美国 ”. “英国”等字符；输入“???国”可以找到“孟加拉国”等字符。 任意多个字符：“”可以代表任意多个字符。如：输入“国”就可以找到“中国 ”. “美国 ”. “孟加拉国”等字符。 指定字符之一：“[]”框内的字符可以是指定要查找的字符之一，如：输入“[中美]国”就可以找到“中国 ”. “美国”。 又如：输入“th[iu]g”，就可查找到“thigh”和“thug”。输入“[学硕博]士”，查找到的将会是学 士. 士. 硕 士. 博士。输入“[大中小]学”可以查找到“大学 ”. “中学”或“小学”，但不查找“求学 ”. “开学”等。输入“[高矮]个”的话，Word查找工具就可以找到“高个 ”. “矮个”等内容。 指定范围内的任意单个字符：“[x-x]”可以指定某一范围内的任意单个字符，如：输入“[a-e]ay”就可以找到“bay ”. “day”等字符，要注意的是指定范围内的字符必须用升序。 用升序。如：输入“[a-c]mend”的话，Word查找工具就可以找到“amend ”. “bmend ”. “cmend”等字符内容。 排除指定 范. 排除指定范围内的任意单个字符：“[!x-x]”可以用来排除指定范围内的任意单个字符，如：输入“[!c-f]”就可以找到“bay ”. “gay ”. “lay”等字符，但是不等字符，但是不会找到“cay ”. “day”等字符。要注意范围必须用升序。又如：输入“[!a-c]”的话，word程序就可以找到“good ”. “see ”. “these”等目标字符，而所有包含字符 a. b. c之类的内容都不会在查找结果中出现。又如：输入“m[!a]st”，用，用来查找“mist”和“most”不会查找“mast”。输入“[!a]n”，查到的将会是除an以外的所有可能组合如：合如：i n. on 等。 指定前一字符的个数：“{n}”可以用来指定要查找的字符中包含前一字符的个数，如：输入“cho{1} se”就是说包含1个前一字符“o”，可以找到“chose”，输入“cho{2}se”就是说包含2个前一字符“o”，可以找到， “choose”。又如：输入“lit{1}le”就是说包含1个前一字符“t”，可以找到“litle”。输入“lit{2}le”就是说包含2个前一字符“t”，可以找到“little”。输入“te{2}n”，表示查找“teen”而不会查找“ten”。输入“of{2}ice”，查找到的将会是office。 指定前一字 符. 指定前一字符数范围：“{x,x}”可以用指定要查找字符中前一字符数范围，如：输入“cho{1,2}”，则说明包含前一字符“o”数目范围是1-2个，则可以找到“chose ”. “choose”。 一个以上的前一字符：“@”可以用来指定要查找字符中包含一个以上的前一字符，如：输入“cho@se”，就可以找到， “chose ”. “choose”等字符。 指定起始字符串：“&lt;”可以用来指定要查找字符中的起始字符串，如：输入“&lt;ag”，就说明要查找的字符的起始字符为“ag”，可以找到 “ago ”. “agree ”. “again”等字符。输入“&lt;te”的话，可能查到“ten ”. “tea”等。 指定结尾字符串：“&gt;”可以用来指定要查找字符中的结尾字符串，如：输入“er&gt;”，就说明要查找的字符的结尾字符为“er”，可以找到 “ver ”. “her ”. “lover”等等。输入“en&gt;”， 就说明要查找到以“en”结尾的所有目标对象，可能找到“ten ”. “pen ”. “men”输入“up&gt;”，就说明要查找到以“up”结尾的所有目标对象，例如会找到“setup ”. “cup”等等。 表达式查找：“（）”，尤其用于多个关键词的组合查找。键入“（America）（China）”，在“替换为”中键入“\\2 \\1”，Word找到“America China”并替换为“China America”。输入“&lt;(江山)*(多娇)&gt;”，就表示查找的是所有以“江山”开头并且以“多娇”结尾的字符串。 另外为了更精确的查找，你还可以把以上的通配符联合起来使用，如：输入“&lt;(ag)(er)&gt;”则表示查找所有以“ag”开头并且以“er”结尾的单词，注意这时需要用括号将来区分开不同的查找规则。最后还要注意如果要查找已经被定义为通配符的字符，如“ ”. “?”等字符，必须在该字符前面加上反斜杠“\\”，如：输入“*”则表示查找字符“*”。 使用通配符搜索选中“使用通配符”复选框后，Word 只查找与指定文本精确匹配的文本（请注意，“区分大小写”和“全字匹配”复选框会变灰而不可用，表明这些选项已自动选中，您不能关闭这些选项）。要查找已被定义为通配符的字符，请在该字符前键入反斜扛 ()，例如，要查找问号，可键入“\\？”。 序号 查找内容 通配符 示例 1 任意单个字符 ? 例如，s?t可查找“sat”和“set”。 2 任意字符串 * 例如，s*d可查找“sad”和“started”。 3 单词的开头 &lt; 例如，&lt;(inter)查找“interesting”和“intercept”，但不查找“splintered”。 4 单词的结尾 &gt; 例如，(in)&gt;查找“in”和“within”，但不查找“interesting”。 5 指定字符之一 [] 例如，w[io]n查找“win”和“won”。 6 指定范围内任意单个字符 [-] 例如，[r-t]ight查找“right”和“sight”。必须用升序来表示该范围。 7 中括号内指定字符范围以外的任意单个字符 [!x-z] 例如，t[!a-m]ck查找“tock”和“tuck”，但不查找“tack”和“tick”。 8 n个重复的前一字符或表达式 {n} 例如，fe{2}d查找“feed”，但不查找“fed”。 9 至少n个前一字符或表达式 {n,} 例如，fe{1,}d查找“fed”和“feed”。 10 n到m个前一字符或表达式 {n,m} 例如，10{1,3}查找“10”、“100”和“1000”。 11 一个以上的前一字符或表达式 @ 例如，lo@t查找“lot”和“loot”。 一些代码只有在选中或清除“使用通配符”选项时才能使用。 使用代码搜索 可以在“查找内容”或“替换为”框中使用的代码 内容 说明 段落标记() 键入^p（选中“使用通配符”复选框时在“查找内容”框中无效）或键入^13 制表符() 键入^t或键入^9 ASCII字符 键入^nnn，其中nnn是字符代码 ANSIcharacter 键入^0nnn，其中nnn是字符代码 长划线(—) 键入^+ 短划线(–) 键入^= 脱字号 键入^^ 手动换行符() 键入^l或键入^11 分栏符 键入^n或键入^14 分页符或分节符 键入^12（替换时，插入分页符） 手动分页符 键入^m（当选中“使用通配符”复选框时，还将查找或替换分节符） 不间断空格() 键入^s 不间断连字符() 键入^~ 可选连字符() 键入^- 只能在“查找内容”框中使用的代码（选中“使用通配符”复选框时） 内容 说明 图片或图形（仅嵌入） 键入^g 只能在“查找内容”框中使用的代码（清除“使用通配符”复选框时） 内容 说明 任意字符 键入^? 任意数字 键入^# 任意字 键入^$ Unicode字符 键入^Unnnn，其中“nnnn”是字符代码 图片或图形（仅嵌入） 键入^1 脚注标记 键入^f或键入^2 尾注标记 键入^e 域 键入^d 正在打开域大括号（当域代码可见时） 键入^19 正在关闭域大括号（当域代码可见时） 键入^21 批注 键入^a或键入^5 分节符 键入^b 全角空格(Unicode) 键入^u8195 半角空格(Unicode) 键入^u8194 白色空格 键入^w（可以是常规空格、不间断空格以及制表符的任意组合） 只能在“替换为”框中使用的代码 内容 说明 “Windows剪贴板”的内容 键入^c “查找内容”框的内容 键入^&amp; 选中“使用通配符”复选框后，Microsoft Word 不识别在“查找内容”框中输入的用于下列项目的代码：尾注和脚注标记、域、段落标记、分节符或空白区域。若要搜索这些项目，可以在“查找内容”框中键入下列替换代码。（注意，没有可用于域的替换代码） 内容 说明 若要查找脚注或尾注标记 键入“^2” 注意，Word 无法区分脚注和尾注标记。 若要查找段落标记 键入“^13” 若要查找分节符 键入“^12” Word 将搜索手动分页符和分节符。 查找空白区域 键入“空格{1,}”","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"word","slug":"word","permalink":"https://blog.ccsyue.com/tags/word/"}]},{"title":"利用markdown制作相册","slug":"利用markdown制作相册","date":"2016-12-16T23:37:20.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/利用markdown制作相册.html","link":"","permalink":"https://blog.ccsyue.com/2016/利用markdown制作相册.html","excerpt":"","text":"windows平台下得使用excel。 首先批量命名图片，并在命令行下重命名。 =”1 (“&amp;ROW()&amp;”).jpg” =”ren “””&amp;A1&amp;””” “&amp;ROW()&amp;”.jpg” 1 (1).jpg ren “1 (1).jpg” 1.jpg 1 (2).jpg ren “1 (2).jpg” 2.jpg 1 (3).jpg ren “1 (3).jpg” 3.jpg 1 (4).jpg ren “1 (4).jpg” 4.jpg 1 (5).jpg ren “1 (5).jpg” 5.jpg 1 (6).jpg ren “1 (6).jpg” 6.jpg 1 (7).jpg ren “1 (7).jpg” 7.jpg 1 (8).jpg ren “1 (8).jpg” 8.jpg 1 (9).jpg ren “1 (9).jpg” 9.jpg 1 (10).jpg ren “1 (10).jpg” 10.jpg 使用excel行列转换功能，比如每行三张图片，以表格形式展现。=&quot;![&quot;&amp;ROW()&amp;&quot;](/source/images/2014/07/139fuguang/&quot;&amp;ROW()&amp;&quot;.jpg)&quot; //纵向拖动 =OFFSET($A$1,(ROW()-1)*3+COLUMN()-7,0) //矩阵填充 放图片目录与md平级可以进行预览了。 生成静态页面并git push。","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"markdwon","slug":"markdwon","permalink":"https://blog.ccsyue.com/tags/markdwon/"}]},{"title":"搭建免费在线导航","slug":"搭建免费在线导航","date":"2016-12-14T13:20:53.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/搭建免费在线导航.html","link":"","permalink":"https://blog.ccsyue.com/2016/搭建免费在线导航.html","excerpt":"","text":"##准备 本地nodejs环境 远程github仓库e 域名一枚 ##克隆项目代码到本地 git clone git@github.com:deffyc/e.git ##本地初始化 数据文件 data/info.json 初始化为：1&#123;&quot;totalCount&quot;:0,&quot;lastUpdateDate&quot;:&quot;2016-12-12 10:32:06&quot;,&quot;lastUpdateCount&quot;:0&#125; data/sites/目录下清空，并在此目录下新建空文件”1.json” echo ‘’ &gt;1.json 主页模板文件 src/index.jade，修改一定要注意格式，建议做备份 多说评论参数 src/app.js ，记得改完要删除app.min.js 文件，不会自动生成… 123456789101112131415161718var sTmpl = [ &apos;&lt;head&gt;&lt;/head&gt;&apos;, &apos;&lt;body&gt;&apos;, &apos;&lt;style&gt;body&#123;overflow:auto&#125;&lt;/style&gt;&apos;, &apos;&lt;div class=&quot;ds-thread&quot; data-url=&quot;http://e.ccsyue.com&quot; data-thread-key=&quot;&#123;id&#125;&quot;&gt;&lt;/div&gt;&apos;, &apos;&lt;script type=&quot;text/javascript&quot;&gt;&apos;, &apos; var duoshuoQuery = &#123;short_name:&quot;ccsyue&quot;&#125;;&apos;, &apos; (function() &#123;&apos;, &apos; var ds = document.createElement(&quot;script&quot;);&apos;, &apos; ds.type = &quot;text/javascript&quot;;ds.async = true;&apos;, &apos; ds.src = &quot;http://static.duoshuo.com/embed.js&quot;;&apos;, &apos; ds.charset = &quot;UTF-8&quot;;&apos;, &apos; (document.getElementsByTagName(&quot;head&quot;)[0] &apos;, &apos; || document.getElementsByTagName(&quot;body&quot;)[0]).appendChild(ds);&apos;, &apos; &#125;)();&apos;, &apos;&lt;/script&gt;&apos;, &apos;&lt;/body&gt;&apos; ].join(&apos;&apos;); ##远程修改 远程部署到github git add *git commit -m “upload” 在域名管理后台添加cname解析 如果像把根域名也解析过去，记得ping deffyc.github.io可获得ip地址用于A记录解析。 ##工具使用说明： 使用自带的交互脚本来添加 node add.js 编译生成静态网站 node build.js 重新push到github，若使用了CDN记得清缓存。","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"git","slug":"git","permalink":"https://blog.ccsyue.com/tags/git/"}]},{"title":"使用gitbook排版作文","slug":"使用gitbook排版作文","date":"2016-12-13T17:54:53.000Z","updated":"2022-02-09T11:36:14.714Z","comments":true,"path":"2016/使用gitbook排版作文.html","link":"","permalink":"https://blog.ccsyue.com/2016/使用gitbook排版作文.html","excerpt":"","text":"插件帮不上啥忙，还得改源代码。需求格式： 推荐入门教程：GitBook的安装配置 ##安装 nodejs npm install -g cnpm –registry=https://registry.npm.taobao.org 淘宝镜像 cnpm cnpm install -g gitbook_cli -g //版本管理工具 可以试试官方的桌面版编辑器 ，我用的看云 再用git clone到本地。够麻烦的了。 ##配置 单回车分段落。因为想实现段落单回车搞定，所以还得修改一个源文件。路径如下： .gitbook\\versions\\3.2.2\\node_modules\\gitbook-markdown\\node_modules\\kramed\\lib\\rules\\block.js 1paragraph: /^((?:[^\\n]+\\n?(?!hr|heading|lheading|blockquote|tag|def|math))+)\\n*/, 修改为：1paragraph: /^((?:[^\\n]+?(?!hr|heading|lheading|blockquote|tag|def|math))+)\\n*/, 注意我去掉了一个\\n 标题居中等 12345678#markdown &#123; font-family: SimHei, arial, sans-serif; font-size: 24px; line-height: 1.5;&#125;h1, h2, h3, h4, h5, h6 &#123; text-align:center;&#125; 段首缩进两个字符 123p&#123; text-indent: 2em; &#125; 图片居中等，自己还得看着办。","categories":[{"name":"信息技术","slug":"信息技术","permalink":"https://blog.ccsyue.com/categories/信息技术/"}],"tags":[{"name":"gitbook","slug":"gitbook","permalink":"https://blog.ccsyue.com/tags/gitbook/"}]},{"title":"139班叠军被","slug":"139班叠军被","date":"2014-07-01T23:21:03.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2014/139班叠军被.html","link":"","permalink":"https://blog.ccsyue.com/2014/139班叠军被.html","excerpt":"","text":"","categories":[{"name":"相册","slug":"相册","permalink":"https://blog.ccsyue.com/categories/相册/"}],"tags":[{"name":"学生","slug":"学生","permalink":"https://blog.ccsyue.com/tags/学生/"}]},{"title":"139班始终","slug":"139班浮光掠影","date":"2014-07-01T23:11:43.000Z","updated":"2022-02-09T11:36:14.710Z","comments":true,"path":"2014/139班浮光掠影.html","link":"","permalink":"https://blog.ccsyue.com/2014/139班浮光掠影.html","excerpt":"","text":"","categories":[{"name":"相册","slug":"相册","permalink":"https://blog.ccsyue.com/categories/相册/"}],"tags":[{"name":"学生","slug":"学生","permalink":"https://blog.ccsyue.com/tags/学生/"}]}]}